-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- 主機： 127.0.0.1
-- 產生時間： 2026-06-14 03:07:28
-- 伺服器版本： 10.4.32-MariaDB
-- PHP 版本： 8.2.12

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 資料庫： `nojo`
--

-- --------------------------------------------------------

--
-- 資料表結構 `address`
--

CREATE TABLE `address` (
  `address_id` int(11) NOT NULL,
  `zipcode` varchar(5) DEFAULT NULL,
  `street_line` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- 傾印資料表的資料 `address`
--

INSERT INTO `address` (`address_id`, `zipcode`, `street_line`) VALUES
(1, '333', '中興路100巷20號'),
(2, '333', '南美村南上路99號'),
(3, '333', '文化一路259號'),
(4, '333', '萬壽路一段168號'),
(5, '333', '大同路23號'),
(6, '333', '文化一路250號'),
(7, '333', '自由街40號'),
(8, '333', '自強東路269號'),
(9, '333', '萬壽路一段300號'),
(10, '333', '萬壽路二段933巷14號'),
(11, '333', '新路村永和街12號'),
(12, '333', '大同村德明路5號'),
(13, '333', '大湖村文三二街80號'),
(14, '333', '頂興路115巷20號'),
(15, '333', '福源街59號'),
(16, '333', '龍壽村龍校街30號'),
(17, '333', '大坑路一段850號'),
(18, '333', '文昌五街95號'),
(19, '333', '楓樹村光峰路277號'),
(20, '333', '文化里文化二路168號'),
(21, '333', '文七二街72號旁'),
(22, '333', '自強北路38號'),
(23, '333', '同心二路'),
(24, '333', '自強南路81巷'),
(25, '333', '文化七路116號後方'),
(26, '333', '大崗里20鄰大湖一路175號'),
(27, '333', '長庚里長庚醫護新村425號'),
(28, '333', '大崗村樹人路56號'),
(29, '333', '文化一路261號'),
(30, '333', '宏德新村2號'),
(31, '333', '宏慶街34巷48-1號'),
(32, '333', '復興北路與文昌五街交叉口'),
(33, '333', '光峰路及光榮路口'),
(34, '333', '文化三路246號'),
(35, '333', '文化七路與興華五街交叉口'),
(36, '333', '文安街與文光街交叉口'),
(37, '333', '萬壽路一段383號後方'),
(38, '333', '假日花市'),
(39, '333', '自強西路66號'),
(40, '333', '文化里文化三路395號'),
(41, '333', '大同里德明路133號'),
(42, '333', '文化里復興一路212巷32號'),
(43, '333', '文青里樂善一路7號'),
(44, '333', '迴龍里萬壽路一段155號'),
(45, '333', '大華里文化三路552號1樓'),
(46, '333', '新興里自強南路281號'),
(47, '333', '大同里德明路87號'),
(48, '220', '雙十路二段100號'),
(53, NULL, ''),
(54, '320', '中大路300號'),
(55, '220', '未指定路段'),
(56, '333', '復興二路100號'),
(58, '333', '測試路120號'),
(60, '110', '新場地路67號');

-- --------------------------------------------------------

--
-- 資料表結構 `announcements`
--

CREATE TABLE `announcements` (
  `announcement_id` int(11) NOT NULL,
  `title` varchar(200) NOT NULL,
  `content` text NOT NULL,
  `created_at` datetime(6) NOT NULL,
  `photo` longtext DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- 傾印資料表的資料 `announcements`
--

INSERT INTO `announcements` (`announcement_id`, `title`, `content`, `created_at`, `photo`) VALUES
(17, 'test', '廣播!!廣播!!', '2026-06-08 23:00:35.869723', NULL),
(18, '請注意!!!', '沒事', '2026-06-08 23:17:56.502236', NULL),
(19, '太好啦', '嘻嘻', '2026-06-09 00:55:34.553892', NULL),
(20, '【公告】太屌了我瘋掉', '林明和你是救世主', '2026-06-09 05:28:23.742600', '[]'),
(21, '【公告】67', '神明保佑🙏', '2026-06-09 05:29:44.625191', '[]'),
(22, '【通知 - 房間所有人】hihi', 'ddd\n\n[Photos]\nhttp://localhost:8000/media/uploads/a02ffd81-d3b6-4837-8f52-53b5ee146bbb.jpg', '2026-06-10 16:00:57.804950', '[]'),
(23, '【公告】Hello', 'Test\n\n[Photos]\nhttps://las-continuously-aging-becoming.trycloudflare.com/media/uploads/aecc9b8a-18da-48eb-82ea-82a4722cbbe5.png', '2026-06-10 16:19:20.038974', '[]'),
(24, '【公告】Helloooooooo', '6767', '2026-06-11 04:18:16.589588', '[]'),
(25, '【公告】胡凱兒出來', '我們找你\n\n[Photos]\nhttps://nano-differences-nirvana-ireland.trycloudflare.com/media/uploads/26ca6344-d801-4922-8f9c-1503d7ec15b9.jpeg', '2026-06-11 04:51:51.279203', '[]'),
(26, '【公告】Goood', '忍者龜赫赫哈哈\n\n[Photos]\nhttp://mens-specify-december-hospitality.trycloudflare.com/media/uploads/cf336699-76e3-48de-975e-2c3fd411182c.png', '2026-06-11 05:27:25.802728', '[]'),
(27, '【公告】Goood', '忍者龜赫赫哈哈\n\n[Photos]\nhttp://mens-specify-december-hospitality.trycloudflare.com/media/uploads/e79268f2-7472-4989-b733-721ebd190a67.png', '2026-06-11 05:27:28.862395', '[]');

-- --------------------------------------------------------

--
-- 資料表結構 `blacklist`
--

CREATE TABLE `blacklist` (
  `blacklist_id` int(11) NOT NULL,
  `user_id` int(11) NOT NULL,
  `added_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `removed_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- 傾印資料表的資料 `blacklist`
--

INSERT INTO `blacklist` (`blacklist_id`, `user_id`, `added_at`, `removed_at`) VALUES
(3, 52, '2026-06-08 13:29:20', '2026-06-11 04:21:06'),
(11, 356, '2026-06-09 00:55:53', NULL);

-- --------------------------------------------------------

--
-- 資料表結構 `court`
--

CREATE TABLE `court` (
  `court_id` int(11) NOT NULL,
  `venue_id` int(11) NOT NULL,
  `occupied` tinyint(1) NOT NULL DEFAULT 0,
  `base_price` int(5) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- 傾印資料表的資料 `court`
--

INSERT INTO `court` (`court_id`, `venue_id`, `occupied`, `base_price`) VALUES
(1, 1, 0, NULL),
(2, 2, 0, NULL),
(3, 3, 0, NULL),
(4, 3, 0, NULL),
(5, 3, 0, NULL),
(6, 4, 0, NULL),
(7, 4, 0, NULL),
(8, 5, 0, NULL),
(9, 6, 0, NULL),
(10, 7, 0, NULL),
(11, 8, 0, NULL),
(12, 8, 0, NULL),
(13, 8, 0, NULL),
(14, 9, 0, NULL),
(15, 10, 0, NULL),
(16, 10, 0, NULL),
(17, 10, 0, NULL),
(18, 11, 0, NULL),
(19, 12, 0, NULL),
(20, 12, 0, NULL),
(21, 13, 0, NULL),
(22, 14, 0, NULL),
(23, 15, 0, NULL),
(24, 16, 0, NULL),
(25, 16, 0, NULL),
(26, 17, 0, NULL),
(27, 17, 0, NULL),
(28, 17, 0, NULL),
(29, 18, 0, NULL),
(30, 18, 0, NULL),
(31, 19, 0, NULL),
(32, 20, 0, NULL),
(33, 21, 0, NULL),
(34, 22, 0, NULL),
(35, 23, 0, NULL),
(36, 24, 0, NULL),
(37, 25, 0, NULL),
(38, 26, 0, NULL),
(39, 27, 0, NULL),
(40, 28, 0, NULL),
(41, 29, 0, NULL),
(42, 30, 0, NULL),
(43, 31, 0, NULL),
(44, 32, 0, NULL),
(45, 33, 0, NULL),
(46, 34, 0, NULL),
(47, 35, 0, NULL),
(48, 36, 0, NULL),
(49, 37, 0, NULL),
(50, 38, 0, NULL),
(51, 39, 0, NULL),
(52, 40, 0, NULL),
(53, 41, 0, NULL),
(54, 41, 0, NULL),
(55, 42, 0, NULL),
(56, 43, 0, NULL),
(57, 44, 0, NULL),
(58, 45, 0, NULL),
(59, 46, 0, NULL),
(60, 47, 0, NULL),
(61, 48, 0, NULL),
(62, 49, 0, NULL),
(63, 50, 0, NULL),
(64, 51, 0, NULL),
(65, 52, 0, NULL),
(66, 52, 0, NULL),
(67, 52, 0, NULL),
(68, 52, 0, NULL),
(69, 52, 0, NULL),
(70, 52, 0, NULL),
(71, 52, 0, NULL),
(72, 52, 0, NULL),
(73, 52, 0, NULL),
(74, 52, 0, NULL),
(75, 52, 0, NULL),
(76, 52, 0, NULL),
(77, 52, 0, NULL),
(78, 53, 0, NULL),
(79, 53, 0, NULL),
(80, 53, 0, NULL),
(81, 53, 0, NULL),
(82, 53, 0, NULL),
(83, 53, 0, NULL),
(84, 53, 0, NULL),
(85, 53, 0, NULL),
(86, 53, 0, NULL),
(87, 53, 0, NULL),
(88, 54, 0, NULL),
(89, 54, 0, NULL),
(90, 54, 0, NULL),
(91, 54, 0, NULL),
(92, 54, 0, NULL),
(93, 54, 0, NULL),
(94, 54, 0, NULL),
(95, 54, 0, NULL),
(96, 54, 0, NULL),
(97, 54, 0, NULL),
(98, 55, 0, NULL),
(99, 55, 0, NULL),
(100, 55, 0, NULL),
(101, 55, 0, NULL),
(102, 55, 0, NULL),
(103, 55, 0, NULL),
(104, 56, 0, NULL),
(105, 56, 0, NULL),
(106, 56, 0, NULL),
(107, 56, 0, NULL),
(108, 56, 0, NULL),
(109, 56, 0, NULL),
(110, 56, 0, NULL),
(111, 56, 0, NULL),
(112, 57, 0, NULL),
(113, 57, 0, NULL),
(114, 57, 0, NULL),
(115, 57, 0, NULL),
(116, 57, 0, NULL),
(117, 57, 0, NULL),
(118, 57, 0, NULL),
(119, 58, 0, NULL),
(120, 58, 0, NULL),
(121, 58, 0, NULL),
(122, 58, 0, NULL),
(123, 58, 0, NULL),
(124, 58, 0, NULL),
(125, 58, 0, NULL),
(126, 58, 0, NULL),
(127, 58, 0, NULL),
(128, 59, 0, NULL),
(129, 59, 0, NULL),
(130, 59, 0, NULL),
(131, 59, 0, NULL),
(132, 59, 0, NULL),
(133, 59, 0, NULL),
(134, 59, 0, NULL),
(135, 59, 0, NULL),
(136, 59, 0, NULL),
(137, 59, 0, NULL),
(138, 59, 0, NULL),
(139, 65, 0, 0),
(140, 65, 0, 0),
(141, 65, 0, 0),
(142, 66, 0, 0),
(143, 66, 0, 0),
(144, 66, 0, 0),
(150, 68, 0, 0),
(151, 68, 0, 0),
(152, 68, 0, 0),
(181, 77, 0, 0),
(182, 77, 0, 0),
(183, 77, 0, 0),
(184, 77, 0, 0),
(185, 77, 0, 0),
(187, 12, 0, 0),
(188, 12, 0, 0),
(189, 12, 0, 0),
(190, 68, 0, 300),
(191, 1, 0, 0),
(192, 79, 0, 0),
(193, 79, 0, 0),
(194, 79, 0, 0),
(201, 82, 0, 0),
(202, 82, 0, 0),
(203, 82, 0, 0);

-- --------------------------------------------------------

--
-- 資料表結構 `court_conflicts`
--

CREATE TABLE `court_conflicts` (
  `conflict_id` int(11) NOT NULL,
  `court_id_1` int(11) NOT NULL,
  `court_id_2` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- 資料表結構 `court_sports`
--

CREATE TABLE `court_sports` (
  `id` int(11) NOT NULL,
  `court_id` int(11) NOT NULL,
  `sport_id` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- 傾印資料表的資料 `court_sports`
--

INSERT INTO `court_sports` (`id`, `court_id`, `sport_id`) VALUES
(1, 1, 1),
(140, 1, 2),
(2, 2, 1),
(3, 3, 2),
(4, 4, 3),
(5, 5, 1),
(6, 6, 2),
(7, 7, 1),
(8, 8, 2),
(9, 9, 2),
(10, 10, 1),
(11, 10, 3),
(12, 11, 1),
(13, 12, 2),
(14, 13, 3),
(15, 14, 1),
(16, 15, 2),
(17, 16, 1),
(18, 17, 1),
(19, 18, 3),
(20, 19, 1),
(21, 20, 3),
(22, 21, 1),
(23, 22, 1),
(24, 23, 1),
(25, 24, 1),
(26, 25, 3),
(27, 26, 1),
(28, 27, 2),
(29, 28, 3),
(30, 29, 3),
(31, 30, 1),
(32, 31, 1),
(33, 32, 1),
(34, 33, 1),
(35, 34, 1),
(36, 35, 1),
(37, 36, 1),
(38, 37, 2),
(39, 38, 1),
(40, 39, 1),
(41, 40, 1),
(42, 41, 1),
(43, 42, 2),
(44, 43, 1),
(45, 44, 1),
(46, 45, 1),
(47, 46, 1),
(48, 47, 1),
(49, 48, 2),
(50, 49, 1),
(51, 50, 1),
(52, 51, 2),
(53, 52, 1),
(54, 53, 2),
(55, 54, 3),
(56, 55, 1),
(57, 56, 1),
(58, 57, 1),
(59, 58, 1),
(60, 59, 1),
(61, 60, 1),
(62, 61, 1),
(63, 62, 1),
(64, 63, 2),
(65, 64, 1),
(66, 65, 5),
(67, 66, 5),
(68, 67, 5),
(69, 68, 5),
(70, 69, 5),
(71, 70, 5),
(72, 71, 5),
(73, 72, 5),
(74, 73, 5),
(75, 74, 5),
(76, 75, 5),
(77, 76, 5),
(78, 77, 5),
(79, 78, 5),
(80, 79, 5),
(81, 80, 5),
(82, 81, 5),
(83, 82, 5),
(84, 83, 5),
(85, 84, 5),
(86, 85, 5),
(87, 86, 5),
(88, 87, 5),
(89, 88, 5),
(90, 89, 5),
(91, 90, 5),
(92, 91, 5),
(93, 92, 5),
(94, 93, 5),
(95, 94, 5),
(96, 95, 5),
(97, 96, 5),
(98, 97, 5),
(99, 98, 5),
(100, 99, 5),
(101, 100, 5),
(102, 101, 5),
(103, 102, 5),
(104, 103, 5),
(105, 104, 5),
(106, 105, 5),
(107, 106, 5),
(108, 107, 5),
(109, 108, 5),
(110, 109, 5),
(111, 110, 5),
(112, 111, 5),
(113, 112, 5),
(114, 113, 5),
(115, 114, 5),
(116, 115, 5),
(117, 116, 5),
(118, 117, 5),
(119, 118, 5),
(120, 119, 5),
(121, 120, 5),
(122, 121, 5),
(123, 122, 5),
(124, 123, 5),
(125, 124, 5),
(126, 125, 5),
(127, 126, 5),
(128, 127, 5),
(129, 128, 5),
(130, 129, 5),
(131, 130, 5),
(132, 131, 5),
(133, 132, 5),
(134, 133, 5),
(135, 134, 5),
(136, 135, 5),
(137, 136, 5),
(138, 137, 5),
(139, 138, 5),
(170, 139, 1),
(171, 140, 1),
(172, 141, 1),
(173, 142, 1),
(174, 143, 1),
(175, 144, 1),
(184, 150, 1),
(185, 151, 1),
(186, 152, 1),
(259, 181, 1),
(260, 182, 1),
(261, 183, 1),
(262, 184, 1),
(263, 185, 1),
(267, 187, 1),
(268, 188, 1),
(269, 189, 1),
(270, 190, 1),
(271, 191, 1),
(281, 192, 1),
(282, 193, 1),
(283, 194, 4),
(290, 201, 3),
(291, 202, 2),
(292, 203, 2);

-- --------------------------------------------------------

--
-- 資料表結構 `facilities`
--

CREATE TABLE `facilities` (
  `facility_id` int(11) NOT NULL,
  `name` varchar(50) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- 傾印資料表的資料 `facilities`
--

INSERT INTO `facilities` (`facility_id`, `name`) VALUES
(1, '停車場'),
(5, '免費車位'),
(2, '冷氣機'),
(3, '廁所'),
(4, '無障礙停車場'),
(6, '熱水淋浴間'),
(7, '自動販賣機');

-- --------------------------------------------------------

--
-- 資料表結構 `feedbacks`
--

CREATE TABLE `feedbacks` (
  `feedback_id` int(11) NOT NULL,
  `user_id` int(11) DEFAULT NULL,
  `feedback_type_id` int(11) NOT NULL DEFAULT 3,
  `content` text NOT NULL,
  `is_handled` tinyint(1) NOT NULL DEFAULT 0,
  `created_at` datetime(6) NOT NULL,
  `admin_reply` longtext DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- 傾印資料表的資料 `feedbacks`
--

INSERT INTO `feedbacks` (`feedback_id`, `user_id`, `feedback_type_id`, `content`, `is_handled`, `created_at`, `admin_reply`) VALUES
(5, 50, 1, '可以加個推薦功能', 1, '2026-06-08 23:19:21.005850', '再說'),
(6, 49, 3, '太屌啦', 0, '2026-06-09 00:56:56.570907', NULL),
(7, 94, 1, '林明和你超強超帥', 1, '2026-06-09 05:27:23.667445', '👍讚讚讚🥹🥹🥹🥹'),
(8, 92, 1, '哈嘍', 1, '2026-06-09 06:17:41.897660', 'hi'),
(9, 342, 2, 'Yp怎麼那麼帥', 0, '2026-06-09 07:30:59.664489', NULL),
(10, 352, 1, '憨憨', 0, '2026-06-09 08:50:22.157289', NULL),
(11, 352, 1, '6767676767', 0, '2026-06-09 08:53:47.693717', NULL),
(12, 353, 1, '檢舉', 0, '2026-06-09 08:55:07.717919', NULL),
(13, 345, 4, '下大雨 屋頂漏水', 0, '2026-06-09 08:57:56.518946', NULL);

-- --------------------------------------------------------

--
-- 資料表結構 `feedback_types`
--

CREATE TABLE `feedback_types` (
  `id` int(11) NOT NULL,
  `name` varchar(50) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- 傾印資料表的資料 `feedback_types`
--

INSERT INTO `feedback_types` (`id`, `name`) VALUES
(1, '功能建議 (想要更多)'),
(2, 'Bug 回報 (系統出錯)'),
(3, '其他'),
(4, '場地/活動問題');

-- --------------------------------------------------------

--
-- 資料表結構 `gamesmatches`
--

CREATE TABLE `gamesmatches` (
  `game_id` int(11) NOT NULL,
  `user_id` int(11) NOT NULL,
  `court_id` int(20) NOT NULL,
  `sport_id` int(11) NOT NULL,
  `least_players` int(11) NOT NULL,
  `most_players` int(11) NOT NULL,
  `target_level` enum('休閒','業餘','高手') DEFAULT NULL,
  `weather` longtext CHARACTER SET utf8mb4 COLLATE utf8mb4_bin DEFAULT NULL CHECK (json_valid(`weather`)),
  `air_index` int(11) DEFAULT NULL,
  `match_status` enum('recruiting','full','closed','started','failed_to_start') NOT NULL DEFAULT 'recruiting',
  `booking_date` date NOT NULL COMMENT '紀錄球局預約的日期',
  `time_slot` varchar(50) NOT NULL COMMENT '紀錄球局進行的時間區間，例如 18:00-20:00',
  `total_price` decimal(10,2) DEFAULT NULL,
  `deposit_required` tinyint(1) NOT NULL DEFAULT 0,
  `cancel_deadline` timestamp NULL DEFAULT NULL,
  `booking_status` enum('已佔到/已預約','未佔到/未預約','未確認') NOT NULL DEFAULT '未確認',
  `gender_limit` enum('不限','限男','限女') NOT NULL DEFAULT '不限',
  `game_note` text DEFAULT NULL COMMENT '佔場位置或衣服說明備註',
  `game_name` varchar(100) NOT NULL COMMENT '比賽名稱',
  `venue_note` text DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- 傾印資料表的資料 `gamesmatches`
--

INSERT INTO `gamesmatches` (`game_id`, `user_id`, `court_id`, `sport_id`, `least_players`, `most_players`, `target_level`, `weather`, `air_index`, `match_status`, `booking_date`, `time_slot`, `total_price`, `deposit_required`, `cancel_deadline`, `booking_status`, `gender_limit`, `game_note`, `game_name`, `venue_note`) VALUES
(1208, 50, 20, 3, 2, 4, '休閒', NULL, NULL, 'closed', '2026-06-09', '02:55-04:55', 0.00, 0, '2026-06-08 10:54:23', '已佔到/已預約', '不限', '這是我剛發起的揪團，歡迎大家來玩！', '打球阿', NULL),
(1209, 50, 20, 3, 2, 4, '休閒', NULL, NULL, 'closed', '2026-06-09', '03:16-05:16', 0.00, 0, '2026-06-08 11:13:53', '已佔到/已預約', '限男', 'test', '今晚薄膜', NULL),
(1210, 94, 1, 1, 2, 4, '業餘', NULL, NULL, 'full', '2026-06-25', '17:16-19:16', 1000.00, 0, '2026-06-24 01:16:00', '未確認', '不限', '快打啦', '快打旋風', NULL),
(1211, 94, 78, 5, 2, 4, '休閒', NULL, NULL, 'closed', '2026-06-09', '06:10-09:10', 300.00, 0, '2026-06-08 13:10:00', '未確認', '不限', '等你來加ㄧ', '三缺一 急', NULL),
(1212, 269, 21, 1, 2, 4, '休閒', NULL, NULL, 'closed', '2026-06-09', '04:19-05:19', 0.00, 0, '2026-06-08 11:19:35', '未確認', '不限', '這是我剛發起的揪團，歡迎大家來玩！', '找YP單挑', NULL),
(1213, 269, 8, 2, 2, 4, '休閒', NULL, NULL, 'closed', '2026-06-10', '03:20-04:20', 0.00, 0, '2026-06-09 10:20:00', '未確認', '限女', '這是我剛發起的揪團，歡迎大家來玩！', '來都來', NULL),
(1273, 50, 1, 1, 2, 4, '休閒', NULL, NULL, 'closed', '2026-06-10', '06:53-08:53', 0.00, 0, '2026-06-08 14:53:00', '已佔到/已預約', '不限', '這是我剛發起的揪團，歡迎大家來玩！', '測試檢舉', NULL),
(1277, 94, 1, 1, 2, 4, '休閒', NULL, NULL, 'recruiting', '2026-07-31', '10:23-12:23', 2334.00, 0, '2026-07-29 18:23:00', '未確認', '不限', '這是我剛發起的揪團，歡迎大家來玩！', '12345', NULL),
(1278, 94, 1, 1, 2, 4, '休閒', NULL, NULL, 'recruiting', '2026-06-25', '10:27-12:27', 123.00, 0, '2026-06-23 18:27:00', '未確認', '不限', '這是我剛發起的揪團，歡迎大家來玩！', 'test new', NULL),
(1279, 94, 1, 1, 2, 4, '休閒', NULL, NULL, 'recruiting', '2026-06-26', '10:28-12:28', 123.00, 0, '2026-06-24 18:28:00', '未確認', '限女', '這是我剛發起的揪團，歡迎大家來玩！', 'girls new', NULL),
(1280, 94, 65, 5, 2, 4, '休閒', NULL, NULL, 'recruiting', '2026-06-27', '10:29-12:29', 0.00, 0, '2026-06-25 18:29:00', '未確認', '不限', '這是我剛發起的揪團，歡迎大家來玩！', 'maojang new', NULL),
(1281, 49, 65, 5, 2, 4, '休閒', NULL, NULL, 'closed', '2026-06-10', '10:32-12:32', 0.00, 0, '2026-06-09 17:32:00', '未確認', '限女', '這是我剛發起的揪團，歡迎大家來玩！', 'test11111', NULL),
(1338, 34, 1, 1, 2, 4, '休閒', NULL, NULL, 'closed', '2026-06-09', '12:06-14:06', 0.00, 0, '2026-06-08 20:04:27', '未確認', '不限', '這是我剛發起的揪團，歡迎大家來玩！', '測試自動化', NULL),
(1343, 92, 65, 5, 2, 4, '休閒', NULL, NULL, 'closed', '2026-06-13', '14:50-16:50', 67.00, 0, '2026-06-11 22:50:00', '未確認', '限男', '麻醬麵', '麻醬麵', NULL),
(1346, 342, 78, 5, 2, 4, '休閒', NULL, NULL, 'recruiting', '2026-06-28', '15:30-17:30', 2110.00, 0, '2026-06-26 23:30:00', '未確認', '限女', 'Yp太帥了', 'Helooooooooo yp好帥', NULL),
(1347, 92, 1, 4, 2, 4, '休閒', NULL, NULL, 'closed', '2026-06-11', '15:50-17:50', 67.00, 0, '2026-06-09 23:50:00', '未確認', '限男', '乒乒乓乓', '乒乒乓乓', NULL),
(1355, 352, 1, 1, 2, 4, '休閒', NULL, NULL, 'recruiting', '2026-07-09', '16:48-18:48', 6767.00, 0, '2026-07-08 00:48:00', '已佔到/已預約', '不限', '來的都憨仔', '憨仔都來', NULL),
(1357, 349, 1, 1, 2, 4, '休閒', NULL, NULL, 'closed', '2026-06-09', '16:49-18:49', 6767.00, 0, '2026-06-09 00:48:41', '未確認', '不限', '這是我剛發起的揪團，歡迎大家來玩！', '我是憨仔', NULL),
(1358, 345, 1, 2, 2, 4, '休閒', NULL, NULL, 'closed', '2026-06-11', '22:17-00:17', 10000.00, 0, '2026-06-10 06:17:00', '已佔到/已預約', '不限', '這是我剛發起的揪團，歡迎大家來玩！', '一起起床', NULL),
(1361, 343, 65, 5, 1, 80, '休閒', NULL, NULL, 'closed', '2026-06-09', '20:48-22:48', 0.00, 0, '2026-06-09 03:48:00', '已佔到/已預約', '不限', '這是我剛發起的揪團，歡迎大家來玩！', '上資料庫上到九點', NULL),
(1363, 346, 19, 1, 2, 4, '休閒', NULL, NULL, 'closed', '2026-06-09', '18:50-20:50', 0.00, 0, '2026-06-09 01:50:00', '已佔到/已預約', '不限', '我愛資料庫', 'Letgo 資料庫', NULL),
(1365, 353, 1, 1, 2, 100, '休閒', NULL, NULL, 'recruiting', '2026-06-17', '16:50-18:50', 0.00, 0, '2026-06-16 00:50:00', '已佔到/已預約', '不限', '這是我剛發起的揪團，歡迎大家來玩！', '今晚英雄聯盟', NULL),
(1367, 358, 1, 1, 2, 100, '休閒', NULL, NULL, 'closed', '2026-07-09', '16:51-19:51', 0.00, 0, '2026-07-08 00:51:00', '已佔到/已預約', '不限', '這是我剛發起的揪團，歡迎大家來玩！', '資料結構讚', NULL),
(1368, 353, 1, 1, 2, 4, '休閒', NULL, NULL, 'closed', '2026-06-23', '16:52-18:52', 0.00, 0, '2026-06-22 00:52:00', '已佔到/已預約', '不限', '這是我剛發起的揪團，歡迎大家來玩！', '大概80', NULL),
(1369, 356, 65, 5, 2, 100, '休閒', NULL, NULL, 'closed', '2026-06-10', '10:00-12:00', 0.00, 0, '2026-06-09 17:00:00', '已佔到/已預約', '不限', '很解啦', '欸欸，明天要考資結啦', NULL),
(1370, 362, 1, 1, 2, 4, '休閒', NULL, NULL, 'closed', '2026-06-12', '17:00-19:00', 0.00, 0, '2026-06-11 01:00:00', '已佔到/已預約', '不限', '這是我剛發起的揪團，歡迎大家來玩！', '你媽', NULL),
(1372, 34, 1, 2, 2, 4, '休閒', NULL, NULL, '', '2026-06-10', '23:40-23:45', 0.00, 0, '2026-06-10 19:00:00', '已佔到/已預約', '不限', 'test', '測試回報場地', NULL),
(1373, 94, 1, 1, 2, 4, '高手', NULL, NULL, 'recruiting', '2026-06-25', '12:27-14:27', 1000.00, 0, '2026-06-23 20:27:00', '未確認', '不限', '', 'YP放過我吧', NULL),
(1374, 94, 1, 1, 2, 4, '休閒', NULL, NULL, 'recruiting', '2026-06-30', '12:28-14:28', 30.00, 0, '2026-06-28 20:28:00', '未確認', '限女', '', '陽鑫是冗員都沒做事 還在那邊嘰嘰叫', NULL),
(1375, 365, 54, 3, 1, 2, '休閒', NULL, NULL, 'full', '2026-06-30', '12:41-17:41', 10000.00, 0, '2026-06-28 20:41:00', '未確認', '限女', '', '我是簡綠', NULL),
(1431, 34, 1, 1, 2, 4, '休閒', NULL, NULL, 'closed', '2026-06-11', '13:30-15:30', 0.00, 0, '2026-06-10 21:00:09', '已佔到/已預約', '不限', '', '測試球局狀態', NULL),
(1443, 49, 1, 1, 2, 4, '休閒', NULL, NULL, 'closed', '2026-06-18', '13:09-15:09', 0.00, 0, '2026-06-16 21:09:00', '未確認', '不限', '', '測試結束', NULL),
(1444, 49, 1, 1, 2, 4, '休閒', NULL, NULL, 'closed', '2026-06-11', '13:10-13:12', 0.00, 0, '2026-06-15 21:10:00', '已佔到/已預約', '不限', '', '測試結束', NULL),
(1456, 395, 1, 2, 1, 4, '高手', NULL, NULL, 'closed', '2026-06-12', '19:00-21:00', 600.00, 0, '2026-06-11 03:00:00', '未確認', '不限', '測試公告推播功能。', '公告測試羽球局', NULL),
(1479, 94, 194, 4, 2, 4, '休閒', NULL, NULL, 'closed', '2026-06-11', '12:50-13:00', 1000.00, 0, '2026-06-10 22:50:00', '未確認', '不限', '', 'test20260611_1', NULL);

-- --------------------------------------------------------

--
-- 資料表結構 `game_bulletins`
--

CREATE TABLE `game_bulletins` (
  `bulletin_id` int(11) NOT NULL,
  `game_id` int(11) NOT NULL,
  `title` varchar(200) NOT NULL DEFAULT '公告',
  `content` text NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- 傾印資料表的資料 `game_bulletins`
--

INSERT INTO `game_bulletins` (`bulletin_id`, `game_id`, `title`, `content`, `created_at`) VALUES
(48, 1365, '公告', '真假啦 今晚內戰', '2026-06-09 00:51:02'),
(49, 1363, '公告', '今天可能不能打唷', '2026-06-09 00:53:00'),
(50, 1363, '公告', '好像可以用', '2026-06-09 00:53:49'),
(51, 1375, '公告', '我是簡綠簡綠是我', '2026-06-10 20:47:15'),
(52, 1210, '公告', '讚讚', '2026-06-10 20:48:17'),
(53, 1456, '更換場地通知', '請大家直接到 3 號場地集合，謝謝！', '2026-06-10 21:15:07');

-- --------------------------------------------------------

--
-- 資料表結構 `keep`
--

CREATE TABLE `keep` (
  `id` int(11) NOT NULL,
  `user_id` int(11) NOT NULL,
  `game_id` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

-- --------------------------------------------------------

--
-- 資料表結構 `match_participants`
--

CREATE TABLE `match_participants` (
  `list_id` int(11) NOT NULL,
  `game_id` int(11) NOT NULL,
  `user_id` int(11) NOT NULL,
  `joined_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- 傾印資料表的資料 `match_participants`
--

INSERT INTO `match_participants` (`list_id`, `game_id`, `user_id`, `joined_at`) VALUES
(331, 1208, 50, '2026-06-08 10:54:23'),
(332, 1208, 264, '2026-06-08 10:54:35'),
(333, 1209, 50, '2026-06-08 11:13:53'),
(334, 1209, 52, '2026-06-08 11:14:34'),
(335, 1210, 94, '2026-06-08 11:16:58'),
(336, 1211, 94, '2026-06-08 11:18:05'),
(337, 1212, 269, '2026-06-08 11:19:35'),
(338, 1213, 269, '2026-06-08 11:20:18'),
(339, 1213, 264, '2026-06-08 11:21:32'),
(340, 1212, 94, '2026-06-08 11:28:37'),
(407, 1211, 269, '2026-06-08 13:19:52'),
(408, 1211, 52, '2026-06-08 13:20:03'),
(422, 1273, 50, '2026-06-08 13:58:49'),
(426, 1213, 49, '2026-06-08 17:02:28'),
(429, 1277, 94, '2026-06-08 18:25:11'),
(430, 1278, 94, '2026-06-08 18:27:01'),
(431, 1279, 94, '2026-06-08 18:28:58'),
(432, 1280, 94, '2026-06-08 18:29:34'),
(434, 1281, 49, '2026-06-08 18:32:43'),
(487, 1338, 34, '2026-06-08 20:04:27'),
(488, 1338, 53, '2026-06-08 20:04:37'),
(489, 1338, 51, '2026-06-08 20:05:16'),
(495, 1343, 92, '2026-06-08 22:50:21'),
(498, 1346, 342, '2026-06-08 23:30:28'),
(499, 1281, 342, '2026-06-08 23:33:13'),
(500, 1347, 92, '2026-06-08 23:50:08'),
(501, 1273, 92, '2026-06-09 00:16:31'),
(510, 1347, 349, '2026-06-09 00:46:54'),
(513, 1347, 346, '2026-06-09 00:47:07'),
(522, 1355, 352, '2026-06-09 00:48:00'),
(527, 1357, 349, '2026-06-09 00:48:41'),
(528, 1357, 360, '2026-06-09 00:48:56'),
(530, 1358, 345, '2026-06-09 00:49:04'),
(533, 1361, 343, '2026-06-09 00:49:46'),
(535, 1361, 353, '2026-06-09 00:50:00'),
(536, 1361, 357, '2026-06-09 00:50:02'),
(537, 1361, 356, '2026-06-09 00:50:03'),
(538, 1361, 349, '2026-06-09 00:50:04'),
(539, 1358, 343, '2026-06-09 00:50:09'),
(540, 1363, 346, '2026-06-09 00:50:10'),
(542, 1361, 347, '2026-06-09 00:50:20'),
(543, 1365, 353, '2026-06-09 00:50:27'),
(544, 1361, 345, '2026-06-09 00:50:30'),
(545, 1365, 349, '2026-06-09 00:50:34'),
(546, 1365, 357, '2026-06-09 00:50:48'),
(547, 1365, 356, '2026-06-09 00:50:52'),
(549, 1365, 352, '2026-06-09 00:51:35'),
(552, 1367, 358, '2026-06-09 00:51:44'),
(555, 1368, 353, '2026-06-09 00:52:03'),
(556, 1363, 349, '2026-06-09 00:52:39'),
(557, 1363, 347, '2026-06-09 00:52:43'),
(558, 1363, 343, '2026-06-09 00:52:43'),
(559, 1363, 360, '2026-06-09 00:52:44'),
(560, 1363, 353, '2026-06-09 00:52:44'),
(561, 1367, 350, '2026-06-09 00:53:11'),
(562, 1367, 361, '2026-06-09 00:53:49'),
(563, 1346, 361, '2026-06-09 00:54:48'),
(564, 1369, 356, '2026-06-09 00:55:04'),
(565, 1369, 357, '2026-06-09 00:55:18'),
(566, 1369, 353, '2026-06-09 00:55:26'),
(567, 1369, 358, '2026-06-09 00:55:30'),
(568, 1369, 352, '2026-06-09 00:55:45'),
(569, 1369, 350, '2026-06-09 00:56:39'),
(570, 1370, 362, '2026-06-09 01:00:03'),
(571, 1370, 357, '2026-06-09 01:00:58'),
(572, 1367, 94, '2026-06-09 01:03:06'),
(573, 1368, 349, '2026-06-09 01:37:27'),
(576, 1370, 92, '2026-06-09 04:59:22'),
(577, 1368, 92, '2026-06-09 05:03:16'),
(578, 1358, 92, '2026-06-09 05:05:59'),
(579, 1369, 92, '2026-06-09 05:07:41'),
(580, 1367, 363, '2026-06-09 22:08:03'),
(581, 1367, 364, '2026-06-09 22:11:22'),
(582, 1365, 364, '2026-06-09 22:12:01'),
(588, 1280, 92, '2026-06-09 23:46:51'),
(600, 1367, 34, '2026-06-10 01:58:52'),
(609, 1365, 50, '2026-06-10 03:17:23'),
(619, 1210, 34, '2026-06-10 03:33:28'),
(644, 1210, 53, '2026-06-10 05:40:06'),
(648, 1210, 51, '2026-06-10 06:35:15'),
(655, 1372, 34, '2026-06-10 07:28:41'),
(656, 1372, 51, '2026-06-10 07:30:09'),
(657, 1372, 50, '2026-06-10 07:34:56'),
(658, 1372, 53, '2026-06-10 07:35:16'),
(659, 1365, 34, '2026-06-10 07:58:04'),
(660, 1373, 94, '2026-06-10 20:26:55'),
(661, 1374, 94, '2026-06-10 20:28:42'),
(662, 1375, 365, '2026-06-10 20:41:41'),
(663, 1375, 49, '2026-06-10 20:46:25'),
(664, 1375, 94, '2026-06-10 20:48:59'),
(665, 1346, 94, '2026-06-10 20:49:38'),
(666, 1374, 49, '2026-06-10 20:50:34'),
(717, 1431, 34, '2026-06-10 21:00:09'),
(718, 1431, 49, '2026-06-10 21:00:20'),
(719, 1431, 92, '2026-06-10 21:00:27'),
(720, 1431, 53, '2026-06-10 21:00:46'),
(731, 1443, 49, '2026-06-10 21:08:39'),
(732, 1444, 49, '2026-06-10 21:09:43'),
(733, 1444, 34, '2026-06-10 21:09:55'),
(734, 1444, 53, '2026-06-10 21:10:07'),
(745, 1456, 395, '2026-06-10 21:15:07'),
(746, 1456, 397, '2026-06-10 21:15:07'),
(767, 1479, 94, '2026-06-10 21:47:08'),
(768, 1479, 49, '2026-06-10 21:47:29'),
(769, 1479, 92, '2026-06-10 21:48:08'),
(771, 1479, 346, '2026-06-10 21:49:15'),
(772, 1210, 50, '2026-06-11 05:20:58');

-- --------------------------------------------------------

--
-- 資料表結構 `notification`
--

CREATE TABLE `notification` (
  `notification_id` int(11) NOT NULL,
  `game_id` int(11) DEFAULT NULL,
  `message` text NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `is_read` tinyint(1) DEFAULT 0,
  `user_id` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- 傾印資料表的資料 `notification`
--

INSERT INTO `notification` (`notification_id`, `game_id`, `message`, `created_at`, `is_read`, `user_id`) VALUES
(736, 1208, '【活動提醒】您參與的球局「打球阿」將在 24 小時內開始！請準時抵達。', '2026-06-08 10:54:37', 1, 264),
(738, 1208, '【活動開始】您參與的球局「打球阿」已經開始！祝您運動愉快。', '2026-06-08 10:55:01', 1, 264),
(740, 1208, '【場地狀態回報通知】您報名的球局「打球阿」場地狀態已更新！\n狀態：已確認/已預約', '2026-06-08 10:56:15', 1, 264),
(742, 1208, '【場地狀態回報通知】您報名的球局「打球阿」場地狀態已更新！\n狀態：已確認/已預約', '2026-06-08 11:09:44', 1, 264),
(744, 1208, '【場地狀態回報通知】您報名的球局「打球阿」場地狀態已更新！\n狀態：已確認/已預約', '2026-06-08 11:10:34', 1, 264),
(750, 1212, '【活動提醒】您參與的球局「找YP單挑」將在 24 小時內開始！請準時抵達。', '2026-06-08 11:19:55', 0, 269),
(751, 1213, '【活動提醒】您參與的球局「來都來」將在 24 小時內開始！請準時抵達。', '2026-06-08 11:20:30', 0, 269),
(752, 1213, '【活動提醒】您參與的球局「來都來」將在 24 小時內開始！請準時抵達。', '2026-06-08 11:21:37', 1, 264),
(770, 1208, '【場地狀態回報通知】您報名的球局「打球阿」場地狀態已更新！\n狀態：confirmed', '2026-06-08 12:08:05', 1, 264),
(772, 1208, '【場地狀態回報通知】您報名的球局「打球阿」場地狀態已更新！\n狀態：confirmed', '2026-06-08 12:08:48', 1, 264),
(774, 1208, '【場地狀態回報通知】您報名的球局「打球阿」場地狀態已更新！\n狀態：confirmed', '2026-06-08 12:16:41', 1, 264),
(776, 1212, '【活動開始】您參與的球局「找YP單挑」已經開始！祝您運動愉快。', '2026-06-08 12:27:13', 0, 269),
(778, 1208, '【場地狀態回報通知】您報名的球局「打球阿」場地狀態已更新！\n狀態：confirmed', '2026-06-08 12:27:20', 1, 264),
(780, 1208, '【場地狀態回報通知】您報名的球局「打球阿」場地狀態已更新！\n狀態：confirmed', '2026-06-08 12:27:26', 1, 264),
(782, 1208, '【場地狀態回報通知】您報名的球局「打球阿」場地狀態已更新！\n狀態：failed', '2026-06-08 12:27:48', 1, 264),
(784, 1208, '【場地狀態回報通知】您報名的球局「打球阿」場地狀態已更新！\n狀態：confirmed', '2026-06-08 12:28:01', 1, 264),
(786, 1208, '【場地狀態回報通知】您報名的球局「打球阿」場地狀態已更新！\n狀態：confirmed', '2026-06-08 12:29:08', 1, 264),
(788, 1208, '【場地狀態回報通知】您報名的球局「打球阿」場地狀態已更新！\n狀態：confirmed', '2026-06-08 12:31:48', 1, 264),
(790, 1208, '【場地狀態回報通知】您報名的球局「打球阿」場地狀態已更新！\n狀態：confirmed', '2026-06-08 12:32:38', 1, 264),
(792, 1208, '【場地狀態回報通知】您報名的球局「打球阿」場地狀態已更新！\n狀態：confirmed', '2026-06-08 12:33:45', 1, 264),
(811, 1208, '【場地狀態回報通知】您報名的球局「打球阿」場地狀態已更新！\n狀態：已佔到/已預約', '2026-06-08 12:46:28', 1, 264),
(815, 1208, '【活動結束】您參與的球局「打球阿」已順利結束，球局已自動關閉。', '2026-06-08 12:57:31', 1, 264),
(860, 1212, '【活動結束】您參與的球局「找YP單挑」已順利結束，球局已自動關閉。', '2026-06-08 13:19:35', 0, 269),
(861, 1211, '【活動提醒】您參與的球局「三缺一 急」將在 24 小時內開始！請準時抵達。', '2026-06-08 13:19:49', 1, 50),
(862, 1211, '【活動提醒】您參與的球局「三缺一 急」將在 24 小時內開始！請準時抵達。', '2026-06-08 13:19:54', 0, 269),
(863, 1211, '【活動提醒】您參與的球局「三缺一 急」將在 24 小時內開始！請準時抵達。', '2026-06-08 13:19:54', 0, 269),
(864, 1211, '【活動提醒】您參與的球局「三缺一 急」將在 24 小時內開始！請準時抵達。', '2026-06-08 13:20:07', 1, 52),
(865, NULL, '【信譽扣分通知】您因為「未出現」被其他使用者檢舉，信譽分數已扣除 20 分。目前分數：50 分。', '2026-06-08 13:28:00', 0, 52),
(867, NULL, '【信譽警告】您的信譽分數已低於 60 分。系統已限制您發起（創建）新球局的功能，請遵守規範以恢復分數。', '2026-06-08 13:28:00', 0, 52),
(868, NULL, '【信譽扣分通知】您因為「未出現」被其他使用者檢舉，信譽分數已扣除 20 分。目前分數：30 分。', '2026-06-08 13:29:20', 0, 52),
(869, NULL, '【檢舉處理通知】您對「air3」的檢舉（原因：未出現）已成功提交，系統已自動對其扣除 20 分。', '2026-06-08 13:29:20', 0, 269),
(870, NULL, '【信譽警告】您的信譽分數已低於 60 分。系統已限制您發起（創建）新球局的功能，請遵守規範以恢復分數。', '2026-06-08 13:29:20', 0, 52),
(871, NULL, '【永久停權通知】您的信譽分數已低於或等於 40 分，帳號已被系統永久停權。', '2026-06-08 13:29:20', 0, 52),
(900, NULL, '【檢舉處理通知】您對「air-1」的檢舉（原因：未回報場地）已成功提交，系統已自動對其扣除 15 分。', '2026-06-08 14:00:17', 0, 269),
(901, 1211, '【活動開始】您參與的球局「三缺一 急」已經開始！祝您運動愉快。', '2026-06-08 14:11:20', 1, 50),
(902, 1211, '【活動開始】您參與的球局「三缺一 急」已經開始！祝您運動愉快。', '2026-06-08 14:11:20', 0, 52),
(904, 1211, '【活動開始】您參與的球局「三缺一 急」已經開始！祝您運動愉快。', '2026-06-08 14:11:20', 0, 269),
(906, 1273, '【場地狀態回報通知】您報名的球局「測試檢舉」場地狀態已更新！\n狀態：已佔到/已預約', '2026-06-08 14:20:54', 0, 269),
(909, 1273, '【活動提醒】您參與的球局「測試檢舉」將在 24 小時內開始！請準時抵達。', '2026-06-08 14:59:00', 0, 269),
(910, NULL, '【系統公告】請注意!!!\n沒事', '2026-06-08 15:17:56', 0, 1),
(911, NULL, '【系統公告】請注意!!!\n沒事', '2026-06-08 15:17:56', 0, 2),
(912, NULL, '【系統公告】請注意!!!\n沒事', '2026-06-08 15:17:56', 0, 3),
(913, NULL, '【系統公告】請注意!!!\n沒事', '2026-06-08 15:17:56', 0, 4),
(914, NULL, '【系統公告】請注意!!!\n沒事', '2026-06-08 15:17:56', 0, 5),
(919, NULL, '【系統公告】請注意!!!\n沒事', '2026-06-08 15:17:56', 0, 52),
(921, NULL, '【系統公告】請注意!!!\n沒事', '2026-06-08 15:17:56', 0, 66),
(923, NULL, '【系統公告】請注意!!!\n沒事', '2026-06-08 15:17:56', 0, 93),
(925, NULL, '【系統公告】請注意!!!\n沒事', '2026-06-08 15:17:56', 0, 95),
(926, NULL, '【系統公告】請注意!!!\n沒事', '2026-06-08 15:17:56', 0, 109),
(927, NULL, '【系統公告】請注意!!!\n沒事', '2026-06-08 15:17:56', 0, 110),
(928, NULL, '【系統公告】請注意!!!\n沒事', '2026-06-08 15:17:56', 0, 111),
(929, NULL, '【系統公告】請注意!!!\n沒事', '2026-06-08 15:17:56', 0, 148),
(930, NULL, '【系統公告】請注意!!!\n沒事', '2026-06-08 15:17:56', 0, 218),
(931, NULL, '【系統公告】請注意!!!\n沒事', '2026-06-08 15:17:56', 0, 264),
(932, NULL, '【系統公告】請注意!!!\n沒事', '2026-06-08 15:17:56', 0, 269),
(935, NULL, '【系統公告】太好啦\n嘻嘻', '2026-06-08 16:55:34', 0, 1),
(936, NULL, '【系統公告】太好啦\n嘻嘻', '2026-06-08 16:55:34', 0, 2),
(937, NULL, '【系統公告】太好啦\n嘻嘻', '2026-06-08 16:55:34', 0, 3),
(938, NULL, '【系統公告】太好啦\n嘻嘻', '2026-06-08 16:55:34', 0, 4),
(939, NULL, '【系統公告】太好啦\n嘻嘻', '2026-06-08 16:55:34', 0, 5),
(944, NULL, '【系統公告】太好啦\n嘻嘻', '2026-06-08 16:55:34', 0, 52),
(946, NULL, '【系統公告】太好啦\n嘻嘻', '2026-06-08 16:55:34', 0, 66),
(948, NULL, '【系統公告】太好啦\n嘻嘻', '2026-06-08 16:55:34', 0, 93),
(950, NULL, '【系統公告】太好啦\n嘻嘻', '2026-06-08 16:55:34', 0, 95),
(951, NULL, '【系統公告】太好啦\n嘻嘻', '2026-06-08 16:55:34', 0, 109),
(952, NULL, '【系統公告】太好啦\n嘻嘻', '2026-06-08 16:55:34', 0, 110),
(953, NULL, '【系統公告】太好啦\n嘻嘻', '2026-06-08 16:55:34', 0, 111),
(954, NULL, '【系統公告】太好啦\n嘻嘻', '2026-06-08 16:55:34', 0, 148),
(955, NULL, '【系統公告】太好啦\n嘻嘻', '2026-06-08 16:55:34', 0, 218),
(956, NULL, '【系統公告】太好啦\n嘻嘻', '2026-06-08 16:55:34', 0, 264),
(957, NULL, '【系統公告】太好啦\n嘻嘻', '2026-06-08 16:55:34', 0, 269),
(959, 1211, '【活動結束】您參與的球局「三缺一 急」已順利結束，球局已自動關閉。', '2026-06-08 17:10:03', 0, 50),
(960, 1211, '【活動結束】您參與的球局「三缺一 急」已順利結束，球局已自動關閉。', '2026-06-08 17:10:03', 0, 52),
(962, 1211, '【活動結束】您參與的球局「三缺一 急」已順利結束，球局已自動關閉。', '2026-06-08 17:10:03', 0, 269),
(1024, 1211, '【活動結束】您參與的球局「三缺一 急」已順利結束，球局已自動關閉。', '2026-06-08 19:31:52', 0, 52),
(1026, 1211, '【活動結束】您參與的球局「三缺一 急」已順利結束，球局已自動關閉。', '2026-06-08 19:31:52', 0, 269),
(1121, 1338, '【活動提醒】您參與的球局「測試自動化」將在 30 分鐘內開始！請做好準備。', '2026-06-08 20:04:43', 0, 53),
(1125, 1338, '【活動開始】您參與的球局「測試自動化」已經開始！祝您運動愉快。', '2026-06-08 20:06:00', 0, 53),
(1126, NULL, '【系統公告】【公告】太屌了我瘋掉：林明和你是救世主 (Ref: #20)', '2026-06-08 21:28:23', 0, 1),
(1127, NULL, '【系統公告】【公告】太屌了我瘋掉：林明和你是救世主 (Ref: #20)', '2026-06-08 21:28:23', 0, 2),
(1128, NULL, '【系統公告】【公告】太屌了我瘋掉：林明和你是救世主 (Ref: #20)', '2026-06-08 21:28:23', 0, 3),
(1129, NULL, '【系統公告】【公告】太屌了我瘋掉：林明和你是救世主 (Ref: #20)', '2026-06-08 21:28:23', 0, 4),
(1130, NULL, '【系統公告】【公告】太屌了我瘋掉：林明和你是救世主 (Ref: #20)', '2026-06-08 21:28:23', 0, 5),
(1135, NULL, '【系統公告】【公告】太屌了我瘋掉：林明和你是救世主 (Ref: #20)', '2026-06-08 21:28:23', 0, 52),
(1136, NULL, '【系統公告】【公告】太屌了我瘋掉：林明和你是救世主 (Ref: #20)', '2026-06-08 21:28:23', 0, 53),
(1137, NULL, '【系統公告】【公告】太屌了我瘋掉：林明和你是救世主 (Ref: #20)', '2026-06-08 21:28:23', 0, 66),
(1139, NULL, '【系統公告】【公告】太屌了我瘋掉：林明和你是救世主 (Ref: #20)', '2026-06-08 21:28:23', 0, 93),
(1141, NULL, '【系統公告】【公告】太屌了我瘋掉：林明和你是救世主 (Ref: #20)', '2026-06-08 21:28:23', 0, 95),
(1142, NULL, '【系統公告】【公告】太屌了我瘋掉：林明和你是救世主 (Ref: #20)', '2026-06-08 21:28:23', 0, 109),
(1143, NULL, '【系統公告】【公告】太屌了我瘋掉：林明和你是救世主 (Ref: #20)', '2026-06-08 21:28:23', 0, 110),
(1144, NULL, '【系統公告】【公告】太屌了我瘋掉：林明和你是救世主 (Ref: #20)', '2026-06-08 21:28:23', 0, 111),
(1145, NULL, '【系統公告】【公告】太屌了我瘋掉：林明和你是救世主 (Ref: #20)', '2026-06-08 21:28:23', 0, 148),
(1146, NULL, '【系統公告】【公告】太屌了我瘋掉：林明和你是救世主 (Ref: #20)', '2026-06-08 21:28:23', 0, 218),
(1147, NULL, '【系統公告】【公告】太屌了我瘋掉：林明和你是救世主 (Ref: #20)', '2026-06-08 21:28:23', 0, 264),
(1148, NULL, '【系統公告】【公告】太屌了我瘋掉：林明和你是救世主 (Ref: #20)', '2026-06-08 21:28:23', 0, 269),
(1149, NULL, '【系統公告】【公告】太屌了我瘋掉\n林明和你是救世主', '2026-06-08 21:28:23', 0, 1),
(1150, NULL, '【系統公告】【公告】太屌了我瘋掉\n林明和你是救世主', '2026-06-08 21:28:23', 0, 2),
(1151, NULL, '【系統公告】【公告】太屌了我瘋掉\n林明和你是救世主', '2026-06-08 21:28:23', 0, 3),
(1152, NULL, '【系統公告】【公告】太屌了我瘋掉\n林明和你是救世主', '2026-06-08 21:28:23', 0, 4),
(1153, NULL, '【系統公告】【公告】太屌了我瘋掉\n林明和你是救世主', '2026-06-08 21:28:23', 0, 5),
(1158, NULL, '【系統公告】【公告】太屌了我瘋掉\n林明和你是救世主', '2026-06-08 21:28:23', 0, 52),
(1159, NULL, '【系統公告】【公告】太屌了我瘋掉\n林明和你是救世主', '2026-06-08 21:28:23', 0, 53),
(1160, NULL, '【系統公告】【公告】太屌了我瘋掉\n林明和你是救世主', '2026-06-08 21:28:23', 0, 66),
(1162, NULL, '【系統公告】【公告】太屌了我瘋掉\n林明和你是救世主', '2026-06-08 21:28:23', 0, 93),
(1164, NULL, '【系統公告】【公告】太屌了我瘋掉\n林明和你是救世主', '2026-06-08 21:28:23', 0, 95),
(1165, NULL, '【系統公告】【公告】太屌了我瘋掉\n林明和你是救世主', '2026-06-08 21:28:23', 0, 109),
(1166, NULL, '【系統公告】【公告】太屌了我瘋掉\n林明和你是救世主', '2026-06-08 21:28:23', 0, 110),
(1167, NULL, '【系統公告】【公告】太屌了我瘋掉\n林明和你是救世主', '2026-06-08 21:28:23', 0, 111),
(1168, NULL, '【系統公告】【公告】太屌了我瘋掉\n林明和你是救世主', '2026-06-08 21:28:23', 0, 148),
(1169, NULL, '【系統公告】【公告】太屌了我瘋掉\n林明和你是救世主', '2026-06-08 21:28:23', 0, 218),
(1170, NULL, '【系統公告】【公告】太屌了我瘋掉\n林明和你是救世主', '2026-06-08 21:28:23', 0, 264),
(1171, NULL, '【系統公告】【公告】太屌了我瘋掉\n林明和你是救世主', '2026-06-08 21:28:23', 0, 269),
(1172, NULL, '【系統公告】【公告】67：神明保佑? (Ref: #21)', '2026-06-08 21:29:44', 0, 1),
(1173, NULL, '【系統公告】【公告】67：神明保佑? (Ref: #21)', '2026-06-08 21:29:44', 0, 2),
(1174, NULL, '【系統公告】【公告】67：神明保佑? (Ref: #21)', '2026-06-08 21:29:44', 0, 3),
(1175, NULL, '【系統公告】【公告】67：神明保佑? (Ref: #21)', '2026-06-08 21:29:44', 0, 4),
(1176, NULL, '【系統公告】【公告】67：神明保佑? (Ref: #21)', '2026-06-08 21:29:44', 0, 5),
(1181, NULL, '【系統公告】【公告】67：神明保佑? (Ref: #21)', '2026-06-08 21:29:44', 0, 52),
(1182, NULL, '【系統公告】【公告】67：神明保佑? (Ref: #21)', '2026-06-08 21:29:44', 0, 53),
(1183, NULL, '【系統公告】【公告】67：神明保佑? (Ref: #21)', '2026-06-08 21:29:44', 0, 66),
(1184, NULL, '【系統公告】【公告】67：神明保佑? (Ref: #21)', '2026-06-08 21:29:44', 1, 92),
(1185, NULL, '【系統公告】【公告】67：神明保佑? (Ref: #21)', '2026-06-08 21:29:44', 0, 93),
(1187, NULL, '【系統公告】【公告】67：神明保佑? (Ref: #21)', '2026-06-08 21:29:44', 0, 95),
(1188, NULL, '【系統公告】【公告】67：神明保佑? (Ref: #21)', '2026-06-08 21:29:44', 0, 109),
(1189, NULL, '【系統公告】【公告】67：神明保佑? (Ref: #21)', '2026-06-08 21:29:44', 0, 110),
(1190, NULL, '【系統公告】【公告】67：神明保佑? (Ref: #21)', '2026-06-08 21:29:44', 0, 111),
(1191, NULL, '【系統公告】【公告】67：神明保佑? (Ref: #21)', '2026-06-08 21:29:44', 0, 148),
(1192, NULL, '【系統公告】【公告】67：神明保佑? (Ref: #21)', '2026-06-08 21:29:44', 0, 218),
(1193, NULL, '【系統公告】【公告】67：神明保佑? (Ref: #21)', '2026-06-08 21:29:44', 0, 264),
(1194, NULL, '【系統公告】【公告】67：神明保佑? (Ref: #21)', '2026-06-08 21:29:44', 0, 269),
(1195, NULL, '【系統公告】【公告】67\n神明保佑?', '2026-06-08 21:29:44', 0, 1),
(1196, NULL, '【系統公告】【公告】67\n神明保佑?', '2026-06-08 21:29:44', 0, 2),
(1197, NULL, '【系統公告】【公告】67\n神明保佑?', '2026-06-08 21:29:44', 0, 3),
(1198, NULL, '【系統公告】【公告】67\n神明保佑?', '2026-06-08 21:29:44', 0, 4),
(1199, NULL, '【系統公告】【公告】67\n神明保佑?', '2026-06-08 21:29:44', 0, 5),
(1204, NULL, '【系統公告】【公告】67\n神明保佑?', '2026-06-08 21:29:44', 0, 52),
(1205, NULL, '【系統公告】【公告】67\n神明保佑?', '2026-06-08 21:29:44', 0, 53),
(1206, NULL, '【系統公告】【公告】67\n神明保佑?', '2026-06-08 21:29:44', 0, 66),
(1207, NULL, '【系統公告】【公告】67\n神明保佑?', '2026-06-08 21:29:44', 1, 92),
(1208, NULL, '【系統公告】【公告】67\n神明保佑?', '2026-06-08 21:29:44', 0, 93),
(1210, NULL, '【系統公告】【公告】67\n神明保佑?', '2026-06-08 21:29:44', 0, 95),
(1211, NULL, '【系統公告】【公告】67\n神明保佑?', '2026-06-08 21:29:44', 0, 109),
(1212, NULL, '【系統公告】【公告】67\n神明保佑?', '2026-06-08 21:29:44', 0, 110),
(1213, NULL, '【系統公告】【公告】67\n神明保佑?', '2026-06-08 21:29:44', 0, 111),
(1214, NULL, '【系統公告】【公告】67\n神明保佑?', '2026-06-08 21:29:44', 0, 148),
(1215, NULL, '【系統公告】【公告】67\n神明保佑?', '2026-06-08 21:29:44', 0, 218),
(1216, NULL, '【系統公告】【公告】67\n神明保佑?', '2026-06-08 21:29:44', 0, 264),
(1217, NULL, '【系統公告】【公告】67\n神明保佑?', '2026-06-08 21:29:44', 0, 269),
(1221, 1338, '【活動結束】您參與的球局「測試自動化」已順利結束，球局已自動關閉。', '2026-06-08 22:06:22', 0, 53),
(1222, NULL, '【回饋處理通知】您提交的回饋已處理。管理員回覆：hi', '2026-06-08 22:18:47', 1, 92),
(1223, NULL, '【活動取消】您參與的球局「麻醬麵」因人數未達下限（2人）已取消。', '2026-06-08 22:31:23', 1, 92),
(1225, NULL, '【活動取消】您報名的球局「麻醬麵」因【場地未借到】已取消。', '2026-06-08 22:51:12', 1, 92),
(1226, 1281, '【活動提醒】您參與的球局「test11111」將在 24 小時內開始！請準時抵達。', '2026-06-08 23:33:19', 0, 342),
(1227, NULL, '【活動取消】您參與的球局「英雄聯盟內戰-9」因人數未達下限（2人）已取消。', '2026-06-09 00:46:07', 0, 353),
(1228, NULL, '【活動取消】您參與的球局「憨仔都來」因人數未達下限（2人）已取消。', '2026-06-09 00:46:24', 1, 352),
(1229, NULL, '【活動取消】您參與的球局「憨仔都來」因人數未達下限（2人）已取消。', '2026-06-09 00:46:24', 1, 352),
(1232, NULL, '【活動取消】您參與的球局「憨仔都來」因人數未達下限（2人）已取消。', '2026-06-09 00:47:05', 1, 352),
(1233, NULL, '【活動取消】您參與的球局「憨仔都來」因人數未達下限（2人）已取消。', '2026-06-09 00:47:05', 1, 352),
(1235, NULL, '【活動取消】您參與的球局「我是傻逼」因人數未達下限（2人）已取消。', '2026-06-09 00:47:41', 1, 349),
(1237, NULL, '【活動取消】您參與的球局「今晚英雄聯盟內戰」因人數未達下限（2人）已取消。', '2026-06-09 00:48:08', 0, 353),
(1238, 1355, '【場地狀態回報通知】您報名的球局「憨仔都來」場地狀態已更新！\n狀態：已佔到/已預約', '2026-06-09 00:48:17', 1, 352),
(1239, 1357, '【活動提醒】您參與的球局「我是憨仔」將在 30 分鐘內開始！請做好準備。', '2026-06-09 00:48:42', 0, 349),
(1240, 1357, '【活動提醒】您參與的球局「我是憨仔」將在 30 分鐘內開始！請做好準備。', '2026-06-09 00:48:42', 0, 349),
(1241, 1357, '【活動提醒】您參與的球局「我是憨仔」將在 30 分鐘內開始！請做好準備。', '2026-06-09 00:48:57', 0, 360),
(1242, 1357, '【活動開始】您參與的球局「我是憨仔」已經開始！祝您運動愉快。', '2026-06-09 00:49:00', 1, 349),
(1243, 1357, '【活動開始】您參與的球局「我是憨仔」已經開始！祝您運動愉快。', '2026-06-09 00:49:00', 0, 360),
(1244, NULL, '【活動取消】您參與的球局「今晚英雄聯盟內戰」因人數未達下限（2人）已取消。', '2026-06-09 00:49:05', 0, 353),
(1245, NULL, '【活動取消】您參與的球局「英雄聯盟」已被主揪取消。', '2026-06-09 00:49:23', 0, 345),
(1246, NULL, '【活動取消】您參與的球局「英雄聯盟」已被主揪取消。', '2026-06-09 00:49:23', 0, 349),
(1248, NULL, '【活動取消】您參與的球局「英雄聯盟」已被主揪取消。', '2026-06-09 00:49:23', 1, 357),
(1250, 1361, '【活動提醒】您參與的球局「上資料庫上到九點」將在 24 小時內開始！請準時抵達。', '2026-06-09 00:49:46', 0, 343),
(1251, 1358, '【場地狀態回報通知】您報名的球局「一起起床」場地狀態已更新！\n狀態：已佔到/已預約', '2026-06-09 00:49:46', 0, 345),
(1252, NULL, '【活動取消】您報名的球局「今晚英雄聯盟內戰」因【場地未借到】已取消。', '2026-06-09 00:49:46', 0, 353),
(1254, NULL, '【活動取消】您參與的球局「楊鑫好帥」因人數未達下限（2人）已取消。', '2026-06-09 00:50:00', 1, 347),
(1255, 1361, '【活動提醒】您參與的球局「上資料庫上到九點」將在 24 小時內開始！請準時抵達。', '2026-06-09 00:50:01', 0, 353),
(1256, 1361, '【活動提醒】您參與的球局「上資料庫上到九點」將在 24 小時內開始！請準時抵達。', '2026-06-09 00:50:02', 1, 357),
(1257, 1361, '【活動提醒】您參與的球局「上資料庫上到九點」將在 24 小時內開始！請準時抵達。', '2026-06-09 00:50:04', 1, 356),
(1258, 1361, '【活動提醒】您參與的球局「上資料庫上到九點」將在 24 小時內開始！請準時抵達。', '2026-06-09 00:50:06', 0, 349),
(1259, 1363, '【活動提醒】您參與的球局「Letgo 資料庫」將在 24 小時內開始！請準時抵達。', '2026-06-09 00:50:10', 0, 346),
(1261, 1361, '【場地狀態回報通知】您報名的球局「上資料庫上到九點」場地狀態已更新！\n狀態：已佔到/已預約', '2026-06-09 00:50:14', 0, 343),
(1262, 1361, '【場地狀態回報通知】您報名的球局「上資料庫上到九點」場地狀態已更新！\n狀態：已佔到/已預約', '2026-06-09 00:50:14', 0, 349),
(1263, 1361, '【場地狀態回報通知】您報名的球局「上資料庫上到九點」場地狀態已更新！\n狀態：已佔到/已預約', '2026-06-09 00:50:14', 0, 353),
(1264, 1361, '【場地狀態回報通知】您報名的球局「上資料庫上到九點」場地狀態已更新！\n狀態：已佔到/已預約', '2026-06-09 00:50:14', 1, 356),
(1265, 1361, '【場地狀態回報通知】您報名的球局「上資料庫上到九點」場地狀態已更新！\n狀態：已佔到/已預約', '2026-06-09 00:50:14', 1, 357),
(1266, 1361, '【活動提醒】您參與的球局「上資料庫上到九點」將在 24 小時內開始！請準時抵達。', '2026-06-09 00:50:21', 0, 347),
(1267, 1361, '【活動提醒】您參與的球局「上資料庫上到九點」將在 24 小時內開始！請準時抵達。', '2026-06-09 00:50:31', 1, 345),
(1268, 1365, '【場地狀態回報通知】您報名的球局「今晚英雄聯盟」場地狀態已更新！\n狀態：已佔到/已預約', '2026-06-09 00:50:31', 0, 353),
(1269, 1365, '球局公告通知 ?：您參與的球局「籃球」有新公告：「真假啦 今晚內戰」', '2026-06-09 00:51:02', 1, 349),
(1270, 1365, '球局公告通知 ?：您參與的球局「籃球」有新公告：「真假啦 今晚內戰」', '2026-06-09 00:51:02', 1, 356),
(1271, 1365, '球局公告通知 ?：您參與的球局「籃球」有新公告：「真假啦 今晚內戰」', '2026-06-09 00:51:02', 0, 357),
(1275, 1363, '【場地狀態回報通知】您報名的球局「Letgo 資料庫」場地狀態已更新！\n狀態：已佔到/已預約', '2026-06-09 00:51:48', 0, 346),
(1276, 1368, '【場地狀態回報通知】您報名的球局「大概80」場地狀態已更新！\n狀態：已佔到/已預約', '2026-06-09 00:52:07', 0, 353),
(1277, 1367, '【場地狀態回報通知】您報名的球局「資料結構讚」場地狀態已更新！\n狀態：已佔到/已預約', '2026-06-09 00:52:28', 1, 358),
(1278, 1363, '【活動提醒】您參與的球局「Letgo 資料庫」將在 24 小時內開始！請準時抵達。', '2026-06-09 00:52:39', 1, 349),
(1279, 1363, '【活動提醒】您參與的球局「Letgo 資料庫」將在 24 小時內開始！請準時抵達。', '2026-06-09 00:52:43', 0, 347),
(1280, 1363, '【活動提醒】您參與的球局「Letgo 資料庫」將在 24 小時內開始！請準時抵達。', '2026-06-09 00:52:43', 0, 343),
(1281, 1363, '【活動提醒】您參與的球局「Letgo 資料庫」將在 24 小時內開始！請準時抵達。', '2026-06-09 00:52:44', 1, 353),
(1282, 1363, '【活動提醒】您參與的球局「Letgo 資料庫」將在 24 小時內開始！請準時抵達。', '2026-06-09 00:52:44', 0, 360),
(1283, 1363, '球局公告通知 ?：您參與的球局「籃球」有新公告：「今天可能不能打唷」', '2026-06-09 00:53:00', 0, 343),
(1284, 1363, '球局公告通知 ?：您參與的球局「籃球」有新公告：「今天可能不能打唷」', '2026-06-09 00:53:00', 0, 347),
(1285, 1363, '球局公告通知 ?：您參與的球局「籃球」有新公告：「今天可能不能打唷」', '2026-06-09 00:53:00', 0, 349),
(1286, 1363, '球局公告通知 ?：您參與的球局「籃球」有新公告：「今天可能不能打唷」', '2026-06-09 00:53:00', 0, 353),
(1287, 1363, '球局公告通知 ?：您參與的球局「籃球」有新公告：「今天可能不能打唷」', '2026-06-09 00:53:00', 0, 360),
(1288, 1363, '球局公告通知 ?：您參與的球局「籃球」有新公告：「好像可以用」', '2026-06-09 00:53:49', 0, 343),
(1289, 1363, '球局公告通知 ?：您參與的球局「籃球」有新公告：「好像可以用」', '2026-06-09 00:53:49', 1, 347),
(1290, 1363, '球局公告通知 ?：您參與的球局「籃球」有新公告：「好像可以用」', '2026-06-09 00:53:49', 1, 349),
(1291, 1363, '球局公告通知 ?：您參與的球局「籃球」有新公告：「好像可以用」', '2026-06-09 00:53:49', 0, 353),
(1292, 1363, '球局公告通知 ?：您參與的球局「籃球」有新公告：「好像可以用」', '2026-06-09 00:53:49', 0, 360),
(1293, NULL, '【信譽扣分通知】您因為「未出現」被其他使用者檢舉，信譽分數已扣除 30 分。目前分數：70 分。', '2026-06-09 00:54:28', 0, 346),
(1295, NULL, '【信譽扣分通知】您因為「言語攻擊」被其他使用者檢舉，信譽分數已扣除 10 分。目前分數：60 分。', '2026-06-09 00:54:32', 0, 346),
(1296, NULL, '【檢舉處理通知】您對「YP」的檢舉（原因：言語攻擊）已成功提交，系統已自動對其扣除 10 分。', '2026-06-09 00:54:32', 1, 349),
(1297, NULL, '【信譽扣分通知】您因為「沒交錢」被其他使用者檢舉，信譽分數已扣除 15 分。目前分數：85 分。', '2026-06-09 00:54:48', 1, 347),
(1298, NULL, '【檢舉處理通知】您對「兩打」的檢舉（原因：沒交錢）已成功提交，系統已自動對其扣除 15 分。', '2026-06-09 00:54:48', 0, 346),
(1299, 1369, '【活動提醒】您參與的球局「欸欸，明天要考資結啦」將在 24 小時內開始！請準時抵達。', '2026-06-09 00:55:04', 1, 356),
(1300, 1369, '【活動提醒】您參與的球局「欸欸，明天要考資結啦」將在 24 小時內開始！請準時抵達。', '2026-06-09 00:55:18', 0, 357),
(1301, 1369, '【場地狀態回報通知】您報名的球局「欸欸，明天要考資結啦」場地狀態已更新！\n狀態：已佔到/已預約', '2026-06-09 00:55:18', 1, 356),
(1302, 1369, '【場地狀態回報通知】您報名的球局「欸欸，明天要考資結啦」場地狀態已更新！\n狀態：已佔到/已預約', '2026-06-09 00:55:18', 0, 357),
(1303, 1369, '【活動提醒】您參與的球局「欸欸，明天要考資結啦」將在 24 小時內開始！請準時抵達。', '2026-06-09 00:55:26', 1, 353),
(1304, 1369, '【活動提醒】您參與的球局「欸欸，明天要考資結啦」將在 24 小時內開始！請準時抵達。', '2026-06-09 00:55:26', 0, 353),
(1305, 1369, '【活動提醒】您參與的球局「欸欸，明天要考資結啦」將在 24 小時內開始！請準時抵達。', '2026-06-09 00:55:31', 0, 358),
(1306, 1369, '【活動提醒】您參與的球局「欸欸，明天要考資結啦」將在 24 小時內開始！請準時抵達。', '2026-06-09 00:55:45', 0, 352),
(1307, NULL, '【信譽扣分通知】您因為「沒預約場地」被其他使用者檢舉，信譽分數已扣除 30 分。目前分數：40 分。', '2026-06-09 00:55:53', 0, 356),
(1308, NULL, '【檢舉處理通知】您對「黃禮志的狗」的檢舉（原因：沒預約場地）已成功提交，系統已自動對其扣除 30 分。', '2026-06-09 00:55:53', 1, 358),
(1309, NULL, '【信譽警告】您的信譽分數已低於 60 分。系統已限制您發起（創建）新球局的功能，請遵守規範以恢復分數。', '2026-06-09 00:55:53', 0, 356),
(1310, NULL, '【永久停權通知】您的信譽分數已低於或等於 40 分，帳號已被系統永久停權。', '2026-06-09 00:55:53', 0, 356),
(1311, NULL, '【信譽扣分通知】您因為「未出現」被其他使用者檢舉，信譽分數已扣除 30 分。目前分數：10 分。', '2026-06-09 00:56:08', 0, 356),
(1312, NULL, '【檢舉處理通知】您對「黃禮志的狗」的檢舉（原因：未出現）已成功提交，系統已自動對其扣除 30 分。', '2026-06-09 00:56:08', 0, 352),
(1313, NULL, '【信譽警告】您的信譽分數已低於 60 分。系統已限制您發起（創建）新球局的功能，請遵守規範以恢復分數。', '2026-06-09 00:56:08', 0, 356),
(1314, NULL, '【永久停權通知】您的信譽分數已低於或等於 40 分，帳號已被系統永久停權。', '2026-06-09 00:56:08', 0, 356),
(1315, NULL, '【信譽扣分通知】您因為「未出現」被其他使用者檢舉，信譽分數已扣除 20 分。目前分數：70 分。', '2026-06-09 00:56:23', 0, 357),
(1316, NULL, '【檢舉處理通知】您對「嘻嘻」的檢舉（原因：未出現）已成功提交，系統已自動對其扣除 20 分。', '2026-06-09 00:56:23', 0, 352),
(1317, NULL, '【信譽扣分通知】您因為「等級不符」被其他使用者檢舉，信譽分數已扣除 10 分。目前分數：90 分。', '2026-06-09 00:56:28', 0, 360),
(1318, NULL, '【檢舉處理通知】您對「蔡翔宇」的檢舉（原因：等級不符）已成功提交，系統已自動對其扣除 10 分。', '2026-06-09 00:56:28', 1, 349),
(1319, 1369, '【活動提醒】您參與的球局「欸欸，明天要考資結啦」將在 24 小時內開始！請準時抵達。', '2026-06-09 00:56:42', 0, 350),
(1320, NULL, '【信譽扣分通知】您因為「未出現」被其他使用者檢舉，信譽分數已扣除 20 分。目前分數：0 分。', '2026-06-09 00:56:53', 0, 356),
(1321, NULL, '【檢舉處理通知】您對「黃禮志的狗」的檢舉（原因：未出現）已成功提交，系統已自動對其扣除 20 分。', '2026-06-09 00:56:53', 0, 353),
(1322, NULL, '【信譽警告】您的信譽分數已低於 60 分。系統已限制您發起（創建）新球局的功能，請遵守規範以恢復分數。', '2026-06-09 00:56:53', 0, 356),
(1323, NULL, '【永久停權通知】您的信譽分數已低於或等於 40 分，帳號已被系統永久停權。', '2026-06-09 00:56:53', 0, 356),
(1324, NULL, '【信譽扣分通知】您因為「未出現」被其他使用者檢舉，信譽分數已扣除 20 分。目前分數：80 分。', '2026-06-09 00:57:32', 0, 358),
(1325, NULL, '【檢舉處理通知】您對「吳老師」的檢舉（原因：未出現）已成功提交，系統已自動對其扣除 20 分。', '2026-06-09 00:57:32', 0, 353),
(1326, NULL, '【信譽扣分通知】您因為「沒交錢」被其他使用者檢舉，信譽分數已扣除 15 分。目前分數：65 分。', '2026-06-09 00:59:21', 1, 358),
(1327, NULL, '【檢舉處理通知】您對「吳老師」的檢舉（原因：沒交錢）已成功提交，系統已自動對其扣除 15 分。', '2026-06-09 00:59:21', 0, 357),
(1328, 1370, '【場地狀態回報通知】您報名的球局「你媽」場地狀態已更新！\n狀態：已佔到/已預約', '2026-06-09 01:00:57', 0, 362),
(1335, NULL, '【活動取消】您參與的球局「YP太帥了三缺一」已被主揪取消。', '2026-06-09 01:01:28', 1, 92),
(1336, NULL, '【活動取消】您參與的球局「YP太帥了三缺一」已被主揪取消。', '2026-06-09 01:01:28', 0, 344),
(1337, NULL, '【活動取消】您參與的球局「YP太帥了三缺一」已被主揪取消。', '2026-06-09 01:01:28', 0, 347),
(1338, NULL, '【活動取消】您參與的球局「YP太帥了三缺一」已被主揪取消。', '2026-06-09 01:01:28', 0, 349),
(1339, NULL, '【活動取消】您參與的球局「YP太帥了三缺一」已被主揪取消。', '2026-06-09 01:01:28', 0, 360),
(1340, 1357, '【活動結束】您參與的球局「我是憨仔」已順利結束，球局已自動關閉。', '2026-06-09 02:49:10', 0, 349),
(1341, 1357, '【活動結束】您參與的球局「我是憨仔」已順利結束，球局已自動關閉。', '2026-06-09 02:49:10', 0, 360),
(1342, 1361, '【活動提醒】您參與的球局「上資料庫上到九點」將在 30 分鐘內開始！請做好準備。', '2026-06-09 04:18:19', 0, 343),
(1343, 1361, '【活動提醒】您參與的球局「上資料庫上到九點」將在 30 分鐘內開始！請做好準備。', '2026-06-09 04:18:19', 0, 345),
(1344, 1361, '【活動提醒】您參與的球局「上資料庫上到九點」將在 30 分鐘內開始！請做好準備。', '2026-06-09 04:18:19', 0, 347),
(1345, 1361, '【活動提醒】您參與的球局「上資料庫上到九點」將在 30 分鐘內開始！請做好準備。', '2026-06-09 04:18:19', 0, 349),
(1346, 1361, '【活動提醒】您參與的球局「上資料庫上到九點」將在 30 分鐘內開始！請做好準備。', '2026-06-09 04:18:19', 0, 353),
(1347, 1361, '【活動提醒】您參與的球局「上資料庫上到九點」將在 30 分鐘內開始！請做好準備。', '2026-06-09 04:18:19', 0, 356),
(1348, 1361, '【活動提醒】您參與的球局「上資料庫上到九點」將在 30 分鐘內開始！請做好準備。', '2026-06-09 04:18:19', 0, 357),
(1349, 1361, '【活動提醒】您參與的球局「上資料庫上到九點」將在 30 分鐘內開始！請做好準備。', '2026-06-09 04:29:28', 0, 92),
(1350, 1361, '【活動開始】您參與的球局「上資料庫上到九點」已經開始！祝您運動愉快。', '2026-06-09 04:48:16', 0, 343),
(1351, 1361, '【活動開始】您參與的球局「上資料庫上到九點」已經開始！祝您運動愉快。', '2026-06-09 04:48:16', 0, 345),
(1352, 1361, '【活動開始】您參與的球局「上資料庫上到九點」已經開始！祝您運動愉快。', '2026-06-09 04:48:16', 0, 347),
(1353, 1361, '【活動開始】您參與的球局「上資料庫上到九點」已經開始！祝您運動愉快。', '2026-06-09 04:48:16', 0, 349),
(1354, 1361, '【活動開始】您參與的球局「上資料庫上到九點」已經開始！祝您運動愉快。', '2026-06-09 04:48:16', 0, 353),
(1355, 1361, '【活動開始】您參與的球局「上資料庫上到九點」已經開始！祝您運動愉快。', '2026-06-09 04:48:16', 0, 356),
(1356, 1361, '【活動開始】您參與的球局「上資料庫上到九點」已經開始！祝您運動愉快。', '2026-06-09 04:48:16', 0, 357),
(1357, 1370, '報名通知：admin 加入了您的球局「你媽」！目前參加人數：3/4。', '2026-06-09 04:57:57', 0, 362),
(1358, 1370, '報名通知：admin 加入了您的球局「你媽」！目前參加人數：3/4。', '2026-06-09 04:59:22', 0, 362),
(1359, 1368, '報名通知：admin 加入了您的球局「大概80」！目前參加人數：3/4。', '2026-06-09 05:03:16', 0, 353),
(1360, 1358, '報名通知：admin 加入了您的球局「一起起床」！目前參加人數：3/4。', '2026-06-09 05:05:59', 0, 345),
(1361, 1369, '報名通知：admin 加入了您的球局「欸欸，明天要考資結啦」！目前參加人數：7/100。', '2026-06-09 05:07:41', 0, 356),
(1362, 1369, '【活動提醒】您參與的球局「欸欸，明天要考資結啦」將在 24 小時內開始！請準時抵達。', '2026-06-09 05:07:41', 1, 92),
(1363, 1361, '【活動結束】您參與的球局「上資料庫上到九點」已順利結束，球局已自動關閉。', '2026-06-09 06:48:29', 0, 343),
(1364, 1361, '【活動結束】您參與的球局「上資料庫上到九點」已順利結束，球局已自動關閉。', '2026-06-09 06:48:29', 0, 345),
(1365, 1361, '【活動結束】您參與的球局「上資料庫上到九點」已順利結束，球局已自動關閉。', '2026-06-09 06:48:29', 0, 347),
(1366, 1361, '【活動結束】您參與的球局「上資料庫上到九點」已順利結束，球局已自動關閉。', '2026-06-09 06:48:29', 0, 349),
(1367, 1361, '【活動結束】您參與的球局「上資料庫上到九點」已順利結束，球局已自動關閉。', '2026-06-09 06:48:29', 0, 353),
(1368, 1361, '【活動結束】您參與的球局「上資料庫上到九點」已順利結束，球局已自動關閉。', '2026-06-09 06:48:29', 0, 356),
(1369, 1361, '【活動結束】您參與的球局「上資料庫上到九點」已順利結束，球局已自動關閉。', '2026-06-09 06:48:29', 0, 357),
(1371, NULL, '【活動取消】您參與的球局「大家一起跳一跳 昨天根本沒睡覺」因人數未達下限（10人）已取消。', '2026-06-09 07:50:02', 0, 360),
(1373, 1213, '【活動提醒】您參與的球局「來都來」將在 30 分鐘內開始！請做好準備。', '2026-06-09 10:50:11', 0, 264),
(1374, 1213, '【活動提醒】您參與的球局「來都來」將在 30 分鐘內開始！請做好準備。', '2026-06-09 10:50:11', 0, 269),
(1376, 1213, '【活動開始】您參與的球局「來都來」已經開始！祝您運動愉快。', '2026-06-09 11:20:13', 0, 264),
(1377, 1213, '【活動開始】您參與的球局「來都來」已經開始！祝您運動愉快。', '2026-06-09 11:20:13', 0, 269),
(1378, 1213, '【活動結束】您參與的球局「來都來」已順利結束，球局已自動關閉。', '2026-06-09 12:20:16', 0, 49),
(1379, 1213, '【活動結束】您參與的球局「來都來」已順利結束，球局已自動關閉。', '2026-06-09 12:20:16', 0, 264),
(1380, 1213, '【活動結束】您參與的球局「來都來」已順利結束，球局已自動關閉。', '2026-06-09 12:20:16', 0, 269),
(1382, NULL, '【活動取消】您參與的球局「馬降」因人數未達下限（4人）已取消。', '2026-06-09 15:49:24', 0, 269),
(1385, 1273, '【活動開始】您參與的球局「測試檢舉」已經開始！祝您運動愉快。', '2026-06-09 22:03:51', 0, 92),
(1386, 1273, '【活動結束】您參與的球局「測試檢舉」已順利結束，球局已自動關閉。', '2026-06-09 22:03:51', 0, 92),
(1387, NULL, '【活動取消】您參與的球局「測試麻將」因人數未達下限已取消。', '2026-06-09 22:03:51', 0, 49),
(1388, NULL, '【活動取消】您參與的球局「測試麻將」因人數未達下限已取消。', '2026-06-09 22:03:51', 0, 49),
(1391, 1281, '【活動開始】您參與的球局「test11111」已經開始！祝您運動愉快。', '2026-06-09 22:03:52', 0, 49),
(1392, 1281, '【活動開始】您參與的球局「test11111」已經開始！祝您運動愉快。', '2026-06-09 22:03:52', 0, 49),
(1393, 1281, '【活動結束】您參與的球局「test11111」已順利結束，球局已自動關閉。', '2026-06-09 22:03:52', 0, 49),
(1394, 1281, '【活動結束】您參與的球局「test11111」已順利結束，球局已自動關閉。', '2026-06-09 22:03:52', 0, 49),
(1395, 1281, '【活動開始】您參與的球局「test11111」已經開始！祝您運動愉快。', '2026-06-09 22:03:52', 0, 342),
(1396, 1281, '【活動結束】您參與的球局「test11111」已順利結束，球局已自動關閉。', '2026-06-09 22:03:52', 0, 342),
(1397, 1281, '【活動結束】您參與的球局「test11111」已順利結束，球局已自動關閉。', '2026-06-09 22:03:52', 0, 342),
(1398, NULL, '【活動取消】您參與的球局「敢不敢跟我擊劍」因人數未達下限（2人）已取消。', '2026-06-09 22:13:50', 0, 364),
(1400, 1355, '報名通知：admin 加入了您的球局「憨仔都來」！目前參加人數：2/4。', '2026-06-09 23:55:46', 0, 352),
(1401, 1367, '報名通知：air 加入了您的球局「資料結構讚」！目前參加人數：8/100。', '2026-06-10 01:26:20', 0, 358),
(1402, 1367, '報名通知：air 加入了您的球局「資料結構讚」！目前參加人數：8/100。', '2026-06-10 01:55:42', 0, 358),
(1403, 1367, '報名通知：air 加入了您的球局「資料結構讚」！目前參加人數：8/100。', '2026-06-10 01:56:35', 0, 358),
(1404, 1367, '報名通知：air-1 加入了您的球局「資料結構讚」！目前參加人數：7/100。', '2026-06-10 01:56:58', 0, 358),
(1405, 1367, '報名通知：air-1 加入了您的球局「資料結構讚」！目前參加人數：7/100。', '2026-06-10 01:57:03', 0, 358),
(1406, 1367, '報名通知：air 加入了您的球局「資料結構讚」！目前參加人數：7/100。', '2026-06-10 01:57:44', 0, 358),
(1407, 1367, '報名通知：air-1 加入了您的球局「資料結構讚」！目前參加人數：7/100。', '2026-06-10 01:57:46', 0, 358),
(1408, 1367, '報名通知：air 加入了您的球局「資料結構讚」！目前參加人數：7/100。', '2026-06-10 01:58:52', 0, 358),
(1409, 1365, '報名通知：air 加入了您的球局「今晚英雄聯盟」！目前參加人數：7/100。', '2026-06-10 02:00:14', 0, 353),
(1410, 1210, '候補成功轉正通知 ?：恭喜！air4 候補的「籃球」已成功轉為正式隊員，請準時出席！', '2026-06-10 06:34:00', 0, 53),
(1424, 1372, '【場地確認通知】主揪已確認「測試回報場地」現場有場地可使用，大家可以出發囉！', '2026-06-10 07:30:23', 0, 34),
(1426, 1372, '【場地取消確認】主揪已取消「測試回報場地」場地可使用的確認，目前場地狀態已變更為「未確認」。', '2026-06-10 07:31:04', 0, 34),
(1429, 1372, '【場地確認通知】主揪已確認「測試回報場地」現場有場地可使用，大家可以出發囉！', '2026-06-10 07:31:42', 0, 34),
(1431, 1372, '【活動提醒】您參與的球局「測試回報場地」將在 30 分鐘內開始！請做好準備。', '2026-06-10 07:32:07', 1, 51),
(1432, 1372, '【活動提醒】您參與的球局「測試回報場地」將在 30 分鐘內開始！請做好準備。', '2026-06-10 07:34:56', 1, 50),
(1433, 1372, '【活動提醒】您參與的球局「測試回報場地」將在 30 分鐘內開始！請做好準備。', '2026-06-10 07:35:16', 0, 53),
(1434, 1372, '【活動提醒】您參與的球局「測試回報場地」將在 30 分鐘內開始！請做好準備。', '2026-06-10 07:35:16', 0, 53),
(1435, 1210, '給【快打旋風】房間所有人\n球局資訊：\n- 時間：2026-06-25 17:16-19:16\n- 地點：幸福國中籃球場\n\n\nhihi：ddd (Ref: #22)', '2026-06-10 08:00:57', 0, 34),
(1436, 1210, '給【快打旋風】房間所有人\n球局資訊：\n- 時間：2026-06-25 17:16-19:16\n- 地點：幸福國中籃球場\n\n\nhihi：ddd (Ref: #22)', '2026-06-10 08:00:57', 0, 50),
(1437, 1210, '給【快打旋風】房間所有人\n球局資訊：\n- 時間：2026-06-25 17:16-19:16\n- 地點：幸福國中籃球場\n\n\nhihi：ddd (Ref: #22)', '2026-06-10 08:00:57', 1, 51),
(1438, 1210, '給【快打旋風】房間所有人\n球局資訊：\n- 時間：2026-06-25 17:16-19:16\n- 地點：幸福國中籃球場\n\n\nhihi：ddd (Ref: #22)', '2026-06-10 08:00:57', 0, 53),
(1440, NULL, '【系統公告】【公告】Hello：Test (Ref: #23)', '2026-06-10 08:19:20', 0, 1),
(1441, NULL, '【系統公告】【公告】Hello：Test (Ref: #23)', '2026-06-10 08:19:20', 0, 2),
(1442, NULL, '【系統公告】【公告】Hello：Test (Ref: #23)', '2026-06-10 08:19:20', 0, 3),
(1443, NULL, '【系統公告】【公告】Hello：Test (Ref: #23)', '2026-06-10 08:19:20', 0, 4),
(1444, NULL, '【系統公告】【公告】Hello：Test (Ref: #23)', '2026-06-10 08:19:20', 0, 5),
(1445, NULL, '【系統公告】【公告】Hello：Test (Ref: #23)', '2026-06-10 08:19:20', 1, 34),
(1446, NULL, '【系統公告】【公告】Hello：Test (Ref: #23)', '2026-06-10 08:19:20', 0, 49),
(1447, NULL, '【系統公告】【公告】Hello：Test (Ref: #23)', '2026-06-10 08:19:20', 0, 50),
(1448, NULL, '【系統公告】【公告】Hello：Test (Ref: #23)', '2026-06-10 08:19:20', 0, 51),
(1449, NULL, '【系統公告】【公告】Hello：Test (Ref: #23)', '2026-06-10 08:19:20', 0, 52),
(1450, NULL, '【系統公告】【公告】Hello：Test (Ref: #23)', '2026-06-10 08:19:20', 0, 53),
(1451, NULL, '【系統公告】【公告】Hello：Test (Ref: #23)', '2026-06-10 08:19:20', 0, 66),
(1452, NULL, '【系統公告】【公告】Hello：Test (Ref: #23)', '2026-06-10 08:19:20', 1, 92),
(1453, NULL, '【系統公告】【公告】Hello：Test (Ref: #23)', '2026-06-10 08:19:20', 0, 93),
(1455, NULL, '【系統公告】【公告】Hello：Test (Ref: #23)', '2026-06-10 08:19:20', 0, 95),
(1456, NULL, '【系統公告】【公告】Hello：Test (Ref: #23)', '2026-06-10 08:19:20', 0, 109),
(1457, NULL, '【系統公告】【公告】Hello：Test (Ref: #23)', '2026-06-10 08:19:20', 0, 110),
(1458, NULL, '【系統公告】【公告】Hello：Test (Ref: #23)', '2026-06-10 08:19:20', 0, 111),
(1459, NULL, '【系統公告】【公告】Hello：Test (Ref: #23)', '2026-06-10 08:19:20', 0, 148),
(1460, NULL, '【系統公告】【公告】Hello：Test (Ref: #23)', '2026-06-10 08:19:20', 0, 218),
(1461, NULL, '【系統公告】【公告】Hello：Test (Ref: #23)', '2026-06-10 08:19:20', 0, 264),
(1462, NULL, '【系統公告】【公告】Hello：Test (Ref: #23)', '2026-06-10 08:19:20', 0, 269),
(1463, NULL, '【系統公告】【公告】Hello：Test (Ref: #23)', '2026-06-10 08:19:20', 0, 342),
(1464, NULL, '【系統公告】【公告】Hello：Test (Ref: #23)', '2026-06-10 08:19:20', 0, 343),
(1465, NULL, '【系統公告】【公告】Hello：Test (Ref: #23)', '2026-06-10 08:19:20', 0, 344),
(1466, NULL, '【系統公告】【公告】Hello：Test (Ref: #23)', '2026-06-10 08:19:20', 0, 345),
(1467, NULL, '【系統公告】【公告】Hello：Test (Ref: #23)', '2026-06-10 08:19:20', 0, 346),
(1468, NULL, '【系統公告】【公告】Hello：Test (Ref: #23)', '2026-06-10 08:19:20', 0, 347),
(1469, NULL, '【系統公告】【公告】Hello：Test (Ref: #23)', '2026-06-10 08:19:20', 0, 348),
(1470, NULL, '【系統公告】【公告】Hello：Test (Ref: #23)', '2026-06-10 08:19:20', 0, 349),
(1471, NULL, '【系統公告】【公告】Hello：Test (Ref: #23)', '2026-06-10 08:19:20', 0, 350),
(1472, NULL, '【系統公告】【公告】Hello：Test (Ref: #23)', '2026-06-10 08:19:20', 0, 351),
(1473, NULL, '【系統公告】【公告】Hello：Test (Ref: #23)', '2026-06-10 08:19:20', 0, 352),
(1474, NULL, '【系統公告】【公告】Hello：Test (Ref: #23)', '2026-06-10 08:19:20', 0, 353),
(1475, NULL, '【系統公告】【公告】Hello：Test (Ref: #23)', '2026-06-10 08:19:20', 0, 354),
(1476, NULL, '【系統公告】【公告】Hello：Test (Ref: #23)', '2026-06-10 08:19:20', 0, 355),
(1477, NULL, '【系統公告】【公告】Hello：Test (Ref: #23)', '2026-06-10 08:19:20', 0, 356),
(1478, NULL, '【系統公告】【公告】Hello：Test (Ref: #23)', '2026-06-10 08:19:20', 0, 357),
(1479, NULL, '【系統公告】【公告】Hello：Test (Ref: #23)', '2026-06-10 08:19:20', 0, 358),
(1480, NULL, '【系統公告】【公告】Hello：Test (Ref: #23)', '2026-06-10 08:19:20', 0, 359),
(1481, NULL, '【系統公告】【公告】Hello：Test (Ref: #23)', '2026-06-10 08:19:20', 0, 360),
(1482, NULL, '【系統公告】【公告】Hello：Test (Ref: #23)', '2026-06-10 08:19:20', 0, 361),
(1483, NULL, '【系統公告】【公告】Hello：Test (Ref: #23)', '2026-06-10 08:19:20', 0, 362),
(1484, NULL, '【系統公告】【公告】Hello：Test (Ref: #23)', '2026-06-10 08:19:20', 0, 363),
(1485, NULL, '【系統公告】【公告】Hello：Test (Ref: #23)', '2026-06-10 08:19:20', 0, 364),
(1486, NULL, '【系統公告】【公告】Helloooooooo：6767 (Ref: #24)', '2026-06-10 20:18:16', 0, 1),
(1487, NULL, '【系統公告】【公告】Helloooooooo：6767 (Ref: #24)', '2026-06-10 20:18:16', 0, 2),
(1488, NULL, '【系統公告】【公告】Helloooooooo：6767 (Ref: #24)', '2026-06-10 20:18:16', 0, 3),
(1489, NULL, '【系統公告】【公告】Helloooooooo：6767 (Ref: #24)', '2026-06-10 20:18:16', 0, 4),
(1490, NULL, '【系統公告】【公告】Helloooooooo：6767 (Ref: #24)', '2026-06-10 20:18:16', 0, 5),
(1491, NULL, '【系統公告】【公告】Helloooooooo：6767 (Ref: #24)', '2026-06-10 20:18:16', 0, 34),
(1492, NULL, '【系統公告】【公告】Helloooooooo：6767 (Ref: #24)', '2026-06-10 20:18:16', 0, 49),
(1493, NULL, '【系統公告】【公告】Helloooooooo：6767 (Ref: #24)', '2026-06-10 20:18:16', 0, 50),
(1494, NULL, '【系統公告】【公告】Helloooooooo：6767 (Ref: #24)', '2026-06-10 20:18:16', 0, 51),
(1495, NULL, '【系統公告】【公告】Helloooooooo：6767 (Ref: #24)', '2026-06-10 20:18:16', 0, 52),
(1496, NULL, '【系統公告】【公告】Helloooooooo：6767 (Ref: #24)', '2026-06-10 20:18:16', 0, 53),
(1497, NULL, '【系統公告】【公告】Helloooooooo：6767 (Ref: #24)', '2026-06-10 20:18:16', 0, 66),
(1498, NULL, '【系統公告】【公告】Helloooooooo：6767 (Ref: #24)', '2026-06-10 20:18:16', 1, 92),
(1499, NULL, '【系統公告】【公告】Helloooooooo：6767 (Ref: #24)', '2026-06-10 20:18:16', 0, 93),
(1501, NULL, '【系統公告】【公告】Helloooooooo：6767 (Ref: #24)', '2026-06-10 20:18:16', 0, 95),
(1502, NULL, '【系統公告】【公告】Helloooooooo：6767 (Ref: #24)', '2026-06-10 20:18:16', 0, 109),
(1503, NULL, '【系統公告】【公告】Helloooooooo：6767 (Ref: #24)', '2026-06-10 20:18:16', 0, 110),
(1504, NULL, '【系統公告】【公告】Helloooooooo：6767 (Ref: #24)', '2026-06-10 20:18:16', 0, 111),
(1505, NULL, '【系統公告】【公告】Helloooooooo：6767 (Ref: #24)', '2026-06-10 20:18:16', 0, 148),
(1506, NULL, '【系統公告】【公告】Helloooooooo：6767 (Ref: #24)', '2026-06-10 20:18:16', 0, 218),
(1507, NULL, '【系統公告】【公告】Helloooooooo：6767 (Ref: #24)', '2026-06-10 20:18:16', 0, 264),
(1508, NULL, '【系統公告】【公告】Helloooooooo：6767 (Ref: #24)', '2026-06-10 20:18:16', 0, 269),
(1509, NULL, '【系統公告】【公告】Helloooooooo：6767 (Ref: #24)', '2026-06-10 20:18:16', 0, 342),
(1510, NULL, '【系統公告】【公告】Helloooooooo：6767 (Ref: #24)', '2026-06-10 20:18:16', 0, 343),
(1511, NULL, '【系統公告】【公告】Helloooooooo：6767 (Ref: #24)', '2026-06-10 20:18:16', 0, 344),
(1512, NULL, '【系統公告】【公告】Helloooooooo：6767 (Ref: #24)', '2026-06-10 20:18:16', 0, 345),
(1513, NULL, '【系統公告】【公告】Helloooooooo：6767 (Ref: #24)', '2026-06-10 20:18:16', 0, 346),
(1514, NULL, '【系統公告】【公告】Helloooooooo：6767 (Ref: #24)', '2026-06-10 20:18:16', 0, 347),
(1515, NULL, '【系統公告】【公告】Helloooooooo：6767 (Ref: #24)', '2026-06-10 20:18:16', 0, 348),
(1516, NULL, '【系統公告】【公告】Helloooooooo：6767 (Ref: #24)', '2026-06-10 20:18:16', 0, 349),
(1517, NULL, '【系統公告】【公告】Helloooooooo：6767 (Ref: #24)', '2026-06-10 20:18:16', 0, 350),
(1518, NULL, '【系統公告】【公告】Helloooooooo：6767 (Ref: #24)', '2026-06-10 20:18:16', 0, 351),
(1519, NULL, '【系統公告】【公告】Helloooooooo：6767 (Ref: #24)', '2026-06-10 20:18:16', 0, 352),
(1520, NULL, '【系統公告】【公告】Helloooooooo：6767 (Ref: #24)', '2026-06-10 20:18:16', 0, 353),
(1521, NULL, '【系統公告】【公告】Helloooooooo：6767 (Ref: #24)', '2026-06-10 20:18:16', 0, 354),
(1522, NULL, '【系統公告】【公告】Helloooooooo：6767 (Ref: #24)', '2026-06-10 20:18:16', 0, 355),
(1523, NULL, '【系統公告】【公告】Helloooooooo：6767 (Ref: #24)', '2026-06-10 20:18:16', 0, 356),
(1524, NULL, '【系統公告】【公告】Helloooooooo：6767 (Ref: #24)', '2026-06-10 20:18:16', 0, 357),
(1525, NULL, '【系統公告】【公告】Helloooooooo：6767 (Ref: #24)', '2026-06-10 20:18:16', 0, 358),
(1526, NULL, '【系統公告】【公告】Helloooooooo：6767 (Ref: #24)', '2026-06-10 20:18:16', 0, 359),
(1527, NULL, '【系統公告】【公告】Helloooooooo：6767 (Ref: #24)', '2026-06-10 20:18:16', 0, 360),
(1528, NULL, '【系統公告】【公告】Helloooooooo：6767 (Ref: #24)', '2026-06-10 20:18:16', 0, 361),
(1529, NULL, '【系統公告】【公告】Helloooooooo：6767 (Ref: #24)', '2026-06-10 20:18:16', 0, 362),
(1530, NULL, '【系統公告】【公告】Helloooooooo：6767 (Ref: #24)', '2026-06-10 20:18:16', 0, 363),
(1531, NULL, '【系統公告】【公告】Helloooooooo：6767 (Ref: #24)', '2026-06-10 20:18:16', 0, 364),
(1532, 1375, '球局公告通知 ?：您參與的球局「排球」有新公告：「我是簡綠簡綠是我」', '2026-06-10 20:47:15', 0, 49),
(1533, 1210, '球局公告通知 ?：您參與的球局「籃球」有新公告：「讚讚」', '2026-06-10 20:48:17', 0, 34),
(1534, 1210, '球局公告通知 ?：您參與的球局「籃球」有新公告：「讚讚」', '2026-06-10 20:48:17', 0, 50),
(1535, 1210, '球局公告通知 ?：您參與的球局「籃球」有新公告：「讚讚」', '2026-06-10 20:48:17', 0, 51),
(1536, 1210, '球局公告通知 ?：您參與的球局「籃球」有新公告：「讚讚」', '2026-06-10 20:48:17', 0, 53),
(1537, NULL, '【系統公告】【公告】胡凱兒出來：我們找你 (Ref: #25)', '2026-06-10 20:51:51', 0, 1),
(1538, NULL, '【系統公告】【公告】胡凱兒出來：我們找你 (Ref: #25)', '2026-06-10 20:51:51', 0, 2),
(1539, NULL, '【系統公告】【公告】胡凱兒出來：我們找你 (Ref: #25)', '2026-06-10 20:51:51', 0, 3),
(1540, NULL, '【系統公告】【公告】胡凱兒出來：我們找你 (Ref: #25)', '2026-06-10 20:51:51', 0, 4),
(1541, NULL, '【系統公告】【公告】胡凱兒出來：我們找你 (Ref: #25)', '2026-06-10 20:51:51', 0, 5),
(1542, NULL, '【系統公告】【公告】胡凱兒出來：我們找你 (Ref: #25)', '2026-06-10 20:51:51', 0, 34),
(1543, NULL, '【系統公告】【公告】胡凱兒出來：我們找你 (Ref: #25)', '2026-06-10 20:51:51', 1, 49),
(1544, NULL, '【系統公告】【公告】胡凱兒出來：我們找你 (Ref: #25)', '2026-06-10 20:51:51', 0, 50),
(1545, NULL, '【系統公告】【公告】胡凱兒出來：我們找你 (Ref: #25)', '2026-06-10 20:51:51', 0, 51),
(1546, NULL, '【系統公告】【公告】胡凱兒出來：我們找你 (Ref: #25)', '2026-06-10 20:51:51', 0, 52),
(1547, NULL, '【系統公告】【公告】胡凱兒出來：我們找你 (Ref: #25)', '2026-06-10 20:51:51', 0, 53),
(1548, NULL, '【系統公告】【公告】胡凱兒出來：我們找你 (Ref: #25)', '2026-06-10 20:51:51', 0, 66),
(1549, NULL, '【系統公告】【公告】胡凱兒出來：我們找你 (Ref: #25)', '2026-06-10 20:51:51', 1, 92),
(1550, NULL, '【系統公告】【公告】胡凱兒出來：我們找你 (Ref: #25)', '2026-06-10 20:51:51', 0, 93),
(1552, NULL, '【系統公告】【公告】胡凱兒出來：我們找你 (Ref: #25)', '2026-06-10 20:51:51', 0, 95),
(1553, NULL, '【系統公告】【公告】胡凱兒出來：我們找你 (Ref: #25)', '2026-06-10 20:51:51', 0, 109),
(1554, NULL, '【系統公告】【公告】胡凱兒出來：我們找你 (Ref: #25)', '2026-06-10 20:51:51', 0, 110),
(1555, NULL, '【系統公告】【公告】胡凱兒出來：我們找你 (Ref: #25)', '2026-06-10 20:51:51', 0, 111),
(1556, NULL, '【系統公告】【公告】胡凱兒出來：我們找你 (Ref: #25)', '2026-06-10 20:51:51', 0, 148),
(1557, NULL, '【系統公告】【公告】胡凱兒出來：我們找你 (Ref: #25)', '2026-06-10 20:51:51', 0, 218),
(1558, NULL, '【系統公告】【公告】胡凱兒出來：我們找你 (Ref: #25)', '2026-06-10 20:51:51', 0, 264),
(1559, NULL, '【系統公告】【公告】胡凱兒出來：我們找你 (Ref: #25)', '2026-06-10 20:51:51', 0, 269),
(1560, NULL, '【系統公告】【公告】胡凱兒出來：我們找你 (Ref: #25)', '2026-06-10 20:51:51', 0, 342),
(1561, NULL, '【系統公告】【公告】胡凱兒出來：我們找你 (Ref: #25)', '2026-06-10 20:51:51', 0, 343),
(1562, NULL, '【系統公告】【公告】胡凱兒出來：我們找你 (Ref: #25)', '2026-06-10 20:51:51', 0, 344),
(1563, NULL, '【系統公告】【公告】胡凱兒出來：我們找你 (Ref: #25)', '2026-06-10 20:51:51', 0, 345),
(1564, NULL, '【系統公告】【公告】胡凱兒出來：我們找你 (Ref: #25)', '2026-06-10 20:51:51', 0, 346),
(1565, NULL, '【系統公告】【公告】胡凱兒出來：我們找你 (Ref: #25)', '2026-06-10 20:51:51', 0, 347),
(1566, NULL, '【系統公告】【公告】胡凱兒出來：我們找你 (Ref: #25)', '2026-06-10 20:51:51', 0, 348),
(1567, NULL, '【系統公告】【公告】胡凱兒出來：我們找你 (Ref: #25)', '2026-06-10 20:51:51', 0, 349),
(1568, NULL, '【系統公告】【公告】胡凱兒出來：我們找你 (Ref: #25)', '2026-06-10 20:51:51', 0, 350),
(1569, NULL, '【系統公告】【公告】胡凱兒出來：我們找你 (Ref: #25)', '2026-06-10 20:51:51', 0, 351),
(1570, NULL, '【系統公告】【公告】胡凱兒出來：我們找你 (Ref: #25)', '2026-06-10 20:51:51', 0, 352),
(1571, NULL, '【系統公告】【公告】胡凱兒出來：我們找你 (Ref: #25)', '2026-06-10 20:51:51', 0, 353),
(1572, NULL, '【系統公告】【公告】胡凱兒出來：我們找你 (Ref: #25)', '2026-06-10 20:51:51', 0, 354),
(1573, NULL, '【系統公告】【公告】胡凱兒出來：我們找你 (Ref: #25)', '2026-06-10 20:51:51', 0, 355),
(1574, NULL, '【系統公告】【公告】胡凱兒出來：我們找你 (Ref: #25)', '2026-06-10 20:51:51', 0, 356),
(1575, NULL, '【系統公告】【公告】胡凱兒出來：我們找你 (Ref: #25)', '2026-06-10 20:51:51', 0, 357),
(1576, NULL, '【系統公告】【公告】胡凱兒出來：我們找你 (Ref: #25)', '2026-06-10 20:51:51', 0, 358),
(1577, NULL, '【系統公告】【公告】胡凱兒出來：我們找你 (Ref: #25)', '2026-06-10 20:51:51', 0, 359),
(1578, NULL, '【系統公告】【公告】胡凱兒出來：我們找你 (Ref: #25)', '2026-06-10 20:51:51', 0, 360),
(1579, NULL, '【系統公告】【公告】胡凱兒出來：我們找你 (Ref: #25)', '2026-06-10 20:51:51', 0, 361),
(1580, NULL, '【系統公告】【公告】胡凱兒出來：我們找你 (Ref: #25)', '2026-06-10 20:51:51', 0, 362),
(1581, NULL, '【系統公告】【公告】胡凱兒出來：我們找你 (Ref: #25)', '2026-06-10 20:51:51', 0, 363),
(1582, NULL, '【系統公告】【公告】胡凱兒出來：我們找你 (Ref: #25)', '2026-06-10 20:51:51', 0, 364),
(1583, NULL, '【系統公告】【公告】胡凱兒出來：我們找你 (Ref: #25)', '2026-06-10 20:51:51', 0, 365),
(1584, NULL, '【系統公告】【公告】胡凱兒出來：我們找你 (Ref: #25)', '2026-06-10 20:51:51', 0, 366),
(1585, NULL, '【系統公告】【公告】胡凱兒出來：我們找你 (Ref: #25)', '2026-06-10 20:51:51', 0, 367),
(1725, 1431, '【活動提醒】您參與的球局「測試球局狀態」將在 30 分鐘內開始！請做好準備。', '2026-06-10 21:00:10', 0, 34),
(1726, 1431, '【活動提醒】您參與的球局「測試球局狀態」將在 30 分鐘內開始！請做好準備。', '2026-06-10 21:00:20', 0, 49),
(1727, 1431, '【活動提醒】您參與的球局「測試球局狀態」將在 30 分鐘內開始！請做好準備。', '2026-06-10 21:00:27', 0, 92),
(1728, 1431, '【場地確認通知】主揪已確認「測試球局狀態」現場有場地可使用，大家可以出發囉！', '2026-06-10 21:00:29', 0, 34),
(1729, 1431, '【場地確認通知】主揪已確認「測試球局狀態」現場有場地可使用，大家可以出發囉！', '2026-06-10 21:00:29', 0, 49),
(1730, 1431, '【場地確認通知】主揪已確認「測試球局狀態」現場有場地可使用，大家可以出發囉！', '2026-06-10 21:00:29', 0, 92),
(1731, 1431, '【活動提醒】您參與的球局「測試球局狀態」將在 30 分鐘內開始！請做好準備。', '2026-06-10 21:00:46', 0, 53),
(1759, 1444, '【活動開始】您參與的球局「測試結束」已經開始！祝您運動愉快。', '2026-06-10 21:11:03', 0, 34),
(1760, 1444, '【活動開始】您參與的球局「測試結束」已經開始！祝您運動愉快。', '2026-06-10 21:11:03', 0, 49),
(1761, 1444, '【活動開始】您參與的球局「測試結束」已經開始！祝您運動愉快。', '2026-06-10 21:11:03', 0, 53),
(1762, 1444, '【場地確認通知】主揪已確認「測試結束」現場有場地可使用，大家可以出發囉！', '2026-06-10 21:11:20', 0, 34),
(1763, 1444, '【場地確認通知】主揪已確認「測試結束」現場有場地可使用，大家可以出發囉！', '2026-06-10 21:11:20', 0, 49),
(1764, 1444, '【場地確認通知】主揪已確認「測試結束」現場有場地可使用，大家可以出發囉！', '2026-06-10 21:11:20', 0, 53),
(1765, 1444, '【活動結束】您參與的球局「測試結束」已順利結束，球局已自動關閉。', '2026-06-10 21:12:01', 0, 34),
(1766, 1444, '【活動結束】您參與的球局「測試結束」已順利結束，球局已自動關閉。', '2026-06-10 21:12:01', 0, 34),
(1767, 1444, '【活動結束】您參與的球局「測試結束」已順利結束，球局已自動關閉。', '2026-06-10 21:12:01', 0, 49),
(1768, 1444, '【活動結束】您參與的球局「測試結束」已順利結束，球局已自動關閉。', '2026-06-10 21:12:01', 0, 49),
(1769, 1444, '【活動結束】您參與的球局「測試結束」已順利結束，球局已自動關閉。', '2026-06-10 21:12:01', 0, 53),
(1770, 1444, '【活動結束】您參與的球局「測試結束」已順利結束，球局已自動關閉。', '2026-06-10 21:12:01', 0, 53),
(1798, 1456, '球局公告通知 ?：您參與的球局「羽球」有新公告：「請大家直接到 3 號場地集合，謝謝！」', '2026-06-10 21:15:07', 0, 397),
(1858, NULL, '【系統公告】【公告】Goood：忍者龜赫赫哈哈 (Ref: #26)', '2026-06-10 21:27:25', 0, 1),
(1859, NULL, '【系統公告】【公告】Goood：忍者龜赫赫哈哈 (Ref: #26)', '2026-06-10 21:27:25', 0, 2),
(1860, NULL, '【系統公告】【公告】Goood：忍者龜赫赫哈哈 (Ref: #26)', '2026-06-10 21:27:25', 0, 3),
(1861, NULL, '【系統公告】【公告】Goood：忍者龜赫赫哈哈 (Ref: #26)', '2026-06-10 21:27:25', 0, 4),
(1862, NULL, '【系統公告】【公告】Goood：忍者龜赫赫哈哈 (Ref: #26)', '2026-06-10 21:27:25', 0, 5),
(1863, NULL, '【系統公告】【公告】Goood：忍者龜赫赫哈哈 (Ref: #26)', '2026-06-10 21:27:25', 0, 34),
(1864, NULL, '【系統公告】【公告】Goood：忍者龜赫赫哈哈 (Ref: #26)', '2026-06-10 21:27:25', 0, 49),
(1865, NULL, '【系統公告】【公告】Goood：忍者龜赫赫哈哈 (Ref: #26)', '2026-06-10 21:27:25', 0, 50),
(1866, NULL, '【系統公告】【公告】Goood：忍者龜赫赫哈哈 (Ref: #26)', '2026-06-10 21:27:25', 0, 51),
(1867, NULL, '【系統公告】【公告】Goood：忍者龜赫赫哈哈 (Ref: #26)', '2026-06-10 21:27:25', 0, 52),
(1868, NULL, '【系統公告】【公告】Goood：忍者龜赫赫哈哈 (Ref: #26)', '2026-06-10 21:27:25', 0, 53),
(1869, NULL, '【系統公告】【公告】Goood：忍者龜赫赫哈哈 (Ref: #26)', '2026-06-10 21:27:25', 0, 66),
(1870, NULL, '【系統公告】【公告】Goood：忍者龜赫赫哈哈 (Ref: #26)', '2026-06-10 21:27:25', 0, 92),
(1871, NULL, '【系統公告】【公告】Goood：忍者龜赫赫哈哈 (Ref: #26)', '2026-06-10 21:27:25', 0, 93),
(1872, NULL, '【系統公告】【公告】Goood：忍者龜赫赫哈哈 (Ref: #26)', '2026-06-10 21:27:25', 1, 94),
(1873, NULL, '【系統公告】【公告】Goood：忍者龜赫赫哈哈 (Ref: #26)', '2026-06-10 21:27:25', 0, 95),
(1874, NULL, '【系統公告】【公告】Goood：忍者龜赫赫哈哈 (Ref: #26)', '2026-06-10 21:27:25', 0, 109),
(1875, NULL, '【系統公告】【公告】Goood：忍者龜赫赫哈哈 (Ref: #26)', '2026-06-10 21:27:25', 0, 110),
(1876, NULL, '【系統公告】【公告】Goood：忍者龜赫赫哈哈 (Ref: #26)', '2026-06-10 21:27:25', 0, 111),
(1877, NULL, '【系統公告】【公告】Goood：忍者龜赫赫哈哈 (Ref: #26)', '2026-06-10 21:27:25', 0, 148),
(1878, NULL, '【系統公告】【公告】Goood：忍者龜赫赫哈哈 (Ref: #26)', '2026-06-10 21:27:25', 0, 218),
(1879, NULL, '【系統公告】【公告】Goood：忍者龜赫赫哈哈 (Ref: #26)', '2026-06-10 21:27:25', 0, 264),
(1880, NULL, '【系統公告】【公告】Goood：忍者龜赫赫哈哈 (Ref: #26)', '2026-06-10 21:27:25', 0, 269),
(1881, NULL, '【系統公告】【公告】Goood：忍者龜赫赫哈哈 (Ref: #26)', '2026-06-10 21:27:25', 0, 342),
(1882, NULL, '【系統公告】【公告】Goood：忍者龜赫赫哈哈 (Ref: #26)', '2026-06-10 21:27:25', 0, 343),
(1883, NULL, '【系統公告】【公告】Goood：忍者龜赫赫哈哈 (Ref: #26)', '2026-06-10 21:27:25', 0, 344),
(1884, NULL, '【系統公告】【公告】Goood：忍者龜赫赫哈哈 (Ref: #26)', '2026-06-10 21:27:25', 0, 345),
(1885, NULL, '【系統公告】【公告】Goood：忍者龜赫赫哈哈 (Ref: #26)', '2026-06-10 21:27:25', 0, 346),
(1886, NULL, '【系統公告】【公告】Goood：忍者龜赫赫哈哈 (Ref: #26)', '2026-06-10 21:27:25', 0, 347),
(1887, NULL, '【系統公告】【公告】Goood：忍者龜赫赫哈哈 (Ref: #26)', '2026-06-10 21:27:25', 0, 348),
(1888, NULL, '【系統公告】【公告】Goood：忍者龜赫赫哈哈 (Ref: #26)', '2026-06-10 21:27:25', 0, 349),
(1889, NULL, '【系統公告】【公告】Goood：忍者龜赫赫哈哈 (Ref: #26)', '2026-06-10 21:27:25', 0, 350),
(1890, NULL, '【系統公告】【公告】Goood：忍者龜赫赫哈哈 (Ref: #26)', '2026-06-10 21:27:25', 0, 351),
(1891, NULL, '【系統公告】【公告】Goood：忍者龜赫赫哈哈 (Ref: #26)', '2026-06-10 21:27:25', 0, 352),
(1892, NULL, '【系統公告】【公告】Goood：忍者龜赫赫哈哈 (Ref: #26)', '2026-06-10 21:27:25', 0, 353),
(1893, NULL, '【系統公告】【公告】Goood：忍者龜赫赫哈哈 (Ref: #26)', '2026-06-10 21:27:25', 0, 354),
(1894, NULL, '【系統公告】【公告】Goood：忍者龜赫赫哈哈 (Ref: #26)', '2026-06-10 21:27:25', 0, 355),
(1895, NULL, '【系統公告】【公告】Goood：忍者龜赫赫哈哈 (Ref: #26)', '2026-06-10 21:27:25', 0, 356),
(1896, NULL, '【系統公告】【公告】Goood：忍者龜赫赫哈哈 (Ref: #26)', '2026-06-10 21:27:25', 0, 357),
(1897, NULL, '【系統公告】【公告】Goood：忍者龜赫赫哈哈 (Ref: #26)', '2026-06-10 21:27:25', 0, 358),
(1898, NULL, '【系統公告】【公告】Goood：忍者龜赫赫哈哈 (Ref: #26)', '2026-06-10 21:27:25', 0, 359),
(1899, NULL, '【系統公告】【公告】Goood：忍者龜赫赫哈哈 (Ref: #26)', '2026-06-10 21:27:25', 0, 360),
(1900, NULL, '【系統公告】【公告】Goood：忍者龜赫赫哈哈 (Ref: #26)', '2026-06-10 21:27:25', 0, 361),
(1901, NULL, '【系統公告】【公告】Goood：忍者龜赫赫哈哈 (Ref: #26)', '2026-06-10 21:27:25', 0, 362),
(1902, NULL, '【系統公告】【公告】Goood：忍者龜赫赫哈哈 (Ref: #26)', '2026-06-10 21:27:25', 0, 363),
(1903, NULL, '【系統公告】【公告】Goood：忍者龜赫赫哈哈 (Ref: #26)', '2026-06-10 21:27:25', 0, 364),
(1904, NULL, '【系統公告】【公告】Goood：忍者龜赫赫哈哈 (Ref: #26)', '2026-06-10 21:27:25', 0, 365),
(1905, NULL, '【系統公告】【公告】Goood：忍者龜赫赫哈哈 (Ref: #26)', '2026-06-10 21:27:25', 0, 366),
(1906, NULL, '【系統公告】【公告】Goood：忍者龜赫赫哈哈 (Ref: #26)', '2026-06-10 21:27:25', 0, 367),
(1907, NULL, '【系統公告】【公告】Goood：忍者龜赫赫哈哈 (Ref: #26)', '2026-06-10 21:27:25', 0, 395),
(1908, NULL, '【系統公告】【公告】Goood：忍者龜赫赫哈哈 (Ref: #26)', '2026-06-10 21:27:25', 0, 397),
(1909, NULL, '【系統公告】【公告】Goood：忍者龜赫赫哈哈 (Ref: #26)', '2026-06-10 21:27:25', 0, 398),
(1910, NULL, '【系統公告】【公告】Goood：忍者龜赫赫哈哈 (Ref: #27)', '2026-06-10 21:27:28', 0, 1),
(1911, NULL, '【系統公告】【公告】Goood：忍者龜赫赫哈哈 (Ref: #27)', '2026-06-10 21:27:28', 0, 2),
(1912, NULL, '【系統公告】【公告】Goood：忍者龜赫赫哈哈 (Ref: #27)', '2026-06-10 21:27:28', 0, 3),
(1913, NULL, '【系統公告】【公告】Goood：忍者龜赫赫哈哈 (Ref: #27)', '2026-06-10 21:27:28', 0, 4),
(1914, NULL, '【系統公告】【公告】Goood：忍者龜赫赫哈哈 (Ref: #27)', '2026-06-10 21:27:28', 0, 5),
(1915, NULL, '【系統公告】【公告】Goood：忍者龜赫赫哈哈 (Ref: #27)', '2026-06-10 21:27:28', 0, 34),
(1916, NULL, '【系統公告】【公告】Goood：忍者龜赫赫哈哈 (Ref: #27)', '2026-06-10 21:27:28', 0, 49),
(1917, NULL, '【系統公告】【公告】Goood：忍者龜赫赫哈哈 (Ref: #27)', '2026-06-10 21:27:28', 0, 50),
(1918, NULL, '【系統公告】【公告】Goood：忍者龜赫赫哈哈 (Ref: #27)', '2026-06-10 21:27:28', 0, 51),
(1919, NULL, '【系統公告】【公告】Goood：忍者龜赫赫哈哈 (Ref: #27)', '2026-06-10 21:27:28', 0, 52),
(1920, NULL, '【系統公告】【公告】Goood：忍者龜赫赫哈哈 (Ref: #27)', '2026-06-10 21:27:28', 0, 53),
(1921, NULL, '【系統公告】【公告】Goood：忍者龜赫赫哈哈 (Ref: #27)', '2026-06-10 21:27:28', 0, 66),
(1922, NULL, '【系統公告】【公告】Goood：忍者龜赫赫哈哈 (Ref: #27)', '2026-06-10 21:27:28', 0, 92),
(1923, NULL, '【系統公告】【公告】Goood：忍者龜赫赫哈哈 (Ref: #27)', '2026-06-10 21:27:28', 0, 93),
(1924, NULL, '【系統公告】【公告】Goood：忍者龜赫赫哈哈 (Ref: #27)', '2026-06-10 21:27:28', 1, 94),
(1925, NULL, '【系統公告】【公告】Goood：忍者龜赫赫哈哈 (Ref: #27)', '2026-06-10 21:27:28', 0, 95),
(1926, NULL, '【系統公告】【公告】Goood：忍者龜赫赫哈哈 (Ref: #27)', '2026-06-10 21:27:28', 0, 109),
(1927, NULL, '【系統公告】【公告】Goood：忍者龜赫赫哈哈 (Ref: #27)', '2026-06-10 21:27:28', 0, 110),
(1928, NULL, '【系統公告】【公告】Goood：忍者龜赫赫哈哈 (Ref: #27)', '2026-06-10 21:27:28', 0, 111),
(1929, NULL, '【系統公告】【公告】Goood：忍者龜赫赫哈哈 (Ref: #27)', '2026-06-10 21:27:28', 0, 148),
(1930, NULL, '【系統公告】【公告】Goood：忍者龜赫赫哈哈 (Ref: #27)', '2026-06-10 21:27:28', 0, 218),
(1931, NULL, '【系統公告】【公告】Goood：忍者龜赫赫哈哈 (Ref: #27)', '2026-06-10 21:27:28', 0, 264),
(1932, NULL, '【系統公告】【公告】Goood：忍者龜赫赫哈哈 (Ref: #27)', '2026-06-10 21:27:28', 0, 269),
(1933, NULL, '【系統公告】【公告】Goood：忍者龜赫赫哈哈 (Ref: #27)', '2026-06-10 21:27:28', 0, 342),
(1934, NULL, '【系統公告】【公告】Goood：忍者龜赫赫哈哈 (Ref: #27)', '2026-06-10 21:27:28', 0, 343),
(1935, NULL, '【系統公告】【公告】Goood：忍者龜赫赫哈哈 (Ref: #27)', '2026-06-10 21:27:28', 0, 344),
(1936, NULL, '【系統公告】【公告】Goood：忍者龜赫赫哈哈 (Ref: #27)', '2026-06-10 21:27:28', 0, 345),
(1937, NULL, '【系統公告】【公告】Goood：忍者龜赫赫哈哈 (Ref: #27)', '2026-06-10 21:27:28', 0, 346),
(1938, NULL, '【系統公告】【公告】Goood：忍者龜赫赫哈哈 (Ref: #27)', '2026-06-10 21:27:28', 0, 347),
(1939, NULL, '【系統公告】【公告】Goood：忍者龜赫赫哈哈 (Ref: #27)', '2026-06-10 21:27:28', 0, 348),
(1940, NULL, '【系統公告】【公告】Goood：忍者龜赫赫哈哈 (Ref: #27)', '2026-06-10 21:27:28', 0, 349),
(1941, NULL, '【系統公告】【公告】Goood：忍者龜赫赫哈哈 (Ref: #27)', '2026-06-10 21:27:28', 0, 350),
(1942, NULL, '【系統公告】【公告】Goood：忍者龜赫赫哈哈 (Ref: #27)', '2026-06-10 21:27:28', 0, 351),
(1943, NULL, '【系統公告】【公告】Goood：忍者龜赫赫哈哈 (Ref: #27)', '2026-06-10 21:27:28', 0, 352),
(1944, NULL, '【系統公告】【公告】Goood：忍者龜赫赫哈哈 (Ref: #27)', '2026-06-10 21:27:28', 0, 353),
(1945, NULL, '【系統公告】【公告】Goood：忍者龜赫赫哈哈 (Ref: #27)', '2026-06-10 21:27:28', 0, 354),
(1946, NULL, '【系統公告】【公告】Goood：忍者龜赫赫哈哈 (Ref: #27)', '2026-06-10 21:27:28', 0, 355),
(1947, NULL, '【系統公告】【公告】Goood：忍者龜赫赫哈哈 (Ref: #27)', '2026-06-10 21:27:28', 0, 356),
(1948, NULL, '【系統公告】【公告】Goood：忍者龜赫赫哈哈 (Ref: #27)', '2026-06-10 21:27:28', 0, 357),
(1949, NULL, '【系統公告】【公告】Goood：忍者龜赫赫哈哈 (Ref: #27)', '2026-06-10 21:27:28', 0, 358),
(1950, NULL, '【系統公告】【公告】Goood：忍者龜赫赫哈哈 (Ref: #27)', '2026-06-10 21:27:28', 0, 359),
(1951, NULL, '【系統公告】【公告】Goood：忍者龜赫赫哈哈 (Ref: #27)', '2026-06-10 21:27:28', 0, 360),
(1952, NULL, '【系統公告】【公告】Goood：忍者龜赫赫哈哈 (Ref: #27)', '2026-06-10 21:27:28', 0, 361),
(1953, NULL, '【系統公告】【公告】Goood：忍者龜赫赫哈哈 (Ref: #27)', '2026-06-10 21:27:28', 0, 362),
(1954, NULL, '【系統公告】【公告】Goood：忍者龜赫赫哈哈 (Ref: #27)', '2026-06-10 21:27:28', 0, 363),
(1955, NULL, '【系統公告】【公告】Goood：忍者龜赫赫哈哈 (Ref: #27)', '2026-06-10 21:27:28', 0, 364),
(1956, NULL, '【系統公告】【公告】Goood：忍者龜赫赫哈哈 (Ref: #27)', '2026-06-10 21:27:28', 0, 365),
(1957, NULL, '【系統公告】【公告】Goood：忍者龜赫赫哈哈 (Ref: #27)', '2026-06-10 21:27:28', 0, 366),
(1958, NULL, '【系統公告】【公告】Goood：忍者龜赫赫哈哈 (Ref: #27)', '2026-06-10 21:27:28', 0, 367),
(1959, NULL, '【系統公告】【公告】Goood：忍者龜赫赫哈哈 (Ref: #27)', '2026-06-10 21:27:28', 0, 395),
(1960, NULL, '【系統公告】【公告】Goood：忍者龜赫赫哈哈 (Ref: #27)', '2026-06-10 21:27:28', 0, 397),
(1961, NULL, '【系統公告】【公告】Goood：忍者龜赫赫哈哈 (Ref: #27)', '2026-06-10 21:27:28', 0, 398),
(1962, 1479, '【活動提醒】您參與的球局「test20260611_1」將在 24 小時內開始！請準時抵達。', '2026-06-10 21:47:09', 0, 94),
(1963, 1479, '【活動提醒】您參與的球局「test20260611_1」將在 24 小時內開始！請準時抵達。', '2026-06-10 21:47:29', 0, 49),
(1964, 1479, '【活動提醒】您參與的球局「test20260611_1」將在 24 小時內開始！請準時抵達。', '2026-06-10 21:48:08', 0, 92),
(1965, 1479, '【活動提醒】您參與的球局「test20260611_1」將在 24 小時內開始！請準時抵達。', '2026-06-10 21:48:29', 0, 34),
(1966, 1479, '【活動提醒】您參與的球局「test20260611_1」將在 24 小時內開始！請準時抵達。', '2026-06-10 21:49:15', 0, 346),
(1967, 1479, '候補成功轉正通知 ?：恭喜！YP 候補的「桌球」已成功轉為正式隊員，請準時出席！', '2026-06-10 21:49:23', 0, 346),
(1968, 1479, '【活動開始】您參與的球局「test20260611_1」已經開始！祝您運動愉快。', '2026-06-10 21:54:17', 0, 49),
(1969, 1479, '【活動開始】您參與的球局「test20260611_1」已經開始！祝您運動愉快。', '2026-06-10 21:54:17', 0, 92),
(1970, 1479, '【活動開始】您參與的球局「test20260611_1」已經開始！祝您運動愉快。', '2026-06-10 21:54:17', 0, 94),
(1971, 1479, '【活動開始】您參與的球局「test20260611_1」已經開始！祝您運動愉快。', '2026-06-10 21:54:17', 0, 346),
(1972, 1479, '【活動結束】您參與的球局「test20260611_1」已順利結束，球局已自動關閉。', '2026-06-10 21:54:57', 0, 49),
(1973, 1479, '【活動結束】您參與的球局「test20260611_1」已順利結束，球局已自動關閉。', '2026-06-10 21:54:57', 0, 92),
(1974, 1479, '【活動結束】您參與的球局「test20260611_1」已順利結束，球局已自動關閉。', '2026-06-10 21:54:57', 0, 94),
(1975, 1479, '【活動結束】您參與的球局「test20260611_1」已順利結束，球局已自動關閉。', '2026-06-10 21:54:57', 0, 346),
(1976, 1456, '【活動提醒】您參與的球局「公告測試羽球局」將在 24 小時內開始！請準時抵達。', '2026-06-11 03:00:25', 0, 395),
(1977, 1456, '【活動提醒】您參與的球局「公告測試羽球局」將在 24 小時內開始！請準時抵達。', '2026-06-11 03:00:26', 0, 397),
(1978, 1456, '【活動開始】您參與的球局「公告測試羽球局」已經開始！祝您運動愉快。', '2026-06-12 05:39:27', 0, 395),
(1979, 1456, '【活動結束】您參與的球局「公告測試羽球局」已順利結束，球局已自動關閉。', '2026-06-12 05:39:27', 0, 395),
(1980, 1456, '【活動開始】您參與的球局「公告測試羽球局」已經開始！祝您運動愉快。', '2026-06-12 05:39:27', 0, 397),
(1981, 1456, '【活動結束】您參與的球局「公告測試羽球局」已順利結束，球局已自動關閉。', '2026-06-12 05:39:27', 0, 397),
(1985, NULL, '【活動取消】您參與的球局「測試發起新場地」因人數未達下限（2人）已取消。', '2026-06-12 12:24:12', 0, 34);

-- --------------------------------------------------------

--
-- 資料表結構 `penalty_rules`
--

CREATE TABLE `penalty_rules` (
  `rule_id` int(11) NOT NULL,
  `reason` varchar(50) NOT NULL,
  `points_deducted` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- 傾印資料表的資料 `penalty_rules`
--

INSERT INTO `penalty_rules` (`rule_id`, `reason`, `points_deducted`) VALUES
(1, 'no_show', 20),
(2, 'not_paid', 15),
(3, 'bad_behavior', 10),
(4, 'verbal_abuse', 10),
(5, 'poor_attitude', 10),
(6, 'rank_mismatch', 10),
(7, 'harassment', 30),
(8, 'physical_violence', 60),
(9, 'MLM', 15),
(10, 'without_report', 10),
(11, 'price_gouging', 30),
(12, 'without_reservation', 20);

-- --------------------------------------------------------

--
-- 資料表結構 `reports`
--

CREATE TABLE `reports` (
  `report_id` int(11) NOT NULL,
  `game_id` int(11) NOT NULL,
  `reporter_id` int(11) NOT NULL,
  `offender_id` int(11) NOT NULL,
  `rule_id` int(11) DEFAULT NULL,
  `admin_note` text DEFAULT NULL,
  `reviewed_at` timestamp NULL DEFAULT NULL,
  `reviewed_by` int(11) DEFAULT NULL,
  `status` enum('pending','deducted','rejected') NOT NULL DEFAULT 'pending',
  `detail` text DEFAULT NULL COMMENT '檢舉詳細內容說明'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- 傾印資料表的資料 `reports`
--

INSERT INTO `reports` (`report_id`, `game_id`, `reporter_id`, `offender_id`, `rule_id`, `admin_note`, `reviewed_at`, `reviewed_by`, `status`, `detail`) VALUES
(5, 1209, 50, 52, NULL, '系統自動審查扣分', '2026-06-08 13:12:33', NULL, 'deducted', '[未出現] '),
(9, 1211, 50, 52, NULL, '系統自動審查扣分', '2026-06-08 13:28:00', NULL, 'deducted', '[未出現] '),
(10, 1211, 269, 52, NULL, '系統自動審查扣分', '2026-06-08 13:29:20', NULL, 'deducted', '[未出現] '),
(17, 1273, 269, 50, NULL, '系統自動審查扣分', '2026-06-08 14:00:17', NULL, 'deducted', '[未回報場地] '),
(48, 1363, 343, 346, NULL, '系統自動審查扣分', '2026-06-09 00:54:28', NULL, 'deducted', '[未出現] 臨時取消'),
(49, 1363, 349, 346, NULL, '系統自動審查扣分', '2026-06-09 00:54:32', NULL, 'deducted', '[言語攻擊] 攻擊我的資料庫成績'),
(50, 1363, 346, 347, NULL, '系統自動審查扣分', '2026-06-09 00:54:48', NULL, 'deducted', '[沒交錢] 測試'),
(51, 1369, 358, 356, NULL, '系統自動審查扣分', '2026-06-09 00:55:53', NULL, 'deducted', '[沒預約場地] 根本沒出現'),
(52, 1369, 352, 356, NULL, '系統自動審查扣分', '2026-06-09 00:56:08', NULL, 'deducted', '[未出現] 6767'),
(53, 1369, 352, 357, NULL, '系統自動審查扣分', '2026-06-09 00:56:23', NULL, 'deducted', '[未出現] 下去'),
(54, 1357, 349, 360, NULL, '系統自動審查扣分', '2026-06-09 00:56:28', NULL, 'deducted', '[等級不符] 哈哈'),
(55, 1361, 353, 356, NULL, '系統自動審查扣分', '2026-06-09 00:56:53', NULL, 'deducted', '[未出現] '),
(56, 1369, 353, 358, NULL, '系統自動審查扣分', '2026-06-09 00:57:32', NULL, 'deducted', '[未出現] '),
(57, 1369, 357, 358, NULL, '系統自動審查扣分', '2026-06-09 00:59:21', NULL, 'deducted', '[沒交錢] 惡意攻擊');

-- --------------------------------------------------------

--
-- 資料表結構 `sports`
--

CREATE TABLE `sports` (
  `sport_id` int(11) NOT NULL,
  `sport_name` varchar(50) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- 傾印資料表的資料 `sports`
--

INSERT INTO `sports` (`sport_id`, `sport_name`) VALUES
(3, '排球'),
(4, '桌球'),
(1, '籃球'),
(2, '羽球'),
(5, '麻將');

-- --------------------------------------------------------

--
-- 資料表結構 `taiwan_regions`
--

CREATE TABLE `taiwan_regions` (
  `zipcode` varchar(5) NOT NULL,
  `city` varchar(50) NOT NULL,
  `district` varchar(50) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- 傾印資料表的資料 `taiwan_regions`
--

INSERT INTO `taiwan_regions` (`zipcode`, `city`, `district`) VALUES
('400', '台中市', '中區'),
('420', '台中市', '丰原區'),
('404', '台中市', '北區'),
('406', '台中市', '北屯區'),
('402', '台中市', '南區'),
('408', '台中市', '南屯區'),
('421', '台中市', '后里區'),
('424', '台中市', '和平區'),
('438', '台中市', '外埔區'),
('439', '台中市', '大安區'),
('437', '台中市', '大甲區'),
('432', '台中市', '大肚區'),
('412', '台中市', '大里區'),
('428', '台中市', '大雅區'),
('411', '台中市', '太平區'),
('426', '台中市', '新社區'),
('423', '台中市', '東勢區'),
('401', '台中市', '東區'),
('435', '台中市', '梧棲區'),
('434', '台中市', '沙鹿區'),
('436', '台中市', '清水區'),
('427', '台中市', '潭子區'),
('414', '台中市', '烏日區'),
('422', '台中市', '石岡區'),
('429', '台中市', '神岡區'),
('403', '台中市', '西區'),
('407', '台中市', '西屯區'),
('413', '台中市', '霧峰區'),
('433', '台中市', '龍井區'),
('104', '台北市', '中山區'),
('100', '台北市', '中正區'),
('110', '台北市', '信義區'),
('114', '台北市', '內湖區'),
('112', '台北市', '北投區'),
('115', '台北市', '南港區'),
('111', '台北市', '士林區'),
('103', '台北市', '大同區'),
('106', '台北市', '大安區'),
('116', '台北市', '文山區'),
('105', '台北市', '松山區'),
('108', '台北市', '萬華區'),
('237', '新北市', '三峽區'),
('252', '新北市', '三芝區'),
('241', '新北市', '三重區'),
('235', '新北市', '中和區'),
('244', '新北市', '五股區'),
('248', '新北市', '八里區'),
('236', '新北市', '土城區'),
('232', '新北市', '坪林區'),
('226', '新北市', '平溪區'),
('231', '新北市', '新店區'),
('242', '新北市', '新莊區'),
('220', '新北市', '板橋區'),
('249', '新北市', '林口區'),
('238', '新北市', '樹林區'),
('234', '新北市', '永和區'),
('221', '新北市', '汐止區'),
('243', '新北市', '泰山區'),
('251', '新北市', '淡水區'),
('222', '新北市', '深坑區'),
('233', '新北市', '烏來區'),
('224', '新北市', '瑞芳區'),
('223', '新北市', '石碇區'),
('253', '新北市', '石門區'),
('207', '新北市', '萬里區'),
('247', '新北市', '蘆洲區'),
('228', '新北市', '貢寮區'),
('208', '新北市', '金山區'),
('227', '新北市', '雙溪區'),
('239', '新北市', '鶯歌區'),
('320', '桃園市', '中壢區'),
('334', '桃園市', '八德區'),
('337', '桃園市', '大園區'),
('335', '桃園市', '大溪區'),
('324', '桃園市', '平鎮區'),
('336', '桃園市', '復興區'),
('327', '桃園市', '新屋區'),
('330', '桃園市', '桃園區'),
('326', '桃園市', '楊梅區'),
('338', '桃園市', '蘆竹區'),
('328', '桃園市', '觀音區'),
('325', '桃園市', '龍潭區'),
('333', '桃園市', '龜山區');

-- --------------------------------------------------------

--
-- 資料表結構 `users`
--

CREATE TABLE `users` (
  `user_id` int(11) NOT NULL,
  `role` enum('user','admin') NOT NULL DEFAULT 'user',
  `name` varchar(100) NOT NULL,
  `credit_point` int(11) NOT NULL DEFAULT 100,
  `phone` varchar(20) DEFAULT NULL,
  `birth_date` date DEFAULT NULL,
  `gender` enum('男','女','其他','不願透漏') NOT NULL,
  `avatar_url` varchar(255) DEFAULT NULL COMMENT '頭貼網址',
  `bio` text DEFAULT NULL COMMENT '個人簡介',
  `password` varchar(255) NOT NULL,
  `line_id` varchar(50) DEFAULT NULL COMMENT 'LINE ID',
  `instagram` varchar(50) DEFAULT NULL COMMENT 'Instagram 帳號',
  `email` varchar(255) DEFAULT NULL COMMENT '電子郵件',
  `last_credit_update` datetime(6) NOT NULL DEFAULT current_timestamp(6)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- 傾印資料表的資料 `users`
--

INSERT INTO `users` (`user_id`, `role`, `name`, `credit_point`, `phone`, `birth_date`, `gender`, `avatar_url`, `bio`, `password`, `line_id`, `instagram`, `email`, `last_credit_update`) VALUES
(1, 'admin', '楊鑫', 90, '0912345678', '2006-04-17', '男', NULL, '韓德利克森', 'pbkdf2_sha256$1000000$Ob4VjsnLjhELSSz2CKja2E$25q33MTRBi2ImRNJj7GZHKcbovB406/2NHTPNVZ4eRw=', NULL, NULL, NULL, '2026-06-09 04:57:30.005689'),
(2, 'admin', '林明和', 90, '0923456789', '2026-07-11', '男', NULL, '阿葛力搏依', '12345678', NULL, NULL, NULL, '2026-06-09 04:57:30.005689'),
(3, 'admin', '陳涵林', 90, '0934567890', '2026-06-25', '女', NULL, NULL, '12345678', NULL, NULL, NULL, '2026-06-09 04:57:30.005689'),
(4, 'admin', '簡律', 90, '0945678901', '2025-10-11', '女', NULL, NULL, '', NULL, NULL, NULL, '2026-06-09 04:57:30.005689'),
(5, 'admin', '李偲伃', 90, '0956789012', '2026-03-05', '女', NULL, 'SB', '', NULL, NULL, NULL, '2026-06-09 04:57:30.005689'),
(34, 'admin', 'air', 82, '0911111111', '2006-07-11', '男', 'https://api.dicebear.com/9.x/adventurer/svg?seed=Lucky', '', 'pbkdf2_sha256$1200000$9IqkpJxIoYPyIHyPLM9PNL$n9lDv51hFDQUAlu7HIrsR712li3DtOP5f0HjhrG6+P0=', NULL, NULL, 'air005831@gmail.com', '2026-06-13 04:57:30.005689'),
(49, 'admin', 'lyu', 91, '0921270847', '2005-10-11', '女', 'https://api.dicebear.com/9.x/adventurer/svg?seed=Sasha', '6767', 'pbkdf2_sha256$1200000$9Sn8KOH2fJmmeUPsmmgUM2$gk5fdl/UamH/jA1eCrpqJuEOwQ/hhgMWzVONc7Q1CKw=', NULL, NULL, 'humulus1011@gmail.com', '2026-06-11 04:57:30.005689'),
(50, 'admin', 'air-1', 100, '0911111112', '2026-06-08', '男', 'https://api.dicebear.com/9.x/adventurer/svg?seed=Lucky', '', 'pbkdf2_sha256$1200000$2lR87zFl7SPZFlwH8tC0wT$Ri9bfYDaF+3y73/SpyOU+sYiQ2n+1jxFzhWqB4exNYw=', NULL, NULL, 'air1@gmail.com', '2026-06-09 04:57:30.005689'),
(51, 'user', 'air-2', 91, '0911111113', '2026-06-01', '男', 'https://api.dicebear.com/9.x/adventurer/svg?seed=Lucky', '', 'pbkdf2_sha256$1200000$lSWCBJQUot8kzeybkj9Lf6$VaNENr/rz1jIUUbaF2zgPi1liICsbRNtmM5446bPeww=', NULL, NULL, 'air2@gmail.com', '2026-06-11 04:57:30.005689'),
(52, 'user', 'air3', 100, '0911111133', '2026-06-08', '男', 'https://api.dicebear.com/9.x/adventurer/svg?seed=Lucky', '', 'pbkdf2_sha256$1200000$hXYlBTGZnw29k80iG0d9FB$3FABmZJyTNS/CoVlnM/NAd/SJ7HRoawjQix3p/kYau4=', NULL, NULL, 'air3@gmail.com', '2026-06-09 04:57:30.005689'),
(53, 'user', 'air4', 91, '0911111114', '2026-06-08', '男', 'https://api.dicebear.com/9.x/adventurer/svg?seed=Jasmine', '', 'pbkdf2_sha256$1200000$mvPHqW8y9Hl7jRCiclc6tO$1Tg0lwo6duLQiaFajGV7k3LE4BHg2EOp9EvlaDK7J5c=', NULL, NULL, 'air4@gmail.com', '2026-06-11 04:57:30.005689'),
(66, 'user', 'Test User', 90, NULL, NULL, '不願透漏', NULL, NULL, 'pbkdf2_sha256$1000000$aNGRUPnpG0eQMk8FMnCIkv$TisNV8NLcMPWFpBHupGarc6X/eu4Rpp9f95+Q3+TcNo=', NULL, NULL, 'test@test.com', '2026-06-09 04:57:30.005689'),
(92, 'admin', 'admin', 81, '0988888888', '2026-06-08', '男', 'https://api.dicebear.com/9.x/adventurer/svg?seed=Mochi', '我超強的', 'pbkdf2_sha256$1200000$vg2vkSUoAqKxKWhHdNUbCy$W+WKzZb4mE9VmSFTb6FPNV12vYATXg0dN8CvH6pIxMA=', NULL, NULL, 'admin@ex.com', '2026-06-11 04:57:30.005689'),
(93, 'user', 'qwerty', 90, NULL, NULL, '不願透漏', NULL, NULL, 'pbkdf2_sha256$1000000$T2vyXMPhT7fox5I9yIHw8F$/59A/0CY28APB5INi16AEcbmbD8P2Fl8G/ULK0u9t6w=', NULL, NULL, 'qwerty@gmail.com', '2026-06-09 04:57:30.005689'),
(94, 'admin', 'harriet', 91, '0906390625', '2006-06-08', '女', 'https://api.dicebear.com/9.x/adventurer/svg?seed=Sasha', 'hello', 'pbkdf2_sha256$1200000$PolTSTCwJE9tGlr4wGbMtr$hANGzyWIu/iyfO0U4UTi61CBc5EQ27NgFldlBQF1J+o=', 'line', 'insta', 'hed123er@gmail.com', '2026-06-11 04:57:30.005689'),
(95, 'user', 'test', 90, '0909090909', '2006-06-25', '男', 'https://api.dicebear.com/9.x/adventurer/svg?seed=Mochi', 'hello how are u im fine thank u ', 'pbkdf2_sha256$1000000$3BzcLhYZN4t3RkR3Equil7$F+isv+9TzeTka21hgHW0GncNNuTvsfm2ERzrhbIegig=', 'lineme', 'instagrm', 'test@gmail.com', '2026-06-09 04:57:30.005689'),
(109, 'admin', 'admin', 90, NULL, NULL, '不願透漏', NULL, NULL, 'pbkdf2_sha256$1200000$aI1h7Tg3DvXJ1idKmYLzyo$URA0LexnN940KpiJbNiVyyoUv4iLLiCvi9eq/9cu4SA=', NULL, NULL, 'admin123@ex.com', '2026-06-09 04:57:30.005689'),
(110, 'admin', 'TestAdmin', 90, NULL, NULL, '不願透漏', NULL, NULL, 'pbkdf2_sha256$1000000$jpycdBm3Bdmipm5dx5ORAm$SY/i1r6BuXfJFD9EGx+tAdGzEMLD15jbETHJTB7TFOI=', NULL, NULL, 'testadmin@example.com', '2026-06-09 04:57:30.005689'),
(111, 'admin', 'AdminCLI', 90, NULL, NULL, '不願透漏', NULL, NULL, '!wadsgzCJudg18tuxEfl9rL8WkB6ujReeZNFEia6r', NULL, NULL, 'admin_cli@example.com', '2026-06-09 04:57:30.005689'),
(148, 'user', 'testuser', 90, '0912345677', '2006-10-07', '男', 'https://api.dicebear.com/9.x/adventurer/svg?seed=Pudding', '', 'pbkdf2_sha256$1000000$Krzxzj295J8Pg9i0I84Isg$IUUBXpE5R2GEaIiZPkG6JyMRAn3Oef41xyGotfT+fZY=', NULL, NULL, 'user@gmail.com', '2026-06-09 04:57:30.005689'),
(218, 'user', 'HTTP測試員', 90, '0900000000', '1995-05-05', '男', NULL, NULL, 'pbkdf2_sha256$1000000$CYy5TxdCDlagBeKnEI0awu$KU5UWpIVhPP4TIoF79RydfkUcbL1xQ/MByygUACVl/s=', NULL, NULL, 'http_test@example.com', '2026-06-09 04:57:30.005689'),
(264, 'user', 'airgirl', 90, '0912121212', '2026-06-08', '女', 'https://api.dicebear.com/9.x/adventurer/svg?seed=Cookie', '', 'pbkdf2_sha256$1000000$yz0aTMEB1KOcHY9fefMpVl$h4bnr9JkjONWiO025tgrZ8SHnXv8j131i03io4QrLT4=', NULL, NULL, 'airgirl@gmail.com', '2026-06-09 04:57:30.005689'),
(269, 'user', 'airgirl2', 90, '0987878787', '2026-06-08', '女', 'https://api.dicebear.com/9.x/adventurer/svg?seed=Mochi', '', 'pbkdf2_sha256$1200000$fz0auSXZ0KUcYhldGchZEh$ut3Nyx+AtyUq/8Xi/eJBFhdSkSlCV7mMCIiKPqZvgiI=', NULL, NULL, 'airgirl2@gmail.com', '2026-06-09 04:57:30.005689'),
(342, 'user', 'Asdfg', 100, '0920913345', '2009-02-09', '女', 'https://api.dicebear.com/9.x/adventurer/svg?seed=Lucky', 'Hellooooooo', 'pbkdf2_sha256$1200000$RAs5vJNszSiIK94WUzcKu3$fhhpAyMEqAbgLgBGHpgeiaV4rrjAk7AF9ddfdzC/OSw=', NULL, 'Instagram', 'asdfg@gmail.com', '2026-06-09 07:28:40.897680'),
(343, 'user', 'ㄊㄩ', 100, '0906925619', '2005-08-09', '女', 'https://api.dicebear.com/9.x/adventurer/svg?seed=Lucky', '', 'pbkdf2_sha256$1200000$CrDujfziTKHziBlyhTckvF$mcN/C1i1NEoqhJ/ty2fwf8t/JTot0d/2XwDuxqWgcmE=', NULL, NULL, 'leenina831831@gmail.com', '2026-06-09 08:44:24.350845'),
(344, 'user', 'Nate', 100, '0905245765', '2018-06-09', '男', 'https://api.dicebear.com/9.x/adventurer/svg?seed=Cookie', 'hahahahahha', 'pbkdf2_sha256$1200000$eD8eFDUCbeD53XKV5MlvdR$T1eJaJjMmbCfOc22YGPh3N+S7m4bL2dOJUka2Z9E8jo=', '1234o', '1234', 'a@gmail.com', '2026-06-09 08:44:26.268113'),
(345, 'user', '高', 100, '0902123836', '1991-08-09', '女', 'https://api.dicebear.com/9.x/adventurer/svg?seed=Mochi', '', 'pbkdf2_sha256$1200000$FuWalrlBSreqkntfLVowU2$pvG2pxpwm5n8JDg5eyCLjYGxgsqI+PXmZHXRE0lorjs=', NULL, NULL, 'joykao0123@gmail.com', '2026-06-09 08:44:32.226821'),
(346, 'user', 'YP', 60, '0912345679', '2000-01-01', '男', 'https://api.dicebear.com/9.x/adventurer/svg?seed=Willow', '', 'pbkdf2_sha256$1200000$zVsw6Tc9qRwrSqCjkzQHl4$b/M8jPUVW4mqa5sy6wvSU/BP/DZpXUW825r2udgzQVo=', NULL, NULL, 'yp@mail.com', '2026-06-09 08:44:34.693967'),
(347, 'user', '兩打', 85, '0912345667', '2026-06-01', '男', 'https://api.dicebear.com/9.x/adventurer/svg?seed=Lucky', '', 'pbkdf2_sha256$1200000$1av7WF4YH7CBHVrAG2EKtU$AL1RlZL7Wh/355efYRsZFxmYP2gu/extUI4J3q2Nd4c=', NULL, NULL, 'amida18706@gmail.com', '2026-06-09 08:44:35.176807'),
(348, 'user', '陳昕揚', 100, '0966120140', '2005-12-12', '男', 'https://api.dicebear.com/9.x/adventurer/svg?seed=Lucky', '', 'pbkdf2_sha256$1200000$dlqhHMEIHV1EoZxYHyI415$A0ih+qhYfAYpAeK+lTyHtFNS3863sGhhhg1zEnWH6LM=', NULL, NULL, 'sean.xy.chen@gmail.com', '2026-06-09 08:44:37.112617'),
(349, 'user', 'Jdjj', 100, '0900000003', '1916-06-09', '男', 'https://api.dicebear.com/9.x/adventurer/svg?seed=Lucky', '', 'pbkdf2_sha256$1200000$7KSd5dEJGyOtmqkujqDYiP$M4j34uhorFSX3GPr11m4sNQEKAKFA5CLO9RuiN0/Cko=', NULL, NULL, '11111@gmail.com', '2026-06-09 08:44:39.333638'),
(350, 'user', 'Abc', 100, '0923456782', '1981-06-09', '男', 'https://api.dicebear.com/9.x/adventurer/svg?seed=Jasmine', '', 'pbkdf2_sha256$1200000$EReIT52lijBraHkapYJCEt$WrUY2AYUf6RhJosa9TMPq5pJkdqzBdIlmS2MbFkdiXY=', NULL, NULL, 'systsgs@gmail.com', '2026-06-09 08:44:40.206267'),
(351, 'user', '捷Jay', 100, '0900000001', '2006-01-05', '男', 'https://api.dicebear.com/9.x/adventurer/svg?seed=Willow', '', 'pbkdf2_sha256$1200000$b3HmU633AoduVA1PfLcsY3$HrYnJTaXB/8lFKHdlh4OElEKYo6jJf6aett+tXIBY/s=', NULL, NULL, 'yade0720@gmail.com', '2026-06-09 08:44:50.261034'),
(352, 'user', '憨仔', 100, '0967676767', '1967-06-09', '女', 'https://api.dicebear.com/9.x/adventurer/svg?seed=Lucky', '', 'pbkdf2_sha256$1200000$B9IsvzvrYjCPtlqIgCX2Xq$An7ikxNmAO/kM8DouuFOF7jeeQP7KGV8KOfDMhjpg6c=', NULL, NULL, 'g@gmail.com', '2026-06-09 08:44:52.451403'),
(353, 'user', '肛門', 100, '0908265843', '2008-06-09', '女', 'https://api.dicebear.com/9.x/adventurer/svg?seed=Pudding', '', 'pbkdf2_sha256$1200000$72osMda9wmxlo9bq3xGjPJ$8NW0Ngsw34LR3NKzA4TJVl1l6sgdTfFJjWNymkCcxEY=', NULL, NULL, 'difjd@sisjs.com', '2026-06-09 08:44:57.027787'),
(354, 'user', '666', 100, NULL, NULL, '不願透漏', NULL, NULL, 'pbkdf2_sha256$1200000$ZIoIyA4ErZPxosxjaJZSNW$iIjbQmhmahyV62BpgPibxpuhH8lFH56YQ+/SflISZlc=', NULL, NULL, '123@gmail.com', '2026-06-09 08:45:01.858771'),
(355, 'user', '123', 100, '0911777516', '1979-06-09', '男', 'https://api.dicebear.com/9.x/adventurer/svg?seed=Lucky', '', 'pbkdf2_sha256$1200000$B7oUjHFeDazQvjMXY9QCAB$QfLEx/nqLxnH8hrY6FLQwiej6djqkoeT0FGI4hGLpUM=', '123', 'Qwer', '123@123.mail', '2026-06-09 08:45:09.226540'),
(356, 'user', '黃禮志的狗', 0, '0913567286', '2002-06-09', '男', 'https://api.dicebear.com/9.x/adventurer/svg?seed=Lucky', '', 'pbkdf2_sha256$1200000$o2ubwIJcfVa2TwEBtXuBsL$DXXnEwJoXbAny2h3u+51Xpo8m3l9Xx2aiaa/2og9Fvk=', NULL, NULL, 'nygerhaha@gmail.com', '2026-06-09 08:45:12.193088'),
(357, 'user', '嘻嘻', 70, '0912345692', '2026-06-09', '男', 'https://api.dicebear.com/9.x/adventurer/svg?seed=Willow', 'ㄌㄉ帥', 'pbkdf2_sha256$1200000$2ym6shsWFzin59cm9OvFSY$JGiWI30TqzHK6+Vlts1SMRB/mOuDZJw0mCKu/FQCK3w=', NULL, NULL, '1@gmail.com', '2026-06-09 08:45:14.320798'),
(358, 'user', '吳老師', 65, '0976151646', '2013-06-09', '男', 'https://api.dicebear.com/9.x/adventurer/svg?seed=Leo', '', 'pbkdf2_sha256$1200000$o0s1AVoxxIUzOL7jCTLrmM$pNBBjqlUpHml6qcN+mOLDG1PXZSUpHtkqPb3io7wW0Q=', NULL, NULL, 'g2487701324@gmail.com', '2026-06-09 08:45:21.451921'),
(359, 'user', 'kt', 100, NULL, NULL, '不願透漏', NULL, NULL, 'pbkdf2_sha256$1200000$oWi6DQ8Dbqm0OzdaYHBGxr$U7gqiI80kWTFyKNgf6heOKHoPmUhQpI8hp1iu2WuRFE=', NULL, NULL, 'exmple@exmple.com', '2026-06-09 08:45:21.900673'),
(360, 'user', '蔡翔宇', 90, '0924513762', '1970-06-09', '男', 'https://api.dicebear.com/9.x/adventurer/svg?seed=Lucky', '我超帥', 'pbkdf2_sha256$1200000$Wd3hoocIbP6gr1h4fU2rCf$29jttnCsbnyNdToueSusIXcMEBwI0StEm/q6ooZcy80=', NULL, NULL, '6123@gmail.com', '2026-06-09 08:45:27.123024'),
(361, 'user', 'Simo', 100, '0973161231', '2006-06-09', '女', 'https://api.dicebear.com/9.x/adventurer/svg?seed=Lucky', '', 'pbkdf2_sha256$1200000$EYn6BFknOdQVX3gT0ibTXZ$ZB0YOevQau3WcKiJZOfjOYdYlmpylfcjqr3OGNO+F50=', NULL, NULL, 'a20060620a@gmail.com', '2026-06-09 08:52:52.786351'),
(362, 'user', '黃禮志的狗-復仇記', 100, '0912867580', '1989-06-09', '男', 'https://api.dicebear.com/9.x/adventurer/svg?seed=Lucky', '', 'pbkdf2_sha256$1200000$DDs7xQq3lgjdyl5q2vjvcS$87s/XCXrZHdf/lnnvky0VBd16kHj17oFqNXK1MA1dro=', NULL, NULL, 'nyger@gmail.com', '2026-06-09 08:59:15.979452'),
(363, 'user', '你呼稱麼怎家大', 100, '0907210278', '2005-09-22', '男', 'https://api.dicebear.com/9.x/adventurer/svg?seed=Willow', '', 'pbkdf2_sha256$1200000$pp3ot7EnLSOE5SmrTGY2M0$wPCjVcEDcPUIvdBtok2sEIjNJuRHagf0QXzxQUpEgds=', NULL, NULL, 'cgu1329061@gmail.com', '2026-06-10 06:05:54.548749'),
(364, 'user', '皮炎大盜', 100, '0912123345', '2004-06-10', '男', 'https://api.dicebear.com/9.x/adventurer/svg?seed=Pudding', '偷*', 'pbkdf2_sha256$1200000$iWejGCsjFhzoDk57gerJIb$zDKzo/NzhfOyVEUVPCvjsI3Ofl/Z8eisgpaIYZdQv6o=', NULL, NULL, '123$$$@gmail.com', '2026-06-10 06:10:07.159615'),
(365, 'user', '剪綠', 100, '0909090908', '2005-10-11', '女', 'https://api.dicebear.com/9.x/adventurer/svg?seed=Cookie', '', 'pbkdf2_sha256$1200000$CkagxRiV2WOCRz9el4fIFn$OCtmOyQQ5pKofnnIm8pc+qLyYlwxcyf2U4JEjHLB2/Q=', NULL, NULL, 'Bryan.chiu9@gmail.com', '2026-06-11 04:23:09.343961'),
(366, 'user', 'Chiuu', 100, '0921270844', '2026-03-18', '男', 'https://api.dicebear.com/9.x/adventurer/svg?seed=Lucky', '', 'pbkdf2_sha256$1200000$4DNq1qVpseVBOE9z54VFe0$30sIsjb/LQvVz+L1s8iZbzo3jO6PA6YN7ba9ZPxD4tU=', NULL, NULL, 'lyu@gmail.ocm', '2026-06-11 04:32:05.920732'),
(367, 'user', '皮炎', 100, '0912334455', '2026-06-11', '男', 'https://api.dicebear.com/9.x/adventurer/svg?seed=Leo', '', 'pbkdf2_sha256$1200000$ZLKXhTeaJgQzpN3N1Heh96$t0TzTTHuwIZBFy0j3WactVbd3k7iOYIW30PfIN5oxAI=', NULL, NULL, '1234567@gmail.com', '2026-06-11 04:50:13.661852'),
(395, 'user', '公告主揪A', 100, '0900111111', '2000-01-01', '男', NULL, NULL, 'pbkdf2_sha256$1200000$pBkqPBjrZFu3qKUZkHcqI6$4CwsX/jYM0vfdrPB66mgTOw5HtKwptxCDFUXNOi7h8c=', NULL, NULL, 'user_bulletin_a@example.com', '2026-06-11 05:15:04.959336'),
(397, 'user', '球友B', 100, '0900222222', '2000-01-02', '女', NULL, NULL, 'pbkdf2_sha256$1200000$LuDqZpDfYpOpCRdSAKLjbQ$oYV2BgoaCacY8N3gz+tlXCss4gqjdq4wDbvW5JbKOcc=', NULL, NULL, 'user_bulletin_b@example.com', '2026-06-11 05:15:05.671468'),
(398, 'user', '旁觀者C', 100, NULL, NULL, '不願透漏', NULL, NULL, 'pbkdf2_sha256$1200000$TGeuQH9dAfT77E8ryy7wv5$jy4owGns1SDaqRKRCng8n1IZRcKxB2x6CyrmS7ZLoJQ=', NULL, NULL, 'user_bulletin_c@example.com', '2026-06-11 05:15:06.390982'),
(414, 'user', '123', 100, NULL, NULL, '不願透漏', NULL, NULL, 'pbkdf2_sha256$1200000$uMIY2OtNz1A25zM9k7HilT$K8EYcMwaH7B5hmxNnG/aSmQbWwR3bgqp3bQNG/owMak=', NULL, NULL, 'qwertdfdxg@gmail.com', '2026-06-11 05:52:36.194751'),
(415, 'user', 'Y', 100, '0914725836', '2008-01-30', '女', 'https://api.dicebear.com/9.x/adventurer/svg?seed=Sasha', '', 'pbkdf2_sha256$1200000$qrKYtrdQf98mmuJIgqlXOz$dd3haQqBWbjY+s6SpZ8Au3AETJGVsQP2xcxWAHattYg=', NULL, NULL, 'lin.fanny97@gmail.com', '2026-06-13 07:16:54.576332');

-- --------------------------------------------------------

--
-- 資料表結構 `user_sport_levels`
--

CREATE TABLE `user_sport_levels` (
  `id` int(11) NOT NULL,
  `user_id` int(11) NOT NULL,
  `sport_id` int(11) NOT NULL,
  `level` enum('C','B','A','S') NOT NULL,
  `updated_at` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- 傾印資料表的資料 `user_sport_levels`
--

INSERT INTO `user_sport_levels` (`id`, `user_id`, `sport_id`, `level`, `updated_at`) VALUES
(21, 34, 1, 'C', '2026-06-07 07:29:28'),
(22, 34, 3, 'S', '2026-06-07 07:29:28'),
(23, 34, 2, 'C', '2026-06-07 07:29:28'),
(24, 34, 4, 'C', '2026-06-07 07:29:28'),
(25, 34, 5, 'C', '2026-06-07 07:29:28'),
(35, 49, 1, 'A', '2026-06-08 23:23:19'),
(36, 49, 3, 'C', '2026-06-08 23:23:19'),
(37, 49, 2, 'S', '2026-06-08 23:23:19'),
(38, 49, 4, 'B', '2026-06-08 23:23:19'),
(39, 49, 5, 'S', '2026-06-08 23:23:19'),
(40, 50, 1, 'C', '2026-06-08 23:18:03'),
(41, 50, 3, 'S', '2026-06-08 23:18:03'),
(42, 50, 2, 'B', '2026-06-08 23:18:03'),
(43, 50, 4, 'C', '2026-06-08 23:18:03'),
(44, 50, 5, 'S', '2026-06-08 23:18:03'),
(45, 51, 1, 'C', '2026-06-07 18:39:46'),
(46, 51, 3, 'C', '2026-06-07 18:39:46'),
(47, 51, 2, 'C', '2026-06-07 18:39:46'),
(48, 51, 4, 'C', '2026-06-07 18:39:46'),
(49, 51, 5, 'C', '2026-06-07 18:39:46'),
(50, 52, 1, 'C', '2026-06-07 18:40:40'),
(51, 52, 3, 'C', '2026-06-07 18:40:40'),
(52, 52, 2, 'C', '2026-06-07 18:40:40'),
(53, 52, 4, 'C', '2026-06-07 18:40:40'),
(54, 52, 5, 'C', '2026-06-07 18:40:40'),
(55, 53, 1, 'C', '2026-06-07 18:41:34'),
(56, 53, 3, 'C', '2026-06-07 18:41:34'),
(57, 53, 2, 'C', '2026-06-07 18:41:34'),
(58, 53, 4, 'C', '2026-06-07 18:41:34'),
(59, 53, 5, 'C', '2026-06-07 18:41:34'),
(84, 92, 1, 'S', '2026-06-08 23:57:19'),
(85, 92, 3, 'S', '2026-06-08 23:57:19'),
(86, 92, 2, 'S', '2026-06-08 23:57:19'),
(87, 92, 4, 'S', '2026-06-08 23:57:19'),
(88, 92, 5, 'S', '2026-06-08 23:57:19'),
(89, 94, 1, 'S', '2026-06-08 01:48:06'),
(90, 94, 3, 'S', '2026-06-08 01:48:06'),
(91, 94, 2, 'S', '2026-06-08 01:48:06'),
(92, 94, 4, 'S', '2026-06-08 01:48:06'),
(93, 94, 5, 'S', '2026-06-08 01:48:06'),
(98, 95, 1, 'S', '2026-06-08 02:13:15'),
(99, 95, 3, 'A', '2026-06-08 02:13:15'),
(100, 95, 2, 'S', '2026-06-08 02:13:15'),
(101, 95, 4, 'B', '2026-06-08 02:13:15'),
(102, 95, 5, 'C', '2026-06-08 02:13:15'),
(129, 148, 1, 'C', '2026-06-08 05:17:45'),
(130, 148, 3, 'C', '2026-06-08 05:17:45'),
(131, 148, 2, 'C', '2026-06-08 05:17:45'),
(132, 148, 4, 'C', '2026-06-08 05:17:45'),
(133, 148, 5, 'C', '2026-06-08 05:17:45'),
(168, 218, 2, 'B', '2026-06-08 08:07:55'),
(197, 264, 1, 'C', '2026-06-08 10:20:23'),
(198, 264, 3, 'C', '2026-06-08 10:20:23'),
(199, 264, 2, 'C', '2026-06-08 10:20:23'),
(200, 264, 4, 'C', '2026-06-08 10:20:23'),
(201, 264, 5, 'C', '2026-06-08 10:20:23'),
(206, 269, 1, 'C', '2026-06-08 11:18:09'),
(207, 269, 3, 'C', '2026-06-08 11:18:09'),
(208, 269, 2, 'C', '2026-06-08 11:18:09'),
(209, 269, 4, 'C', '2026-06-08 11:18:09'),
(210, 269, 5, 'C', '2026-06-08 11:18:09'),
(276, 342, 1, 'S', '2026-06-08 23:29:15'),
(277, 342, 3, 'C', '2026-06-08 23:29:15'),
(278, 342, 2, 'C', '2026-06-08 23:29:15'),
(279, 342, 4, 'C', '2026-06-08 23:29:15'),
(280, 342, 5, 'C', '2026-06-08 23:29:15'),
(281, 343, 1, 'C', '2026-06-09 00:44:55'),
(282, 343, 3, 'C', '2026-06-09 00:44:55'),
(283, 343, 2, 'B', '2026-06-09 00:44:55'),
(284, 343, 4, 'C', '2026-06-09 00:44:55'),
(285, 343, 5, 'B', '2026-06-09 00:44:55'),
(286, 348, 1, 'C', '2026-06-09 00:45:00'),
(287, 348, 3, 'C', '2026-06-09 00:45:00'),
(288, 348, 2, 'C', '2026-06-09 00:45:00'),
(289, 348, 4, 'C', '2026-06-09 00:45:00'),
(290, 348, 5, 'C', '2026-06-09 00:45:00'),
(291, 353, 1, 'C', '2026-06-09 00:45:20'),
(292, 353, 3, 'C', '2026-06-09 00:45:20'),
(293, 353, 2, 'C', '2026-06-09 00:45:20'),
(294, 353, 4, 'C', '2026-06-09 00:45:20'),
(295, 353, 5, 'C', '2026-06-09 00:45:20'),
(296, 350, 1, 'C', '2026-06-09 00:45:33'),
(297, 350, 3, 'C', '2026-06-09 00:45:33'),
(298, 345, 1, 'C', '2026-06-09 00:51:32'),
(299, 350, 2, 'C', '2026-06-09 00:45:33'),
(300, 345, 3, 'S', '2026-06-09 00:51:32'),
(301, 350, 4, 'C', '2026-06-09 00:45:33'),
(302, 345, 2, 'C', '2026-06-09 00:51:32'),
(303, 350, 5, 'C', '2026-06-09 00:45:33'),
(304, 345, 4, 'C', '2026-06-09 00:51:32'),
(305, 345, 5, 'C', '2026-06-09 00:51:32'),
(306, 352, 1, 'C', '2026-06-09 00:52:37'),
(307, 352, 3, 'C', '2026-06-09 00:52:38'),
(308, 352, 2, 'C', '2026-06-09 00:52:38'),
(309, 352, 4, 'C', '2026-06-09 00:52:38'),
(310, 352, 5, 'C', '2026-06-09 00:52:38'),
(311, 355, 1, 'C', '2026-06-09 00:45:49'),
(312, 355, 3, 'C', '2026-06-09 00:45:49'),
(313, 355, 2, 'C', '2026-06-09 00:45:49'),
(314, 355, 4, 'C', '2026-06-09 00:45:49'),
(315, 355, 5, 'C', '2026-06-09 00:45:49'),
(316, 346, 1, 'A', '2026-06-09 00:45:51'),
(317, 346, 3, 'A', '2026-06-09 00:45:51'),
(318, 346, 2, 'A', '2026-06-09 00:45:51'),
(319, 346, 4, 'A', '2026-06-09 00:45:51'),
(320, 346, 5, 'A', '2026-06-09 00:45:51'),
(321, 349, 1, 'S', '2026-06-09 00:46:12'),
(322, 349, 3, 'S', '2026-06-09 00:46:12'),
(323, 349, 2, 'S', '2026-06-09 00:46:12'),
(324, 349, 4, 'S', '2026-06-09 00:46:12'),
(325, 349, 5, 'S', '2026-06-09 00:46:12'),
(326, 344, 1, 'C', '2026-06-09 00:46:21'),
(327, 344, 3, 'C', '2026-06-09 00:46:21'),
(328, 344, 2, 'C', '2026-06-09 00:46:21'),
(329, 344, 4, 'C', '2026-06-09 00:46:21'),
(330, 344, 5, 'C', '2026-06-09 00:46:22'),
(331, 360, 1, 'S', '2026-06-09 00:46:23'),
(332, 360, 3, 'S', '2026-06-09 00:46:23'),
(333, 360, 2, 'C', '2026-06-09 00:46:23'),
(334, 360, 4, 'C', '2026-06-09 00:46:23'),
(335, 360, 5, 'A', '2026-06-09 00:46:23'),
(336, 347, 1, 'C', '2026-06-09 00:46:23'),
(337, 347, 3, 'C', '2026-06-09 00:46:23'),
(338, 347, 2, 'C', '2026-06-09 00:46:23'),
(339, 347, 4, 'C', '2026-06-09 00:46:23'),
(340, 347, 5, 'C', '2026-06-09 00:46:23'),
(341, 351, 1, 'C', '2026-06-09 00:46:24'),
(342, 351, 3, 'B', '2026-06-09 00:46:24'),
(343, 351, 2, 'B', '2026-06-09 00:46:24'),
(344, 351, 4, 'C', '2026-06-09 00:46:24'),
(345, 351, 5, 'C', '2026-06-09 00:46:24'),
(346, 358, 1, 'S', '2026-06-09 00:46:42'),
(347, 358, 3, 'S', '2026-06-09 00:46:42'),
(348, 358, 2, 'S', '2026-06-09 00:46:42'),
(349, 358, 4, 'S', '2026-06-09 00:46:42'),
(350, 358, 5, 'S', '2026-06-09 00:46:42'),
(351, 357, 1, 'S', '2026-06-09 00:46:47'),
(352, 357, 3, 'S', '2026-06-09 00:46:47'),
(353, 357, 2, 'S', '2026-06-09 00:46:47'),
(354, 357, 4, 'S', '2026-06-09 00:46:47'),
(355, 357, 5, 'B', '2026-06-09 00:46:47'),
(356, 356, 1, 'C', '2026-06-09 00:46:56'),
(357, 356, 3, 'C', '2026-06-09 00:46:56'),
(358, 356, 2, 'C', '2026-06-09 00:46:56'),
(359, 356, 4, 'C', '2026-06-09 00:46:56'),
(360, 356, 5, 'C', '2026-06-09 00:46:56'),
(361, 361, 1, 'C', '2026-06-09 00:53:38'),
(362, 361, 3, 'C', '2026-06-09 00:53:38'),
(363, 361, 2, 'C', '2026-06-09 00:53:38'),
(364, 361, 4, 'C', '2026-06-09 00:53:39'),
(365, 361, 5, 'C', '2026-06-09 00:53:39'),
(366, 362, 1, 'C', '2026-06-09 00:59:42'),
(367, 362, 3, 'C', '2026-06-09 00:59:42'),
(368, 362, 2, 'C', '2026-06-09 00:59:42'),
(369, 362, 4, 'C', '2026-06-09 00:59:42'),
(370, 362, 5, 'C', '2026-06-09 00:59:42'),
(371, 363, 1, 'C', '2026-06-09 22:06:44'),
(372, 363, 3, 'C', '2026-06-09 22:06:44'),
(373, 363, 2, 'C', '2026-06-09 22:06:44'),
(374, 363, 4, 'C', '2026-06-09 22:06:44'),
(375, 363, 5, 'C', '2026-06-09 22:06:44'),
(376, 364, 1, 'S', '2026-06-09 22:10:53'),
(377, 364, 3, 'S', '2026-06-09 22:10:53'),
(378, 364, 2, 'S', '2026-06-09 22:10:53'),
(379, 364, 4, 'S', '2026-06-09 22:10:53'),
(380, 364, 5, 'S', '2026-06-09 22:10:53'),
(381, 366, 1, 'C', '2026-06-10 20:33:29'),
(382, 366, 3, 'C', '2026-06-10 20:33:29'),
(383, 366, 2, 'C', '2026-06-10 20:33:29'),
(384, 366, 4, 'C', '2026-06-10 20:33:29'),
(385, 366, 5, 'C', '2026-06-10 20:33:29'),
(386, 365, 1, 'C', '2026-06-10 20:36:05'),
(387, 365, 3, 'C', '2026-06-10 20:36:05'),
(388, 365, 2, 'C', '2026-06-10 20:36:05'),
(389, 365, 4, 'C', '2026-06-10 20:36:05'),
(390, 365, 5, 'C', '2026-06-10 20:36:05'),
(391, 367, 1, 'C', '2026-06-10 20:50:56'),
(392, 367, 3, 'C', '2026-06-10 20:50:56'),
(393, 367, 2, 'C', '2026-06-10 20:50:56'),
(394, 367, 4, 'C', '2026-06-10 20:50:56'),
(395, 367, 5, 'C', '2026-06-10 20:50:56'),
(424, 395, 2, 'A', '2026-06-10 21:15:07'),
(425, 397, 2, 'A', '2026-06-10 21:15:07'),
(434, 415, 1, 'B', '2026-06-12 23:18:19'),
(435, 415, 3, 'B', '2026-06-12 23:18:19'),
(436, 415, 2, 'B', '2026-06-12 23:18:19'),
(437, 415, 4, 'B', '2026-06-12 23:18:19'),
(438, 415, 5, 'C', '2026-06-12 23:18:19');

-- --------------------------------------------------------

--
-- 資料表結構 `venues`
--

CREATE TABLE `venues` (
  `venue_id` int(11) NOT NULL,
  `address_id` int(11) NOT NULL,
  `name` varchar(100) NOT NULL,
  `opening_hours` longtext CHARACTER SET utf8mb4 COLLATE utf8mb4_bin DEFAULT NULL CHECK (json_valid(`opening_hours`))
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- 傾印資料表的資料 `venues`
--

INSERT INTO `venues` (`venue_id`, `address_id`, `name`, `opening_hours`) VALUES
(1, 1, '幸福國中籃球場', '{\"weekday\":[\"00:00\",\"23:59\"],\"weekend\":[\"00:00\",\"23:59\"],\"regular_off\":[],\"special_off\":[]}'),
(2, 2, '南美國小田徑場', '{\"weekday\":[\"00:00\",\"23:59\"],\"weekend\":[\"00:00\",\"23:59\"],\"regular_off\":[],\"special_off\":[]}'),
(3, 3, '長庚大學體育館', '{\"weekday\":[\"08:30\",\"21:30\"],\"weekend\":[\"08:30\",\"21:30\"],\"regular_off\":[\"weekday\"],\"special_off\":[]}'),
(4, 4, '迴龍國中小體育館', '{\"weekday\":[\"00:00\",\"23:59\"],\"weekend\":[\"00:00\",\"23:59\"],\"regular_off\":[],\"special_off\":[]}'),
(5, 3, '長庚大學羽球室', '{\"weekday\":[\"08:30\",\"21:30\"],\"weekend\":[\"08:30\",\"21:30\"],\"regular_off\":[\"weekday\"],\"special_off\":[]}'),
(6, 5, '壽山高中活動中心', '{\"weekday\":[\"00:00\",\"23:59\"],\"weekend\":[\"00:00\",\"23:59\"],\"regular_off\":[],\"special_off\":[]}'),
(7, 6, '體育大學綜合體育館', '{\"weekday\":[\"00:00\",\"23:59\"],\"weekend\":[\"00:00\",\"23:59\"],\"regular_off\":[\"weekday\",\"weekend\"],\"special_off\":[]}'),
(8, 7, '光啟高中田徑場', '{\"weekday\":[\"07:30\",\"17:00\"],\"weekend\":[\"07:30\",\"17:00\"],\"regular_off\":[\"weekday\"],\"special_off\":[]}'),
(9, 8, '籃球場館', '{\"weekday\":[\"00:00\",\"23:59\"],\"weekend\":[\"00:00\",\"23:59\"],\"regular_off\":[],\"special_off\":[]}'),
(10, 9, '龍華科技大學學生活動中心', '{\"weekday\":[\"00:00\",\"23:59\"],\"weekend\":[\"00:00\",\"23:59\"],\"regular_off\":[],\"special_off\":[]}'),
(11, 3, '長庚大學排球場', '{\"weekday\":[\"00:00\",\"23:59\"],\"weekend\":[\"00:00\",\"23:59\"],\"regular_off\":[\"weekday\"],\"special_off\":[]}'),
(12, 3, '長庚大學薄膜球場', '{\"weekday\":[\"08:30\",\"21:30\"],\"weekend\":[\"08:30\",\"21:30\"],\"regular_off\":[],\"special_off\":[]}'),
(13, 3, '長庚大學籃球場', '{\"weekday\":[\"00:00\",\"23:59\"],\"weekend\":[\"00:00\",\"23:59\"],\"regular_off\":[\"weekday\",\"weekend\"],\"special_off\":[]}'),
(14, 10, '龜山國小中正堂', '{\"weekday\":[\"00:00\",\"23:59\"],\"weekend\":[\"00:00\",\"23:59\"],\"regular_off\":[],\"special_off\":[]}'),
(15, 11, '新路國小籃球場', '{\"weekday\":[\"16:00\",\"18:30\"],\"weekend\":[\"06:30\",\"18:30\"],\"regular_off\":[],\"special_off\":[]}'),
(16, 12, '銘傳大學體育二館', '{\"weekday\":[\"00:00\",\"23:59\"],\"weekend\":[\"00:00\",\"23:59\"],\"regular_off\":[\"weekday\"],\"special_off\":[]}'),
(17, 12, '銘傳大學體育一館', '{\"weekday\":[\"00:00\",\"23:59\"],\"weekend\":[\"00:00\",\"23:59\"],\"regular_off\":[\"weekday\"],\"special_off\":[]}'),
(18, 12, '銘傳大學室外籃球場', '{\"weekday\":[\"00:00\",\"23:59\"],\"weekend\":[\"00:00\",\"23:59\"],\"regular_off\":[\"weekday\"],\"special_off\":[]}'),
(19, 13, '大湖國小籃球場(新)', '{\"weekday\":[\"08:00\",\"19:00\"],\"weekend\":[\"08:00\",\"19:00\"],\"regular_off\":[],\"special_off\":[]}'),
(20, 14, '幸福國小學生活動中心', '{\"weekday\":[\"00:00\",\"23:59\"],\"weekend\":[\"00:00\",\"23:59\"],\"regular_off\":[],\"special_off\":[]}'),
(21, 15, '福源國小籃球場', '{\"weekday\":[\"16:00\",\"18:00\"],\"weekend\":[\"08:00\",\"18:00\"],\"regular_off\":[],\"special_off\":[]}'),
(22, 14, '幸福國小操場', '{\"weekday\":[\"00:00\",\"23:59\"],\"weekend\":[\"00:00\",\"23:59\"],\"regular_off\":[],\"special_off\":[]}'),
(23, 16, '龍壽國小田徑場', '{\"weekday\":[\"08:30\",\"17:30\"],\"weekend\":[\"08:30\",\"17:30\"],\"regular_off\":[\"weekday\"],\"special_off\":[]}'),
(24, 17, '大坑國小田徑場', '{\"weekday\":[\"07:30\",\"16:30\"],\"weekend\":[\"07:30\",\"16:30\"],\"regular_off\":[\"weekday\"],\"special_off\":[]}'),
(25, 17, '大坑國小活動中心', '{\"weekday\":[\"07:30\",\"17:30\"],\"weekend\":[\"07:30\",\"17:30\"],\"regular_off\":[\"weekday\"],\"special_off\":[]}'),
(26, 18, '文欣國小田徑場附設籃球場', '{\"weekday\":[\"00:00\",\"23:59\"],\"weekend\":[\"00:00\",\"23:59\"],\"regular_off\":[],\"special_off\":[]}'),
(27, 19, '楓樹國小籃球場', '{\"weekday\":[\"00:00\",\"23:59\"],\"weekend\":[\"00:00\",\"23:59\"],\"regular_off\":[],\"special_off\":[]}'),
(28, 20, '大崗國中田徑場、籃球場', '{\"weekday\":[\"00:00\",\"23:59\"],\"weekend\":[\"00:00\",\"23:59\"],\"regular_off\":[],\"special_off\":[]}'),
(29, 13, '大湖國小籃球場', '{\"weekday\":[\"08:00\",\"19:00\"],\"weekend\":[\"08:00\",\"19:00\"],\"regular_off\":[],\"special_off\":[]}'),
(30, 16, '龍壽國小活動中心', '{\"weekday\":[\"00:00\",\"23:59\"],\"weekend\":[\"00:00\",\"23:59\"],\"regular_off\":[],\"special_off\":[]}'),
(31, 21, '華美公園', '{\"weekday\":[\"00:00\",\"23:59\"],\"weekend\":[\"00:00\",\"23:59\"],\"regular_off\":[],\"special_off\":[]}'),
(32, 22, '中正公園籃球場 ', '{\"weekday\":[\"00:00\",\"23:59\"],\"weekend\":[\"00:00\",\"23:59\"],\"regular_off\":[],\"special_off\":[]}'),
(33, 23, '南崁溪河濱公園籃球場 ', '{\"weekday\":[\"00:00\",\"23:59\"],\"weekend\":[\"00:00\",\"23:59\"],\"regular_off\":[],\"special_off\":[]}'),
(34, 24, '第三運動公園', '{\"weekday\":[\"00:00\",\"23:59\"],\"weekend\":[\"00:00\",\"23:59\"],\"regular_off\":[],\"special_off\":[]}'),
(35, 25, '第二運動公園', '{\"weekday\":[\"00:00\",\"23:59\"],\"weekend\":[\"00:00\",\"23:59\"],\"regular_off\":[],\"special_off\":[]}'),
(36, 26, '大崗國小活動中心', '{\"weekday\":[\"00:00\",\"23:59\"],\"weekend\":[\"00:00\",\"23:59\"],\"regular_off\":[],\"special_off\":[]}'),
(37, 10, '籃球場(半場)', '{\"weekday\":[\"00:00\",\"23:59\"],\"weekend\":[\"00:00\",\"23:59\"],\"regular_off\":[],\"special_off\":[]}'),
(38, 27, '長庚國小活動中心', '{\"weekday\":[\"00:00\",\"23:59\"],\"weekend\":[\"00:00\",\"23:59\"],\"regular_off\":[],\"special_off\":[]}'),
(39, 6, '體育大學羽球場(館)', '{\"weekday\":[\"18:00\",\"21:00\"],\"weekend\":[\"18:00\",\"21:00\"],\"regular_off\":[\"weekday\"],\"special_off\":[]}'),
(40, 28, '中央警察大學體育館', '{\"weekday\":[\"00:00\",\"23:59\"],\"weekend\":[\"00:00\",\"23:59\"],\"regular_off\":[],\"special_off\":[]}'),
(41, 29, '長庚科技大學體育館', '{\"weekday\":[\"00:00\",\"23:59\"],\"weekend\":[\"00:00\",\"23:59\"],\"regular_off\":[],\"special_off\":[]}'),
(42, 30, '宏德高商進修學校籃球場', '{\"weekday\":[\"00:00\",\"23:59\"],\"weekend\":[\"00:00\",\"23:59\"],\"regular_off\":[],\"special_off\":[]}'),
(43, 31, '迴龍活動中心前籃球場', '{\"weekday\":[\"00:00\",\"23:59\"],\"weekend\":[\"00:00\",\"23:59\"],\"regular_off\":[],\"special_off\":[]}'),
(44, 32, '文化公園', '{\"weekday\":[\"00:00\",\"23:59\"],\"weekend\":[\"00:00\",\"23:59\"],\"regular_off\":[],\"special_off\":[]}'),
(45, 33, '楓樹籃球場', '{\"weekday\":[\"00:00\",\"23:59\"],\"weekend\":[\"00:00\",\"23:59\"],\"regular_off\":[],\"special_off\":[]}'),
(46, 34, '大坪頂公園', '{\"weekday\":[\"00:00\",\"23:59\"],\"weekend\":[\"00:00\",\"23:59\"],\"regular_off\":[],\"special_off\":[]}'),
(47, 35, '廣六公園', '{\"weekday\":[\"00:00\",\"23:59\"],\"weekend\":[\"00:00\",\"23:59\"],\"regular_off\":[],\"special_off\":[]}'),
(48, 36, '樂善公園', '{\"weekday\":[\"00:00\",\"23:59\"],\"weekend\":[\"00:00\",\"23:59\"],\"regular_off\":[],\"special_off\":[]}'),
(49, 37, '迴龍加油站後', '{\"weekday\":[\"00:00\",\"23:59\"],\"weekend\":[\"00:00\",\"23:59\"],\"regular_off\":[],\"special_off\":[]}'),
(50, 38, '桃園市成功橋下運動暨休憩空間', '{\"weekday\":[\"00:00\",\"23:59\"],\"weekend\":[\"00:00\",\"23:59\"],\"regular_off\":[],\"special_off\":[]}'),
(51, 39, '龜山國中籃球場', '{\"weekday\":[\"00:00\",\"23:59\"],\"weekend\":[\"00:00\",\"23:59\"],\"regular_off\":[],\"special_off\":[]}'),
(52, 40, '大三元麻將24hr棋牌會館-林口龜山店', '{\"weekday\":[\"00:00\",\"23:59\"],\"weekend\":[\"00:00\",\"23:59\"],\"regular_off\":[],\"special_off\":[]}'),
(53, 41, '我家相公-24H桌遊體驗館(龜山銘傳)', '{\"weekday\":[\"00:00\",\"23:59\"],\"weekend\":[\"00:00\",\"23:59\"],\"regular_off\":[],\"special_off\":[]}'),
(54, 42, '三加一自助麻將', '{\"weekday\":[\"00:00\",\"23:59\"],\"weekend\":[\"00:00\",\"23:59\"],\"regular_off\":[],\"special_off\":[]}'),
(55, 43, '雀特GPT 24H包廂式自助桌遊店', '{\"weekday\":[\"00:00\",\"23:59\"],\"weekend\":[\"00:00\",\"23:59\"],\"regular_off\":[],\"special_off\":[]}'),
(56, 44, '輔又贏棋牌館 龍華店', '{\"weekday\":[\"00:00\",\"23:59\"],\"weekend\":[\"00:00\",\"23:59\"],\"regular_off\":[],\"special_off\":[]}'),
(57, 45, '藝博棋牌社', '{\"weekday\":[\"00:00\",\"23:59\"],\"weekend\":[\"00:00\",\"23:59\"],\"regular_off\":[],\"special_off\":[]}'),
(58, 46, '東瀛WIN自助桌遊24H【棋牌|包廂|GAME】', '{\"weekday\":[\"00:00\",\"23:59\"],\"weekend\":[\"00:00\",\"23:59\"],\"regular_off\":[],\"special_off\":[]}'),
(59, 47, '銘傳棋牌會館', '{\"weekday\":[\"00:00\",\"23:59\"],\"weekend\":[\"00:00\",\"23:59\"],\"regular_off\":[],\"special_off\":[]}'),
(65, 48, '板橋體育館二館-測試', '{\"weekday\":[\"08:00\",\"22:00\"],\"weekend\":[\"08:00\",\"22:00\"],\"regular_off\":[],\"special_off\":[]}'),
(66, 48, '板橋體育館二館-測試', '{\"weekday\":[\"08:00\",\"22:00\"],\"weekend\":[\"08:00\",\"22:00\"],\"regular_off\":[],\"special_off\":[]}'),
(68, 48, '板橋體育館二館-測試', '{\"weekday\":[\"08:00\",\"22:00\"],\"weekend\":[\"08:00\",\"22:00\"],\"regular_off\":[],\"special_off\":[]}'),
(77, 54, 'Test Venue with Courts', '{\"weekday\":[\"00:00\",\"23:59\"],\"weekend\":[\"00:00\",\"23:59\"],\"regular_off\":[],\"special_off\":[]}'),
(79, 56, '龜山運動中心', '{\"weekday\":[\"00:00\",\"23:59\"],\"weekend\":[\"00:00\",\"23:59\"],\"regular_off\":[],\"special_off\":[]}'),
(82, 60, '測試發起新場地', '{\"weekday\": [\"09:00\", \"22:00\"], \"weekend\": [\"08:00\", \"23:00\"], \"regular_off\": [7], \"special_off\": [\"2026-10-10\"]}');

-- --------------------------------------------------------

--
-- 資料表結構 `venue_facilities`
--

CREATE TABLE `venue_facilities` (
  `id` int(11) NOT NULL,
  `venue_id` int(11) NOT NULL,
  `facility_id` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- 傾印資料表的資料 `venue_facilities`
--

INSERT INTO `venue_facilities` (`id`, `venue_id`, `facility_id`) VALUES
(1, 1, 1),
(2, 2, 1),
(3, 3, 1),
(4, 3, 4),
(5, 4, 1),
(6, 5, 1),
(7, 5, 4),
(8, 6, 1),
(9, 7, 1),
(10, 8, 1),
(11, 9, 1),
(12, 10, 1),
(13, 11, 1),
(14, 11, 4),
(15, 12, 1),
(16, 12, 4),
(17, 13, 1),
(18, 13, 4),
(19, 14, 1),
(20, 15, 1),
(21, 15, 4),
(22, 16, 1),
(23, 17, 1),
(24, 17, 4),
(25, 18, 1),
(26, 19, 1),
(27, 20, 1),
(28, 21, 1),
(29, 21, 4),
(30, 23, 1),
(31, 26, 1),
(32, 26, 4),
(33, 27, 1),
(34, 27, 4),
(35, 28, 1),
(36, 28, 4),
(37, 29, 1),
(38, 30, 1),
(39, 36, 1),
(40, 36, 4),
(41, 39, 1),
(42, 41, 1),
(43, 41, 4),
(44, 50, 1),
(45, 51, 1),
(46, 51, 4),
(47, 52, 1),
(48, 52, 2),
(49, 52, 3),
(50, 53, 2),
(51, 53, 3),
(52, 55, 2),
(53, 55, 3),
(54, 56, 2),
(55, 56, 3),
(56, 57, 2),
(57, 57, 3),
(58, 58, 2),
(59, 58, 3),
(95, 77, 1),
(97, 79, 1),
(99, 79, 2),
(100, 79, 3),
(98, 79, 4),
(115, 82, 1),
(114, 82, 2),
(120, 82, 3),
(116, 82, 4),
(117, 82, 5),
(118, 82, 6),
(119, 82, 7);

--
-- 已傾印資料表的索引
--

--
-- 資料表索引 `address`
--
ALTER TABLE `address`
  ADD PRIMARY KEY (`address_id`);

--
-- 資料表索引 `announcements`
--
ALTER TABLE `announcements`
  ADD PRIMARY KEY (`announcement_id`);

--
-- 資料表索引 `blacklist`
--
ALTER TABLE `blacklist`
  ADD PRIMARY KEY (`blacklist_id`),
  ADD KEY `user_id` (`user_id`);

--
-- 資料表索引 `court`
--
ALTER TABLE `court`
  ADD PRIMARY KEY (`court_id`),
  ADD KEY `venue_id` (`venue_id`);

--
-- 資料表索引 `court_conflicts`
--
ALTER TABLE `court_conflicts`
  ADD PRIMARY KEY (`conflict_id`),
  ADD UNIQUE KEY `court_id_1` (`court_id_1`,`court_id_2`),
  ADD KEY `court_id_2` (`court_id_2`);

--
-- 資料表索引 `court_sports`
--
ALTER TABLE `court_sports`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `court_id_sport_id` (`court_id`,`sport_id`),
  ADD KEY `sport_id` (`sport_id`);

--
-- 資料表索引 `facilities`
--
ALTER TABLE `facilities`
  ADD PRIMARY KEY (`facility_id`),
  ADD UNIQUE KEY `name` (`name`);

--
-- 資料表索引 `feedbacks`
--
ALTER TABLE `feedbacks`
  ADD PRIMARY KEY (`feedback_id`),
  ADD KEY `feedbacks_user_id_fk` (`user_id`),
  ADD KEY `feedbacks_feedback_type_id_fk` (`feedback_type_id`);

--
-- 資料表索引 `feedback_types`
--
ALTER TABLE `feedback_types`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `name` (`name`);

--
-- 資料表索引 `gamesmatches`
--
ALTER TABLE `gamesmatches`
  ADD PRIMARY KEY (`game_id`),
  ADD KEY `user_id` (`user_id`),
  ADD KEY `sport_id` (`sport_id`),
  ADD KEY `court_id` (`court_id`);

--
-- 資料表索引 `game_bulletins`
--
ALTER TABLE `game_bulletins`
  ADD PRIMARY KEY (`bulletin_id`),
  ADD KEY `game_id` (`game_id`);

--
-- 資料表索引 `keep`
--
ALTER TABLE `keep`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `user_id_game_id` (`user_id`,`game_id`),
  ADD KEY `game_id` (`game_id`);

--
-- 資料表索引 `match_participants`
--
ALTER TABLE `match_participants`
  ADD PRIMARY KEY (`list_id`),
  ADD UNIQUE KEY `game_id` (`game_id`,`user_id`),
  ADD KEY `user_id` (`user_id`);

--
-- 資料表索引 `notification`
--
ALTER TABLE `notification`
  ADD PRIMARY KEY (`notification_id`),
  ADD KEY `fk_notification_game` (`game_id`),
  ADD KEY `user_id` (`user_id`);

--
-- 資料表索引 `penalty_rules`
--
ALTER TABLE `penalty_rules`
  ADD PRIMARY KEY (`rule_id`),
  ADD UNIQUE KEY `reason` (`reason`);

--
-- 資料表索引 `reports`
--
ALTER TABLE `reports`
  ADD PRIMARY KEY (`report_id`),
  ADD UNIQUE KEY `game_id` (`game_id`,`reporter_id`,`offender_id`),
  ADD KEY `reporter_id` (`reporter_id`),
  ADD KEY `offender_id` (`offender_id`),
  ADD KEY `rule_id` (`rule_id`),
  ADD KEY `reviewed_by` (`reviewed_by`);

--
-- 資料表索引 `sports`
--
ALTER TABLE `sports`
  ADD PRIMARY KEY (`sport_id`),
  ADD UNIQUE KEY `sport_name` (`sport_name`);

--
-- 資料表索引 `taiwan_regions`
--
ALTER TABLE `taiwan_regions`
  ADD PRIMARY KEY (`zipcode`),
  ADD UNIQUE KEY `idx_city_district` (`city`,`district`);

--
-- 資料表索引 `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`user_id`),
  ADD UNIQUE KEY `phone` (`phone`);

--
-- 資料表索引 `user_sport_levels`
--
ALTER TABLE `user_sport_levels`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `user_id_sport_id` (`user_id`,`sport_id`),
  ADD KEY `sport_id` (`sport_id`);

--
-- 資料表索引 `venues`
--
ALTER TABLE `venues`
  ADD PRIMARY KEY (`venue_id`),
  ADD KEY `address_id` (`address_id`);

--
-- 資料表索引 `venue_facilities`
--
ALTER TABLE `venue_facilities`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `venue_id_facility_id` (`venue_id`,`facility_id`),
  ADD KEY `facility_id` (`facility_id`);

--
-- 在傾印的資料表使用自動遞增(AUTO_INCREMENT)
--

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `address`
--
ALTER TABLE `address`
  MODIFY `address_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=61;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `announcements`
--
ALTER TABLE `announcements`
  MODIFY `announcement_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=28;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `blacklist`
--
ALTER TABLE `blacklist`
  MODIFY `blacklist_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=21;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `court`
--
ALTER TABLE `court`
  MODIFY `court_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=204;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `court_conflicts`
--
ALTER TABLE `court_conflicts`
  MODIFY `conflict_id` int(11) NOT NULL AUTO_INCREMENT;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `court_sports`
--
ALTER TABLE `court_sports`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=293;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `facilities`
--
ALTER TABLE `facilities`
  MODIFY `facility_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=9;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `feedbacks`
--
ALTER TABLE `feedbacks`
  MODIFY `feedback_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=14;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `feedback_types`
--
ALTER TABLE `feedback_types`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `gamesmatches`
--
ALTER TABLE `gamesmatches`
  MODIFY `game_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=1481;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `game_bulletins`
--
ALTER TABLE `game_bulletins`
  MODIFY `bulletin_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=54;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `keep`
--
ALTER TABLE `keep`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `match_participants`
--
ALTER TABLE `match_participants`
  MODIFY `list_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=774;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `notification`
--
ALTER TABLE `notification`
  MODIFY `notification_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=1986;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `penalty_rules`
--
ALTER TABLE `penalty_rules`
  MODIFY `rule_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=13;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `reports`
--
ALTER TABLE `reports`
  MODIFY `report_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=112;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `sports`
--
ALTER TABLE `sports`
  MODIFY `sport_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=8;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `users`
--
ALTER TABLE `users`
  MODIFY `user_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=416;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `user_sport_levels`
--
ALTER TABLE `user_sport_levels`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=439;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `venues`
--
ALTER TABLE `venues`
  MODIFY `venue_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=83;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `venue_facilities`
--
ALTER TABLE `venue_facilities`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=121;

--
-- 已傾印資料表的限制式
--

--
-- 資料表的限制式 `blacklist`
--
ALTER TABLE `blacklist`
  ADD CONSTRAINT `blacklist_ibfk_1` FOREIGN KEY (`user_id`) REFERENCES `users` (`user_id`) ON DELETE CASCADE ON UPDATE CASCADE;

--
-- 資料表的限制式 `court`
--
ALTER TABLE `court`
  ADD CONSTRAINT `court_ibfk_1` FOREIGN KEY (`venue_id`) REFERENCES `venues` (`venue_id`) ON DELETE CASCADE ON UPDATE CASCADE;

--
-- 資料表的限制式 `court_conflicts`
--
ALTER TABLE `court_conflicts`
  ADD CONSTRAINT `court_conflicts_ibfk_1` FOREIGN KEY (`court_id_1`) REFERENCES `court` (`court_id`) ON DELETE CASCADE ON UPDATE CASCADE,
  ADD CONSTRAINT `court_conflicts_ibfk_2` FOREIGN KEY (`court_id_2`) REFERENCES `court` (`court_id`) ON DELETE CASCADE ON UPDATE CASCADE;

--
-- 資料表的限制式 `court_sports`
--
ALTER TABLE `court_sports`
  ADD CONSTRAINT `court_sports_ibfk_1` FOREIGN KEY (`court_id`) REFERENCES `court` (`court_id`) ON DELETE CASCADE ON UPDATE CASCADE,
  ADD CONSTRAINT `court_sports_ibfk_2` FOREIGN KEY (`sport_id`) REFERENCES `sports` (`sport_id`) ON DELETE CASCADE ON UPDATE CASCADE;

--
-- 資料表的限制式 `feedbacks`
--
ALTER TABLE `feedbacks`
  ADD CONSTRAINT `feedbacks_user_id_fk` FOREIGN KEY (`user_id`) REFERENCES `users` (`user_id`) ON DELETE SET NULL ON UPDATE CASCADE,
  ADD CONSTRAINT `feedbacks_feedback_type_id_fk` FOREIGN KEY (`feedback_type_id`) REFERENCES `feedback_types` (`id`) ON DELETE RESTRICT ON UPDATE CASCADE;

--
-- 資料表的限制式 `gamesmatches`
--
ALTER TABLE `gamesmatches`
  ADD CONSTRAINT `gamesmatches_ibfk_1` FOREIGN KEY (`user_id`) REFERENCES `users` (`user_id`) ON UPDATE CASCADE,
  ADD CONSTRAINT `gamesmatches_ibfk_3` FOREIGN KEY (`sport_id`) REFERENCES `sports` (`sport_id`) ON UPDATE CASCADE,
  ADD CONSTRAINT `gamesmatches_ibfk_4` FOREIGN KEY (`court_id`) REFERENCES `court` (`court_id`);

--
-- 資料表的限制式 `game_bulletins`
--
ALTER TABLE `game_bulletins`
  ADD CONSTRAINT `game_bulletins_ibfk_1` FOREIGN KEY (`game_id`) REFERENCES `gamesmatches` (`game_id`) ON DELETE CASCADE ON UPDATE CASCADE;

--
-- 資料表的限制式 `keep`
--
ALTER TABLE `keep`
  ADD CONSTRAINT `keep_ibfk_1` FOREIGN KEY (`user_id`) REFERENCES `users` (`user_id`),
  ADD CONSTRAINT `keep_ibfk_2` FOREIGN KEY (`game_id`) REFERENCES `gamesmatches` (`game_id`);

--
-- 資料表的限制式 `match_participants`
--
ALTER TABLE `match_participants`
  ADD CONSTRAINT `match_participants_ibfk_1` FOREIGN KEY (`game_id`) REFERENCES `gamesmatches` (`game_id`) ON DELETE CASCADE ON UPDATE CASCADE,
  ADD CONSTRAINT `match_participants_ibfk_2` FOREIGN KEY (`user_id`) REFERENCES `users` (`user_id`) ON DELETE CASCADE ON UPDATE CASCADE;

--
-- 資料表的限制式 `notification`
--
ALTER TABLE `notification`
  ADD CONSTRAINT `fk_notification_game` FOREIGN KEY (`game_id`) REFERENCES `gamesmatches` (`game_id`) ON DELETE CASCADE,
  ADD CONSTRAINT `notification_ibfk_1` FOREIGN KEY (`user_id`) REFERENCES `users` (`user_id`);

--
-- 資料表的限制式 `reports`
--
ALTER TABLE `reports`
  ADD CONSTRAINT `reports_ibfk_1` FOREIGN KEY (`game_id`) REFERENCES `gamesmatches` (`game_id`) ON DELETE CASCADE ON UPDATE CASCADE,
  ADD CONSTRAINT `reports_ibfk_2` FOREIGN KEY (`reporter_id`) REFERENCES `users` (`user_id`) ON UPDATE CASCADE,
  ADD CONSTRAINT `reports_ibfk_3` FOREIGN KEY (`offender_id`) REFERENCES `users` (`user_id`) ON UPDATE CASCADE,
  ADD CONSTRAINT `reports_ibfk_4` FOREIGN KEY (`rule_id`) REFERENCES `penalty_rules` (`rule_id`) ON DELETE SET NULL ON UPDATE CASCADE,
  ADD CONSTRAINT `reports_ibfk_5` FOREIGN KEY (`reviewed_by`) REFERENCES `users` (`user_id`) ON DELETE SET NULL ON UPDATE CASCADE;

--
-- 資料表的限制式 `user_sport_levels`
--
ALTER TABLE `user_sport_levels`
  ADD CONSTRAINT `user_sport_levels_ibfk_1` FOREIGN KEY (`user_id`) REFERENCES `users` (`user_id`) ON DELETE CASCADE ON UPDATE CASCADE,
  ADD CONSTRAINT `user_sport_levels_ibfk_2` FOREIGN KEY (`sport_id`) REFERENCES `sports` (`sport_id`) ON DELETE CASCADE ON UPDATE CASCADE;

--
-- 資料表的限制式 `venues`
--
ALTER TABLE `venues`
  ADD CONSTRAINT `venues_ibfk_1` FOREIGN KEY (`address_id`) REFERENCES `address` (`address_id`) ON UPDATE CASCADE;

--
-- 資料表的限制式 `venue_facilities`
--
ALTER TABLE `venue_facilities`
  ADD CONSTRAINT `venue_facilities_ibfk_1` FOREIGN KEY (`venue_id`) REFERENCES `venues` (`venue_id`) ON DELETE CASCADE ON UPDATE CASCADE,
  ADD CONSTRAINT `venue_facilities_ibfk_2` FOREIGN KEY (`facility_id`) REFERENCES `facilities` (`facility_id`) ON DELETE CASCADE ON UPDATE CASCADE;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
